{
  "id": "q_119607",
  "mathoverflow_id": 119607,
  "url": "https://mathoverflow.net/questions/119607/degree-of-freedom-restricted-by-inequalities",
  "title": "ds.dynamical systems - Degree of freedom restricted by inequalities",
  "body": "Motivational example Consider a polyhedral graph $G$ . A realization of $G$ is given by a convex polyhedron which is - essentially - characterized by the angles between the edges emanating from each vertex. There are $\\sum_v d(v) = 2E$ such angles, so the degree of freedom $\\mathsf{d}$ of a polyhedron is $\\mathsf{d}\\leq 2E$ (with $E$ the number of edges). But the angles cannot be choosen freely: for every (flat) face of the polyhedron the interior angle sum must obey a (strict) equality. Thus, $\\mathsf{d}\\leq 2E - F$ (with $F$ the number of faces). Because the polyhedron is supposed to be convex there is another restriction: for every vertex $v$ of the polyhedron the sum of angles between the edges emanating from $v$ has to be less than $2\\pi$ . Thus, we have $V$ additional restricting inequalities (with $V$ the number of vertices). But because inequalities are somehow \"weaker\" than equalities we cannot simply deduce that $$\\mathsf{d}\\leq 2E - F - V = E - \\chi = E - 2$$ (with $\\chi$ the Euler characteristic of the graph/polyhedron). But by which amount $\\mathsf{d}$ might be greater than $E-2$ ? Question The original question is (more abstractly) concerned with the question how inequalities enter into the calculation of a \"degree of freedom\": How can an (eventually non-integer) degree of freedom be defined when inequalities are involved? ds.dynamical-systems graph-theory Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jan 22, 2013 at 23:01 Hans-Peter Stricker 9,934 7 7 gold badges 59 59 silver badges 122 122 bronze badges $\\endgroup$ 2 $\\begingroup$ I'm not sure what you mean by \"eventually non-integer degree of freedom\". The realization space of a combinatorial type is a very nice semialgebraic set with a well defined notion of dimension. To measure the complexity of such realization spaces one may start looking at their topology. For 3 dimensions the space is contractible, though this phenomenon fails maximally in higher dimensions (cf. Mnev universality). $\\endgroup$ Gjergji Zaimi –  Gjergji Zaimi 2013-01-23 03:25:11 +00:00 Commented Jan 23, 2013 at 3:25 $\\begingroup$ Where can I learn more about \"realization spaces of combinatorial types\"? $\\endgroup$ Hans-Peter Stricker –  Hans-Peter Stricker 2013-01-23 07:15:00 +00:00 Commented Jan 23, 2013 at 7:15 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ds.dynamical-systems graph-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 5 Parametrizing the realization space of a polyhedron by its edges Related 0 Degree constrained edge partitioning (version 2) 1 Does Euler's formula imply bounds on the degree of vertices in a 3-polytopal graph? 2 Ways to look at a polyhedral graph 4 Convex polyhedra, combinatorial types and Symmetry 4 Can't lower bound be improved on number of light edges in planar graph with minimum degree five? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 119607, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ds.dynamical-systems,graph-theory,ds.dynamical-systems,graph-theory",
  "scraped_at": "2026-01-14T04:11:45.968839",
  "answer": ""
}