{
  "id": "q_125260",
  "mathoverflow_id": 125260,
  "url": "https://mathoverflow.net/questions/125260/simple-roots-of-a-reflection-subgroup",
  "title": "coxeter groups - simple roots of a reflection subgroup",
  "body": "Consider a Hermitian symmetric pair of complex Lie algebras $(\\mathfrak{g},\\mathfrak{k})$ and split the set of roots into compact roots (i.e. roots of $\\mathfrak{k}$ ) and noncomapt roots $\\Delta = \\Delta_c \\cup \\Delta_n$ . Pick a weight $\\lambda$ and define the set of $\\lambda$ -singular roots $\\Psi_\\lambda$ as the subset of roots orthogonal to $\\lambda+\\rho$ . Now consider a subgroup $W_\\lambda$ of the Weyl group of $\\mathfrak{g}$ generated by the reflections $s_\\beta$ for $\\beta \\in M_\\lambda$ , where $M_\\lambda$ is the subset of noncompact roots that satisfy the following three conditions $\\beta$ is orthogonal to $\\Psi_\\lambda$ scalar product of $\\beta$ with $\\lambda+\\rho$ is a natural number if there is a long root in $\\Psi_\\lambda$ , then $\\beta$ is short It is known (by a result of Dyer ) that $W_\\lambda$ is in fact Weyl group of a root subsystem $\\Delta_\\lambda$ of $\\Delta$ . The article Resolutions and Hilbert series of the unitary highest weight modules of the exceptional groups provides an algorithm for computation of simple roots of $\\Delta_\\lambda$ in section 5.2. It uses a partial ordering (see section 4.6) on positive noncompat roots such that $\\beta$ covers $\\alpha$ iff $\\beta = \\alpha +\\alpha_i$ for some simple root $\\alpha_i$ . The claim is that the set of simple roots is given by differences of successive elements of $M_\\lambda$ . Q1: How to prove this? Q2: Is this true also for the classical cases? Q3: Was this order on positive roots already studied? Note that the weight is not arbitrary but it is such that the irreducible highest weight module $L_\\lambda$ is in fact unitarizable. root-systems coxeter-groups lie-algebras Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Mar 22, 2013 at 10:14 Vít Tuček 9,912 2 2 gold badges 33 33 silver badges 70 70 bronze badges $\\endgroup$ 4 $\\begingroup$ These seem to be reasonable questions, which the authors might be best able to answer: Enright (UCSD) or Hunziker (Baylor). $\\endgroup$ Jim Humphreys –  Jim Humphreys 2013-03-22 12:46:33 +00:00 Commented Mar 22, 2013 at 12:46 $\\begingroup$ I've emailed Hunziker about a week ago with no reply so far. I guess I should've cc'ed Enright as well. $\\endgroup$ Vít Tuček –  Vít Tuček 2013-03-22 14:30:54 +00:00 Commented Mar 22, 2013 at 14:30 $\\begingroup$ P.S. I haven't looked closely enough at this literature to answer your questions, but concerning Q2 note the paper [EW] on classical groups listed by Enright-Hunziker as to appear in Math. Annalen (in fact it was published in Annals of Math. 159 (2004), no. 1, 337–375). $\\endgroup$ Jim Humphreys –  Jim Humphreys 2013-03-22 19:36:31 +00:00 Commented Mar 22, 2013 at 19:36 $\\begingroup$ [EW]: Enright and Willenbring - Hilbert series, Howe duality and branching for classical groups ( MSN ). $\\endgroup$ LSpice –  LSpice 2019-07-01 23:56:38 +00:00 Commented Jul 1, 2019 at 23:56 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions root-systems coxeter-groups lie-algebras See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 6 Which linear combinations of simple roots are roots 1 On pairs of roots which are orthogonal but not strongly orthogonal 4 Verma module and vanishing of extension groups 2 Real roots along root strings $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 125260, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "root-systems,coxeter-groups,lie-algebras,root-systems,coxeter-groups,lie-algebras",
  "scraped_at": "2026-01-14T04:11:48.209341",
  "answer": ""
}