{
  "id": "q_125374",
  "mathoverflow_id": 125374,
  "url": "https://mathoverflow.net/questions/125374/approximating-solutions-to-minima-of-the-discrete-lagrangian",
  "title": "na.numerical analysis - Approximating solutions to minima of the discrete Lagrangian",
  "body": "I have been stuck on this problem for a week and I'm not sure whether or not it is hard or I'm just missing something obvious. General gist of the problem I have a variational problem on a Riemannian manifold where I am approximating a Lagrangian with a discrete Lagrangian. I am looking for some sort of guarantee that critical points of the discrete Lagrangian can be approximated by curves of a certain level of differentiability such that they end up approximating a solution of the original problem. A reference would be great as I don't mind following this up myself but I don't know where to search. My specific problem I have a complete Riemannian manifold $M$ and I have a functional $f : C^{2}_{v_0, v_1}([0,1], M) \\rightarrow \\mathbb{R}$ defined over $C^2$ curves $x : [0, 1] \\rightarrow M$ satisfying $\\dot{x}(0) = v_0 \\in TM$ and $\\dot{x}(1) = v_1 \\in TM$ and we now add a few additional constraints such as $x(\\frac{1}{3}) = x_1$ and $x(\\frac{2}{3}) = x_2$ . The functional is then defined as $$ f(x) = \\int_0^1 \\| \\nabla_{\\dot{x}(t)} \\dot{x}(t) - V\\|^2 dt$$ where $V$ is a bounded Lipschitz (in the sense there is a $k$ such that $\\||V(y)\\| - \\|V(x)\\| | \\leq k d(x,y)$ ) smooth vector field. I now consider the discrete Lagrangian defined by the formula: $$ f_n(x_n) = \\dfrac{1}{N} \\left(\\sum_{i=1}^{N-1} \\|N^2(l_i^+ + l_i^-) - V\\|^2 \\right)$$ Here $x_i := x(\\frac{i}{N})$ , and the covariant derivative is approximated using the functions $l_i^+, l_i^-$ where I define $l_i^+$ by $\\log_{x_i} x_{i+1}$ and $l_i^-$ by $\\log_{x_i} x_{i-1}$ . Again, the $x_i$ are constrained under the same constraints by requiring that $N l_0^+ = v_0$ and $N l_N^- = -v_1$ . We can set $N$ to be a multiple of $3$ so that we can set $x_{\\frac{N}{3}} = x_1$ and $x_{\\frac{2N}{3}} = x_2$ . If I find a critical point of $f_n$ , call it $y_n$ , can I find a curve $y$ that's $C^2$ which agrees with $y_n$ at $t = \\frac{i}{N}$ such that $\\|f(y) - f_n(y_n)\\| \\rightarrow 0$ ? na.numerical-analysis calculus-of-variations riemannian-geometry oc.optimization-and-control Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Mar 23, 2013 at 13:03 muzzlator 121 4 4 bronze badges $\\endgroup$ 2 1 $\\begingroup$ This is a sort of interpolation problem. In flat space, good candidates are splines and Hermite intepolants. You might be able to use these locally. $\\endgroup$ timur –  timur 2013-03-23 19:55:47 +00:00 Commented Mar 23, 2013 at 19:55 $\\begingroup$ Thanks for the suggestion. I will try locally using minimisers of $\\int_{t_0}^{t_1} \\| x^{(2)} - V \\|^2$ and piecing them together. Maybe I can piece them together in a way so that I don't significantly add to the functionals value across any split. $\\endgroup$ muzzlator –  muzzlator 2013-03-24 02:53:55 +00:00 Commented Mar 24, 2013 at 2:53 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions na.numerical-analysis calculus-of-variations riemannian-geometry oc.optimization-and-control See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 3 An Optimization problem 14 Invariance of the l.h.s. of Euler-Lagrange equation 2 Gamma convergence for control problems with changing domains 3 Thin-Plate-Spline understanding and solution 1 Formulation of multipoint constraints using Lagrange multipliers for a time dependent problem (with the Finite Element Method) 3 (Non)triviality of the presymplectic current in Lagrangian field theory $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 125374, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "na.numerical-analysis,calculus-of-variations,riemannian-geometry,oc.optimization-and-control,na.numerical-analysis,calculus-of-variations,riemannian-geometry,oc.optimization-and-control",
  "scraped_at": "2026-01-14T04:12:10.639448",
  "answer": ""
}