{
  "id": "q_130104",
  "mathoverflow_id": 130104,
  "url": "https://mathoverflow.net/questions/130104/boundary-surfaces-in-a-3d-voronoi-tessellation-with-obstacles",
  "title": "mg.metric geometry - Boundary surfaces in a 3d Voronoi tessellation with obstacles",
  "body": "Let $x_1,\\dots,x_n$ be a set of points in $\\mathbb{R}^3$ and let $\\mathcal{O}_1 ,\\dots, \\mathcal{O}_m$ denote a set of polyhedral obstacles. What is the name for the surfaces that describe the boundaries of a Voronoi tessellation of $\\mathbb{R}^3$ with respect to the points $x_i$, using the shortest-path metric induced by the obstacles? By comparison, in $\\mathbb{R}^2$, it is easy to show that the boundaries of a Voronoi tesselation are hyperbolic arcs. mg.metric-geometry euclidean-geometry computational-geometry Share Cite Improve this question Follow edited Mar 5, 2019 at 6:39 Martin Sleziak 4,813 4 4 gold badges 39 39 silver badges 42 42 bronze badges asked May 8, 2013 at 18:07 John Gunnar Carlsson 1,125 6 6 silver badges 15 15 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions mg.metric-geometry euclidean-geometry computational-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 16 Weighted area of a Voronoi cell 3 Metric graphs and curvature 11 Segments of Voronoi Diagrams on smooth manifolds. Are they geodesics? 4 Comparing two Delaunay tessellations on a hyperbolic surface 4 Is there interesting structure in the space of Voronoi diagrams? 8 Dubins car shortest paths: Decidable? 1 Approximating the probability of a half-space using random Voronoi diagrams $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 130104, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "mg.metric-geometry,euclidean-geometry,computational-geometry,mg.metric-geometry,euclidean-geometry,computational-geometry",
  "scraped_at": "2026-01-14T04:12:12.885345",
  "answer": ""
}