{
  "id": "q_154892",
  "mathoverflow_id": 154892,
  "url": "https://mathoverflow.net/questions/154892/non-commutative-analogy-of-compact-open-topology",
  "title": "ra.rings and algebras - Non commutative analogy of compact-open topology",
  "body": "Let $R$ be a ring, define a topology on $AUT(R)$ (Or End(R)) with the following subbase: For every two 2-sided Ideal $I$ and $J$ , a subbase element is $B(I,J)=\\{f\\in AUT(R) \\mid f(I)+J=R\\}$ . We can reapet the same Idea for a $C^{*}$ algebra $A$ , instead of a ring R. In this case we require that the ideals are closed. Putting $A=C(X)$ , we can show that this topology is the $C^{*}$ algebraic analogy of compact open topology, defined on the space of homeomorphisms of $X$ . My questions: 1 Under what conditions on a ring R, the operation of \"inversion\", as a map on AUT(R), is continuous? 2 To what extent, this topology is useful, as a ring theoretical invariant? ra.rings-and-algebras c-star-algebras noncommutative-geometry Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jan 18, 2014 at 1:04 Ali Taghavi 1 $\\endgroup$ 3 $\\begingroup$ Can I ask you to describe how $\\mathcal{F}$ acts on morphisms? $\\endgroup$ Todd Trimble –  Todd Trimble 2014-01-18 01:13:02 +00:00 Commented Jan 18, 2014 at 1:13 $\\begingroup$ I apologize. my functor does not have a reasonable action on morphism, so I revise my question. $\\endgroup$ Ali Taghavi –  Ali Taghavi 2014-01-18 01:23:34 +00:00 Commented Jan 18, 2014 at 1:23 $\\begingroup$ Consider a simple $R$ (field, finite factor, ...) or a product of such. You can at most distinguish the number of factors, but not the differences among simple rings. So you have a \"commutative\" concept not very useful in non-commutative geometry. $\\endgroup$ user46855 –  user46855 2014-03-01 04:42:15 +00:00 Commented Mar 1, 2014 at 4:42 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ra.rings-and-algebras c-star-algebras noncommutative-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 10 What is an example of a ring in which the intersection of all maximal two-sided ideals is not equal to the Jacobson radical? 8 Artin Jacobson-semisimple rings are semisimple. Constructively, too? 32 Are Conway's omnific integers the Grothendieck group of the ordinals under commutative addition? 2 An example ellucidating proposition 2.8 in Milne's notes on commutative algebra 13 How should one look at the set of compatible ring structures on a given group? 4 The closure of all periodic homeomorphisms of circle 4 Left- and right-sided principal ideals of quaternions have same index? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 154892, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ra.rings-and-algebras,c-star-algebras,noncommutative-geometry,ra.rings-and-algebras,c-star-algebras,noncommutative-geometry",
  "scraped_at": "2026-01-14T04:12:17.352784",
  "answer": ""
}