{
  "id": "q_159371",
  "mathoverflow_id": 159371,
  "url": "https://mathoverflow.net/questions/159371/adjoint-orbit-of-twisted-loop-group",
  "title": "adjoint orbit of (twisted) loop group",
  "body": "Let $G$ be the twisted loop group of $SL_2(\\mathbb C)$ and let $g$ be its Lie algebra, where diagonal entries are even functions and off diagonal entries are odd functions (of loop parameter lambda). What are the adjoint orbits in $g$ ? Is the adjoint orbit structure known for all the (twisted) loop groups over complex simple Lie groups? loop-groups Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Mar 5, 2014 at 1:47 joe 31 1 1 bronze badge $\\endgroup$ 2 $\\begingroup$ What sort of structure on the adjoint orbits are you seeking? $\\endgroup$ Peter Crooks –  Peter Crooks 2014-03-05 02:05:33 +00:00 Commented Mar 5, 2014 at 2:05 $\\begingroup$ I am wondering if there is a normal form for an element in a loop algebra under formal adjoint action. For example in the ordinary sl_2(C) case, adjoint orbits are classified by determinant function, etc. $\\endgroup$ joe –  joe 2014-03-05 21:30:28 +00:00 Commented Mar 5, 2014 at 21:30 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions loop-groups See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 38 Why should affine lie algebras and quantum groups have equivalent representation theories? 8 What is the level of a positive energy loop group representation? 7 Concise mathematical definition of the fusion product on the Verlinde ring? 8 Central extensions of loop groups 6 Cartan decomposition of loop group 3 Non-invariant forms on loop Lie algebra of semisimple Lie group $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 159371, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "loop-groups,loop-groups",
  "scraped_at": "2026-01-14T04:12:19.613209",
  "answer": ""
}