{
  "id": "q_160949",
  "mathoverflow_id": 160949,
  "url": "https://mathoverflow.net/questions/160949/preimages-of-accessible-full-subcategories",
  "title": "ct.category theory - Preimages of accessible full subcategories",
  "body": "My question is ultimately about the model theory of $L_{\\infty, \\omega}$ , but it is more convenient to phrase it in terms of category theory. Suppose I have finitely accessible categories $\\mathcal{C}, \\mathcal{D}, \\mathcal{E}$ and functors $F : \\mathcal{C} \\to \\mathcal{E}$ and $G : \\mathcal{D} \\to \\mathcal{E}$ that preserve filtered colimits and finite-presentability of objects. Suppose $G : \\mathcal{D} \\to \\mathcal{E}$ is a fully faithful isofibration. Then we may assume without loss of generality that $\\mathcal{D}$ is a full subcategory of $\\mathcal{E}$ closed under isomorphisms and $G$ is the inclusion. Let $F^{-1} \\mathcal{D}$ be the preimage of $\\mathcal{D}$ in $\\mathcal{C}$ ; note that this is a full subcategory closed under isomorphisms. Is $F^{-1} \\mathcal{D}$ necessarily a finitely accessible category? It is certainly $\\aleph_1$ -accessible – but the only proof I know of uses a kind of back-and-forth construction which leaves the realm of finitely presentable objects. If so, does the inclusion $F^{-1} \\mathcal{D}$ preserve the finite-presentability of objects? In a closely related situation, the claim is false: take $\\mathcal{C} = [\\mathbb{2}, \\mathbf{Set}]$ , $\\mathcal{D} = \\mathbf{Set}$ , $\\mathcal{E} = \\mathbf{Set} \\times \\mathbf{Set}$ , $F$ the forgetful functor and $G$ the diagonal inclusion; then $F^{-1} \\mathcal{D}$ is isomorphic to the category of sets equipped with an endomorphism, hence finitely accessible; but $(\\mathbb{N}, s)$ is finitely presentable (indeed, free on one generator) in $F^{-1} \\mathcal{D}$ but not finitely presentable as an object in $\\mathcal{C}$ . It's worth noting that $F$ is an isofibration in this (non)example, so the strict pullback still computes the bicategorical pullback. It seems likely that the general case is very hard or even false, but I am hoping for a positive answer in the special case where: $F : \\mathcal{C} \\to \\mathcal{E}$ is faithful and conservative, $\\mathcal{C}$ , $\\mathcal{D}$ , and $\\mathcal{E}$ have only countably many isomorphism classes of finitely presentable objects, and there are only have finitely many morphisms between finitely presentable objects in $\\mathcal{C}$ , $\\mathcal{D}$ , and $\\mathcal{E}$ . These allow us to make a model-theoretic interpretation of the setup: $\\mathcal{E}$ is some category of models of a (many-sorted) theory $\\mathbb{T}$ in $L_{\\omega_1, \\omega}$ (but not an arbitrary one), $\\mathcal{D}$ is the category of models of an extension of $\\mathbb{T}$ (in the same language), and $\\mathcal{C}$ is the category of models of an extension of $\\mathbb{T}$ (in a possibly expanded language). ct.category-theory lo.logic model-theory accessible-categories Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Mar 20, 2014 at 18:04 Zhen Lin 17.6k 1 1 gold badge 51 51 silver badges 96 96 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ct.category-theory lo.logic model-theory accessible-categories See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 3 About reflective full subcategories and small-orthogonality classes 9 Around Vopěnka: Accessible category with small full discrete subcategories of arbitrary size? 4 About the Yoneda objects of a locally presentable category 11 What are the reflective subcategories of the category of presentable categories? 15 Is every accessible category well-powered? 12 Accessible functors not preserving lots of presentable objects 15 presentability rank of categories of coalgebras 10 When is the homotopy category of an accessible $\\infty$-category accessible? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 160949, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ct.category-theory,lo.logic,model-theory,accessible-categories,ct.category-theory,lo.logic,model-theory,accessible-categories",
  "scraped_at": "2026-01-14T04:12:21.843143",
  "answer": ""
}