{
  "id": "q_165867",
  "mathoverflow_id": 165867,
  "url": "https://mathoverflow.net/questions/165867/can-the-second-order-frame-bundle-of-a-2-d-manifold-be-embeded-inside-the-ordina",
  "title": "dg.differential geometry - Can the second order frame bundle of a 2-d manifold be embeded inside the ordinary frame bundle of a 3-d manifold?",
  "body": "I would like to know whether the second order frame bundle of a 2-d manifold can be embedded inside the ordinary frame bundle of a 3-d manifold. Explanation Suppose we have a 3D smooth manifold $\\mathcal{B}$ , which can be covered by a single chart, and a smooth 2D manifold $\\mathcal{S}$ embedded inside it. Consider the following bundle structure $P(\\mathcal{S})$ over $\\mathcal{S}$ : at each $p\\in\\mathcal{S}$ , we attach the set of all frames at (with an abuse of notation) $p\\in\\mathcal{B}$ , such that the first $2$ vectors of each frame spans $T_p\\mathcal{S}$ (i.e. the third vector is always transverse to $\\mathcal{S}$ ). $P(\\mathcal{S})$ is clearly a principal subbundle of the restriction of the frame bundle $F\\mathcal{B}$ of $\\mathcal{B}$ to $\\mathcal{S}$ . The structure group $G_0$ (and the standard fibre) is clearly a subset of $Gl(3,\\mathbb{R})$ , with elements of the form: the upper-left $2\\times 2$ block invertible, the $(3,3)$ element non-zero, the $(1,3)$ and $(2,3)$ elements zero. Now, consider a $G$ -structure over $\\mathcal{B}$ , where $G$ is a proper Lie subgroup of $Gl(3,\\mathbb{R})$ . Also, consider a non-holonomic $\\mathcal{G}$ -structure over $\\mathcal{S}$ (a non-holonomic $\\mathcal{G}$ -structure over $\\mathcal{S}$ is a $\\mathcal{G}$ -reduction of the non-holonomic frame bundle of $P(\\mathcal{S})$ ). $\\mathcal{G}$ is a proper subgroup of the (outer) semi-direct product $G_0\\times Gl(2,\\mathbb{R})\\times Lin(\\mathbb{R}^2,\\mathfrak{g}_0)$ , where $\\mathfrak{g}_0$ is the Lie algebra of $G_0$ . My question is, could the latter $\\mathcal{G}$ -structure be seen as immersed (or possibly embedded) inside the former $G$ -structure? If not,then is there any way (associated bundles or anything) to relate these two structures? dg.differential-geometry manifolds Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked May 11, 2014 at 19:35 Ayan 573 2 2 silver badges 13 13 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions dg.differential-geometry manifolds See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 3 Symmetry group for the frame bundle of a G-space 0 CR Structures as Integrable G-Structures 10 How many geometric structures on manifolds are there? 6 Vector fields, diffeomorphism subgroups and lie group actions 1 The bundle of symmetric affine connections as quotient of the second-order frame bundle 2 Is the manifold of complex points of a quotient of compact groups just the tangent bundle? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 165867, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "dg.differential-geometry,manifolds,dg.differential-geometry,manifolds",
  "scraped_at": "2026-01-14T04:12:24.075665",
  "answer": ""
}