{
  "id": "q_163106",
  "mathoverflow_id": 163106,
  "url": "https://mathoverflow.net/questions/163106/are-injective-modules-flabby-on-basic-open-sets",
  "title": "teaching - Are injective modules flabby on basic open sets?",
  "body": "In order to give a simple proof of a basic fact about quasi-coherent modules (see below), I'm interested in knowing whether the following statement holds: Statement: If $A$ is a commutative ring and $I$ is an injective $A$ -module, then: $$ I \\longrightarrow I_f \\longrightarrow 0 \\ $$ is surjective, for any function $f \\in A$ . For example: If $A$ is a domain, then $I$ is divisble, and the statement follows. If $A$ is noetherian, then the statement also holds, because any injective module $I$ is the direct sum of injective envelopes $E(A/\\mathfrak{p}_j)$ , that are flabby sheaves. My question is both whether the statement is true for arbitrary, commutative rings (I guess it is not), and whether there exists a class of rings (as in the case of domains), where the statement holds without much effort. Motivation: If the statement above is true, then it is easy to prove that any injective module $I$ gives rise to an acyclic quasi-coherent sheaf $\\widetilde{I}$ over $ {\\rm Spec}A $ , where $\\widetilde{I} (U) := I_U$ . Then, this would allow to easily prove the following basic theorem: Theorem: Quasi-coherent modules $\\widetilde{M}$ are acylcic sheaves over ${\\rm Spec} A$ . Proof: Let $M$ be an $A$ -module and take an injective resolution $$ 0 \\to M \\to I^\\bullet \\ . $$ Taking the associated sheaves, we have a resolution of the quasi-coherent sheaf $\\widetilde{M}$ , that is aciclyc because of the argument above, and hence it computes the cohomology of $\\widetilde{M}$ : $$ 0 \\to \\widetilde{M} \\to \\widetilde{I^\\bullet} \\ . $$ But taking global sections we obtain the original sequence (because $\\Gamma ( {\\rm Spec} A , \\widetilde{M}) = M $ , for any module) that is exact, so $\\widetilde{M}$ is acyclic. $\\square$ teaching injective-modules quasi-coherent-modules Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Apr 11, 2014 at 11:17 José Navarro 1,124 10 10 silver badges 20 20 bronze badges $\\endgroup$ 1 1 $\\begingroup$ Dear Jose, you might want to look at my answer to mathoverflow.net/questions/132398 . $\\endgroup$ Fred Rohrer –  Fred Rohrer 2014-04-11 13:12:01 +00:00 Commented Apr 11, 2014 at 13:12 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions teaching injective-modules quasi-coherent-modules See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 5 Surjectivity of the natural map of injective module to its localization Related 7 How to characterize flasque sheaves in more functorial way? 5 Determining a scheme $X$ is affine from $Qcoh(X)$ 4 locally noetherian categories and the category of quasi-coherent sheaves over a noetherian scheme 9 When are free modules on sheaves of sets quasicoherent? 2 Does $R\\hat{f}_*\\mathcal{F}=\\hat{f}_*\\mathcal{F}$ hold for affine adic morphisms? 3 Find a non-quasi-compact scheme s.t. all finitely generated + globally generated quasi-coherent modules are finitely globally generated $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 163106, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "teaching,injective-modules,quasi-coherent-modules,teaching,injective-modules,quasi-coherent-modules",
  "scraped_at": "2026-01-14T04:11:55.011065",
  "answer": ""
}