{
  "id": "q_177630",
  "mathoverflow_id": 177630,
  "url": "https://mathoverflow.net/questions/177630/adjunction-algebra-is-there-anything-similar-to-this-in-algebra",
  "title": "Adjunction algebra - is there anything similar to this in algebra?",
  "body": "I call adjunction algebra a universal algebra with one binary operation denoted as the punctuation sign ( ; ) \"semicolon\" (but I will be using only one space after it, not on both sides - to avoid going against the regular punctuation practice and creating typographical problems), and 3 axioms which are universal closures of these formulas (between brackets I indicate how I refer to them): $((x; y); y) = (x; y)$ [right idempotency] $((x; y); z) = ((x; z); y)$ [right commutativity] $((x; y); z) = (x; y) \\rightarrow ((x; z) = x \\vee z = y)$ [right atomicity] I call normal or normalized adjunction algebra, an algebra which additionally to adjunction has a constant $0$ such that: $(0; x) \\ne x$ I think, this algebra is important for algebraization of set theory. Also, for several years now, I am using it, in another presentation, in my research of semantics of natural languages. I used to call the operation (;) \"qualification\", because it explains the semantics of qualified names in computer science. Lately, I learnt that this operation is called \"adjunction\" from @Joel's answer to my question . The axioms above are from the paper by Kirby referenced there. True, Kirby does not call this \"adjunction algebra\", because along these axioms Kirby also uses an induction axiom and he studies a \"theory\", not an \"algebra\". The intended interpretation in set theory of the $(x; y)$ is $x \\cup ${$y$}, and in this interpretation $(x; y) = x$ iff $y \\ \\epsilon \\ x$. This shows why adjunction is important for set theory - set theory can be presented in the language of one operation. In Kirby's paper the operation of union is defined by induction (which is an axiom) and it sounds to me improbable that it can be defined through \";\" an \"0\" without such an axiom. Here are some of my questions: (1) Does the axioms above occur in abstract algebra and what are the names of the properties they express? (2) Is what I call normal adjunction algebra \"free\" in some sense (my algebraic background is not very strong, so my question might not be precise). (3) Are there algebras where the induction principle, in any of its different forms, is represented algebraically (i.e. as identities or quasiidentities)? universal-algebra Share Cite Improve this question Follow edited Jan 27, 2020 at 5:16 YCor 67.5k 5 5 gold badges 203 203 silver badges 301 301 bronze badges asked Aug 1, 2014 at 21:33 Ioachim Drugus 889 5 5 silver badges 11 11 bronze badges $\\endgroup$ 9 5 $\\begingroup$ In right atomicity shouldn't one of the consequents be (x; z) =x ? $\\endgroup$ The Masked Avenger –  The Masked Avenger 2014-08-01 21:54:17 +00:00 Commented Aug 1, 2014 at 21:54 $\\begingroup$ An example of a non-free normal adjunction algebra: consider the set with 2 elements $\\{0, 1\\}$, with the operation $;$ defined as $0; 1=0$, $0; 0=1$, $1; 1=1$, $a; b=b; a$. This seems to me to yield a normal adjunction algebra, and it is certainly not free. $\\endgroup$ Noah Schweber –  Noah Schweber 2014-08-01 23:08:00 +00:00 Commented Aug 1, 2014 at 23:08 1 $\\begingroup$ I've deleted a nonsensical comment. Since your axioms for adjunction algebras include a non-equation, there doesn't seem to be a nice way to build a free algebra: \"free on $n$ generators\" should mean \"epis onto anything $n$-generated,\" but it's not obvious how to build one (or even if there are any), and of course this is even more true for normal adjunction algebras. On the other hand, a finite adjunction algebra certainly won't be free, so I've left my second comment intact. $\\endgroup$ Noah Schweber –  Noah Schweber 2014-08-01 23:20:07 +00:00 Commented Aug 1, 2014 at 23:20 2 $\\begingroup$ How does that change anything? The problem is not in the definition of normality. The problem is that the \"right atomicity\" axiom is not an equation. $\\endgroup$ Emil Jeřábek –  Emil Jeřábek 2014-08-02 09:43:40 +00:00 Commented Aug 2, 2014 at 9:43 1 $\\begingroup$ It seems to me like a far more natural notion would be to fix a set $A$ and consider algebras which are sets $P$ together with operations $P\\times A\\to P$ satisfying (some of) your axioms. If you use only the first two axioms, the free algebra on one generator is the set of finite subsets of $A$. $\\endgroup$ Eric Wofsey –  Eric Wofsey 2014-08-02 14:33:40 +00:00 Commented Aug 2, 2014 at 14:33  |  Show 4 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions universal-algebra See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 8 Is there one binary operation foundational for set theory? 2 Are there fragments of set theory which are axiomatized with only bounded (restricted) quantifiers used in axioms? 4 Is there any research of universal algebras axiomatized by non-Horn clauses? 1 Is there any current development of a first order formalization of metamathematics? Related 7 What do algebraic theories with strictly terminal trivial models look like? 4 What kind of algebra is the class of ordered pairs equipped with the binary operation which forms them? 5 The word problem of the free left distributive algebra on one generator 19 Constructive proof of existence of free algebras for infinitary equational theories 7 Free median algebras and maximal linked systems $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 177630, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "universal-algebra,universal-algebra",
  "scraped_at": "2026-01-14T04:12:30.792044",
  "answer": ""
}