{
  "id": "q_173146",
  "mathoverflow_id": 173146,
  "url": "https://mathoverflow.net/questions/173146/homeomorphism-of-compact-hausdorff-spaces",
  "title": "gn.general topology - Homeomorphism of compact Hausdorff spaces",
  "body": "(Note: I asked this question at MSE over a day ago and received no answer, so I'm now reposting it here. Link: https://math.stackexchange.com/questions/853500/homeomorphism-of-compact-hausdorff-spaces ) In the preprint \"A REMARK ON CANTOR DERIVATIVE\" ( http://arxiv.org/pdf/1104.0287v1.pdf ), there is the next proof: We show that two countable locally compact Hausdorff spaces $X$ and $Y$ of same Cantor-Bendixson rank and degree are homeomorphic. Suppose first that $X$ and $Y$ be compact of rank $\\alpha + 1$ . Note that they are the disjoint union of finitely many compact spaces of degree 1, so one may assume that their degree is 1. We build a homeomorphism from $X$ to $Y$ by induction on the rank. Let $X_1$ , $X_2$ ,... and $Y_1$ , $Y_2$ ,... be two sequences of clopen sets roughly partitioning $X\\smallsetminus X^\\alpha$ and $Y\\smallsetminus Y^\\alpha$ respectively. As $X_1$ has smaller rank or degree than some finite union of $Y_i$ , we may assume that X1 has smaller rank or degree than $Y_1$ , and that $Y_1$ has smaller rank or degree that $X_2$ etc. We then build a back and forth: by induction hypothesis, there is sequence $f_1$ , $g_1^{−1}$ , $f_2$ , $g^{−1}_2$ ,... of homeomorphism respectively from $X_1$ to some clopen $\\widetilde Y_1 \\subseteq Y_1$ , from $Y_1 \\smallsetminus \\widetilde Y_1$ to some clopen set $\\widetilde X_2\\smallsetminus X_2$ , from $X_2 \\smallsetminus \\widetilde X_2$ to $\\widetilde Y_3 \\smallsetminus Y_3$ etc. We call $f$ be the union of all $f_i$ and $g_i$ , union one more map $f_\\omega$ from $X$ to $Y$ and show that $f$ is continuous.\" I can't understand how choose the partition $X_1$ , $X_2$ ,... and $Y_1$ , $Y_2$ ,... and how choose the sequence $f_1$ , $g_1^{−1}$ , $f_2$ , $g^{−1}_2$ ,... can anybody help me please? gn.general-topology Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jul 2, 2014 at 21:39 MateAndres 191 1 1 bronze badge $\\endgroup$ 2 1 $\\begingroup$ Please give the MSE link anyway, so that people who nevertheless think it belongs there and not here can post an answer there. $\\endgroup$ Todd Trimble –  Todd Trimble 2014-07-02 23:30:07 +00:00 Commented Jul 2, 2014 at 23:30 1 $\\begingroup$ In general waiting just one day isn't enough before cross posting. Either post on MO from the start, and see if it gets migrated; or wait for a few days and then flag your question for moderator attention and request they manually migrate the question here. In either case, both cross posting is bad and the waiting period after asking a question on one site should be longer than a day. Closer to a week perhaps. $\\endgroup$ Asaf Karagila –  Asaf Karagila ♦ 2014-07-03 02:13:29 +00:00 Commented Jul 3, 2014 at 2:13 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions gn.general-topology See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 7 When does a homeomorphism split into essentially minimal homeomorphisms? 22 Topological characterization of the closed interval $[0,1]$ 2 Extend Homeomorphism to Uniformly Continuous Function 13 Avoiding countable subgroups of a group homeomorphic to the Cantor space 5 Partitions of the reals such that closures of partition elements are saturated 8 Covering compact Hausdorff spaces with closed $G_\\delta$ sets 11 On the classification of second-countable Stone spaces 15 Is there an infinite subset of $\\Bbb{R}$ not homeomorphic to any of its proper subsets? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 173146, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "gn.general-topology,gn.general-topology",
  "scraped_at": "2026-01-14T04:12:28.560905",
  "answer": ""
}