{
  "id": "q_173112",
  "mathoverflow_id": 173112,
  "url": "https://mathoverflow.net/questions/173112/make-this-marginalization-statement-rigorous",
  "title": "pr.probability - Make this marginalization statement rigorous",
  "body": "Intuition tells me that $$ p(x\\,|\\,y) = \\int p(x,\\theta\\,|\\,y) \\; d\\theta$$ by the \"law of marginalization\", pretty much for any object $\\theta$ . I would like to make this statement rigorous, however. For example, let us assume that the random variable $X$ is well defined and absolutely continuous. What minimal conditions are required of $\\theta$ in order to make the statement above? I'm thinking probability space of $\\theta$ joint measurability of $\\theta$ and $x$ absolute continuity of $\\theta$ Also, does the conditioning on y cause any complications? $\\phantom{placeholder}$ Update 1 Briefly, the motivation for this question is that I want to make the above marginalization statement before defining $\\theta$ . So I want to say \"Don't worry that we have not defined $\\theta$ yet, because this is just the rule of marginalization, and it holds for any random variable $\\theta$ defined on $(\\Omega, S, P)$ \" Would it then be sufficient to require that $(\\Omega, S, P)$ is also the probability space of $X$ , and that the pdf of $Y$ is also absolutely continuous? pr.probability measure-theory Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jul 2, 2014 at 13:06 Patrick 111 4 4 bronze badges $\\endgroup$ 4 $\\begingroup$ isn't this the definition of a marginal distribution? $\\endgroup$ Carlo Beenakker –  Carlo Beenakker 2014-07-02 13:26:16 +00:00 Commented Jul 2, 2014 at 13:26 $\\begingroup$ @CarloBeenakker Almost. Marginalization tells you how to obtain p(x) from p(x,y) for some well-defined multivariate random variable (x,y). But I'm rather asking what is required of y in order for (x,y) to be well defined? E.g. should I define the probability space of y, and define the probability space of (x,y) as the product space of that of x and that of y? Or must y be defined on the same probability space as x? Obviously, I'm not well versed in the foundations of probability theory. I'm also asking about regularity conditions, although that is of less interest. $\\endgroup$ Patrick –  Patrick 2014-07-02 13:56:08 +00:00 Commented Jul 2, 2014 at 13:56 $\\begingroup$ Is $p$ meant to be a density? $\\endgroup$ Michael Greinecker –  Michael Greinecker 2014-07-03 11:13:47 +00:00 Commented Jul 3, 2014 at 11:13 $\\begingroup$ Yes, using \"function overloading\" notation. $\\endgroup$ Patrick –  Patrick 2014-07-03 14:42:24 +00:00 Commented Jul 3, 2014 at 14:42 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions pr.probability measure-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 3 Recovering joint distribution from marginals 2 Intution behind conditional expectation when sigma algebra isn't generated by a partition 8 Conditional law as a random measure and convergence of random measures 4 Statistical models in terms of families of random variables 4 Is it possible to construct any random variable on the Euclidean Probability space? 4 Absolute continuity of measures - reference sought 4 Non-measurability of time integral of non-jointly measurable process $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 173112, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "pr.probability,measure-theory,pr.probability,measure-theory",
  "scraped_at": "2026-01-14T04:12:26.329469",
  "answer": ""
}