{
  "id": "q_180097",
  "mathoverflow_id": 180097,
  "url": "https://mathoverflow.net/questions/180097/where-the-following-interpolation-method-converges",
  "title": "fourier analysis - Where the following interpolation method converges?",
  "body": "In this question about discrete-analytic functions (that is functions, who equal to their Newton series) I asked for a solution for the following problem: Is there a method to extend the notion of discrete analiticity to a range of functions for which Newton series does not converge I received no answer, but now I have a promising formula at hand. $$f(x)=\\frac{1}{2\\pi}\\int_{-\\infty}^{+\\infty} (- i \\omega)^x \\int_{-\\infty}^{+\\infty}e^{i\\omega t}\\sum_{m=0}^\\infty \\frac{f(m)t^m}{m!}dt \\, d\\omega$$ Code in Mathematica: Nf[x_] := InverseFourierTransform[FourierTransform[GeneratingFunction[f[n]/n!, n, t], t, w] (- I w)^x, w, 0] It seems this transform should converge for some cases where the Newton's series does not, for instance, for the function $\\sin \\frac{\\pi x}2$ for which the Newton's series does not converge . I wonder whether the proposed formula a viable generalization for Newton's series and on what set of functions does it converge? Does it substantially extend the area of convergence of Newton's expansion? Does it always produce the same result as the Newton's series? $$f(x) = \\sum_{k=0}^\\infty \\binom{x}k \\Delta^k [f]\\left (0\\right)$$ fourier-analysis sequences-and-series limits-and-convergence interpolation Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Sep 4, 2014 at 18:32 Anixx 10.4k 4 4 gold badges 42 42 silver badges 70 70 bronze badges $\\endgroup$ 2 $\\begingroup$ Anixx, you can’t notify random people. See meta.mathoverflow.net/a/1758/12705 . $\\endgroup$ Emil Jeřábek –  Emil Jeřábek 2014-09-04 19:39:09 +00:00 Commented Sep 4, 2014 at 19:39 $\\begingroup$ @Emil Jeřábek ok, commented in the linked question. $\\endgroup$ Anixx –  Anixx 2014-09-04 19:42:57 +00:00 Commented Sep 4, 2014 at 19:42 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions fourier-analysis sequences-and-series limits-and-convergence interpolation See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 5 Convergence of Newton series for sin ax 2 Discrete-analytic functions Related 5 Convergence of Newton series for sin ax 3 Prove that these two definitions of \"natural\" integration constant coincide when both converge 10 Newton series and Fourier transform - is there an analogy? 1 About the coefficients of Taylor series for the complex Riemann Zeta function $\\zeta(s)$ 3 Is there a summation method where the divergent series $S = U_0+U_1+U_2+\\dots$ converges to a finite value? 8 Discrete Fourier transform converges to torus and real Fourier transforms in what sense? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 180097, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "fourier-analysis,sequences-and-series,limits-and-convergence,interpolation,fourier-analysis,sequences-and-series,limits-and-convergence,interpolation",
  "scraped_at": "2026-01-14T04:11:57.238442",
  "answer": ""
}