{
  "id": "q_188722",
  "mathoverflow_id": 188722,
  "url": "https://mathoverflow.net/questions/188722/conjugacy-classes-of-a-triple",
  "title": "reference request - Conjugacy classes of a triple",
  "body": "In the paper \" THE COMPONENT GROUPS OF NILPOTENTS IN EXCEPTIONAL SIMPLE REAL LIE ALGEBRAS\" by D. King I am unable to proof the lemma 3.7 which is omitted there. The lemma is following: Let $\\mathfrak g $ be a exceptional and $R$ be a regular subgroup ( normalized by a maximal torus) of $G$ . Let ( $x_1,e_1,f_1$ ) and ( $x_2,e_2,f_2$ ) be semi-regular triples in Lie( $R$ ).(Semi-regular means centralizer of $(x_1,e_1,f_1)$ in $R$ is equal to the center of $R$ ) Now if ( $x_1,e_1,f_1$ ) and ( $x_2,e_2,f_2$ ) are conjugate in $G$ then they are conjugate in $R$ . It is also not clear to me that why he assume $\\mathfrak g$ to be exceptional Lie algebra. Is it not true for classical Lie algebra. Any reference for the proof of this lemma is also useful. reference-request lie-groups nilpotent-orbits Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Dec 3, 2014 at 12:05 mathuser 126 6 6 bronze badges $\\endgroup$ 1 1 $\\begingroup$ I'm not too familiar with this area of literature in which classical results for complex Lie algebras are adapted to real cases, but Don King was a student of Kostant (whose methods are being adapted here). Probably it's most efficient to contact D. King directly at Northeastern: [email protected] In any case, I'd expect the lemma itself to be true for all semisimple Lie algebras, though the paper focuses just on exceptional types. $\\endgroup$ Jim Humphreys –  Jim Humphreys 2014-12-03 15:43:42 +00:00 Commented Dec 3, 2014 at 15:43 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request lie-groups nilpotent-orbits See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 20 Polynomial invariants of the exceptional Weyl groups 6 Vector fields, diffeomorphism subgroups and lie group actions 5 Vanishing of power of nilpotent operator $\\mathrm{ad} \\, \\;e$ in different characteritics 10 Trivialization of the vector bundle of centralizers of regular elements 1 Connectedness of stabilizer of regular element 5 Step in the Bruhat decomposition for reductive Lie groups 7 Does every Lie algebra appear as centralizer of an element in a semisimple Lie algebra? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 188722, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,lie-groups,nilpotent-orbits,reference-request,lie-groups,nilpotent-orbits",
  "scraped_at": "2026-01-14T04:11:59.466205",
  "answer": ""
}