{
  "id": "q_185735",
  "mathoverflow_id": 185735,
  "url": "https://mathoverflow.net/questions/185735/why-is-cellularization-the-fiber-of-nullification-for-slice-cells",
  "title": "at.algebraic topology - Why is cellularization the fiber of nullification for slice cells?",
  "body": "I'm a bit confused about the nullification functors that come up when constructing the slice tower in HHR . Let $\\mathcal{A}$ be a set of compact objects in the $G$ -equivariant stable homotopy category and let $\\mathcal{A}_+$ denote the smallest subcategory that contains $\\mathcal{A}$ and is closed under sums and taking cofibers. Then for a spectrum $X$ one can construct the $\\mathcal{A}$ -nullification $X\\rightarrow P^{\\mathcal{A}}X$ . This has the universal property that it is $\\mathcal{A}$ -null, i.e. all maps from suspensions of objects in $\\mathcal{A}$ into it are zero, and for all other $\\mathcal{A}$ -null spectra $Z$ and $k\\geq 0$ the induced map $[\\Sigma^k P^{\\mathcal{A}}X,Z]\\rightarrow[\\Sigma^k X, Z]$ is bijective. On the other hand one has the $\\mathcal{A}$ -cellularization $Cell_{\\mathcal{A}}X\\rightarrow X$ , which is characterized as an $\\mathcal{A}$ -equivalence (i.e. it induces bijections on $[\\Sigma^k A, \\_]$ for all $A \\in \\mathcal{A}$ and $k \\geq 0$ ) s.t. $Cell_{\\mathcal{A}}X \\in \\mathcal{A}_+$ . If we take for $\\mathcal{A}$ the slice cells with dimension $\\geq n$ then it is claimed in HHR that $Cell_{\\mathcal{A}}X$ is the fiber of the $\\mathcal{A}$ -nullification. However it seems that this is not formal and uses something about slice cells. Equivalently one can ask if the cofiber of the cellularization is the nullification. The second condition for nullifications is then automatically satisfied but the cofiber will only be $\\mathcal{A}$ -null if the map $[A, \\Sigma Cell_{\\mathcal{A}}X]\\rightarrow [A, \\Sigma X]$ is injective for all $A\\in \\mathcal{A}$ . In the non-equivariant case this is true because for $\\mathcal{A}={S^n}$ the cellularization $Cell_{\\mathcal{A}}X$ is $(n-1)$ -connected, so the map is injective for the trivial reason that the source vanishes. In the equivariant case i see no reason why this argument should work because there will be non-trivial maps from slice cells in $\\mathcal{A}$ to suspensions of slice cells in $\\mathcal{A}$ . Maybe someone can give me a hint as to why the map is injective or tell me if i'm overlooking a formal reason why the original statement is true. at.algebraic-topology Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Oct 29, 2014 at 20:31 Christian Wimmer 413 2 2 silver badges 7 7 bronze badges $\\endgroup$ 2 $\\begingroup$ In the non-equivariant unstable situation, there is a general result when cellularization and nullification are related by a fiber sequence: Theorem 3.B.2 in E.Dror Farjoun: cellular spaces, null spaces and homotopy localization. Maybe that helps... $\\endgroup$ Matthias Wendt –  Matthias Wendt 2014-10-29 20:52:31 +00:00 Commented Oct 29, 2014 at 20:52 $\\begingroup$ Yeah I don't know HHR very well, but generally to any nice enough subcategory there are associated two functors: localization and colocalization, and they are related. Y a fiber sequence. I suspect that is what's happening here. $\\endgroup$ Jonathan Beardsley –  Jonathan Beardsley 2018-02-21 19:39:36 +00:00 Commented Feb 21, 2018 at 19:39 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions at.algebraic-topology See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 9 homological algebra with spectra 16 Homotopy Fixed Points of SO(2) on Fully Dualizable Algebras 4 Attaching cells of different dimensions at once in a CW-complex II 8 (Non)-equivariant equivalence in $G$-spectra 4 Bredon cohomology of $\\mathbb{S}^\\sigma$ 5 Suspensions are H-cogroup objects 12 Can the Bousfield class of projective space be computed directly? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 185735, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "at.algebraic-topology,at.algebraic-topology",
  "scraped_at": "2026-01-14T04:12:37.772209",
  "answer": ""
}