{
  "id": "q_186869",
  "mathoverflow_id": 186869,
  "url": "https://mathoverflow.net/questions/186869/the-homotopy-type-of-the-lifting-of-homeomorphism-of-grassmanian",
  "title": "at.algebraic topology - (The Homotopy type of the) lifting of homeomorphism of Grassmanian",
  "body": "For $k<n$ put $FM_{k\\times n}$ for the space of all $k\\times n$ full rank matrices with real or complex entries. Note that the permutation group $S_{n}$ has an obvious action on this space (with permuting the columns). On this space, consider the equivalence relation $A\\sim B$ iff they have the same row spaces . Then the Grassmanian $G(k,n)$ is identified with the quotient $FM_{k\\times n}/\\sim$ . Does every homeomorphism of Grassmanian has a lift to a homeomorphism of $FM_{k\\times n}$ . And is it true that this lifted homeomorphism is homotopic or isotopic to a homeomorphism on $FM_{k\\times n}$ arising from a permutation of columns? at.algebraic-topology gn.general-topology grassmannians Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Nov 11, 2014 at 22:31 Ali Taghavi 1 $\\endgroup$ 2 2 $\\begingroup$ For the second question, the answer is no. Consider self-homeomorphism of $G(1,2) \\cong S^2$ sending $[z:w]$ to $[\\overline z:\\overline w]$. This is an orientation-reversing homeomorphism (degree $-1$), and so it does not come from swapping the columns (a complex-analytic homeomorphism, degree $1$). $\\endgroup$ Tyler Lawson –  Tyler Lawson 2014-11-12 03:12:18 +00:00 Commented Nov 12, 2014 at 3:12 $\\begingroup$ @TylerLawson Thanks for your answer to the second question. It arise a new question: is there a permutation which is not homotopic to the identity (as a map on grassmanian)? $\\endgroup$ Ali Taghavi –  Ali Taghavi 2014-11-12 18:55:54 +00:00 Commented Nov 12, 2014 at 18:55 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions at.algebraic-topology gn.general-topology grassmannians See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 2 A self-homeomorphism of $L_{p,q}$ is isotopic to one which preserves heegaard splitting 10 Is this a metric on the Grassmannian Manifold? 2 Homotopy versus path-homotopy on punctured surface 15 Is there a category whose isomorphisms are precisely the simple homotopy equivalences? 3 Distance for $GL_n(\\mathbb{R})/GL_n(\\mathbb{Z})$ 2 Is it true, the space of embeddings segments is homotopy equivalent to the subspace of all line segments? 5 Compactness of symmetric power of a compact space 4 Homotopy lifting for symmetric products $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 186869, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "at.algebraic-topology,gn.general-topology,grassmannians,at.algebraic-topology,gn.general-topology,grassmannians",
  "scraped_at": "2026-01-14T04:12:40.020776",
  "answer": ""
}