{
  "id": "q_194767",
  "mathoverflow_id": 194767,
  "url": "https://mathoverflow.net/questions/194767/what-is-the-technical-difference-between-a-deformation-and-a-perturbation",
  "title": "rt.representation theory - What is the technical difference between a deformation and a perturbation?",
  "body": "What is the technical difference between a deformation and a perturbation? Do they exist in somewhat different categories? rt.representation-theory ct.category-theory ra.rings-and-algebras deformation-theory perturbation Share Cite Improve this question Follow edited May 11, 2019 at 20:07 YCor 67.5k 5 5 gold badges 203 203 silver badges 301 301 bronze badges asked Jan 24, 2015 at 16:39 Jim Stasheff 3,930 17 17 silver badges 24 24 bronze badges $\\endgroup$ 6 4 $\\begingroup$ I feel diffident saying this, since you've done plenty of work in which the word \"deformation\" is embedded (perhaps esp. in algebra where the name Gerstenhaber is also prominent), but these words appear in varying contexts. Is there a particular context in which you see both words being used, where a technical distinction would become important? $\\endgroup$ Todd Trimble –  Todd Trimble 2015-01-24 17:03:38 +00:00 Commented Jan 24, 2015 at 17:03 $\\begingroup$ I meant it more in the sense of: what comes to mind e.g. context when one or the other of these appear $\\endgroup$ Jim Stasheff –  Jim Stasheff 2015-01-25 22:08:46 +00:00 Commented Jan 25, 2015 at 22:08 $\\begingroup$ @JimStasheff I am very much interested to know about this ; did you ind out more in the last 3 years? Would you please share if there is any? $\\endgroup$ Creator –  Creator 2018-02-27 02:49:16 +00:00 Commented Feb 27, 2018 at 2:49 $\\begingroup$ 'perturbation' can be thought in the context of stability/instability of wave propagation and hence mathematical. Eg: In the field of Fluid mechanics, one could use the sentence \"The perturbations of a liquid surface travel with visco-capillary speeds.\" Whereas, 'deformation' is more general. $\\endgroup$ Srinath Lakshman –  Srinath Lakshman 2019-05-11 14:33:57 +00:00 Commented May 11, 2019 at 14:33 $\\begingroup$ I added \"primary\" tags but this can maybe be improved. $\\endgroup$ YCor –  YCor 2019-05-11 20:08:44 +00:00 Commented May 11, 2019 at 20:08  |  Show 1 more comment 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions rt.representation-theory ct.category-theory ra.rings-and-algebras deformation-theory perturbation See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 43 What is a deformation of a category? 13 The difference between the Recursive and the Effective topos. 8 Relationship between Hilbert schemes and deformation spaces 5 Links between tight closure and deformation theory 9 The difference between $q$-deformations and $h$-deformations 4 DG Lie algebras and derived deformation theory $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 194767, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "rt.representation-theory,ct.category-theory,ra.rings-and-algebras,deformation-theory,perturbation,rt.representation-theory,ct.category-theory,ra.rings-and-algebras,deformation-theory,perturbation",
  "scraped_at": "2026-01-14T04:12:49.261350",
  "answer": ""
}