{
  "id": "q_195414",
  "mathoverflow_id": 195414,
  "url": "https://mathoverflow.net/questions/195414/intuition-for-hereditary-torsion-theories",
  "title": "reference request - Intuition for hereditary torsion theories",
  "body": "I'm looking for intuition and references for the definition of a hereditary torsion theory and two facts found here . First, the definition and facts: Definition. A torsion theory $(\\mathcal T,\\mathcal F$ ) is hereditary if $\\mathcal T$ is closed under subobjects (aswell as quotient objects). Theorem: In an abelian category $\\mathsf A$ satisfying property sup : The assignment $A\\mapsto t(A)$ which takes an object into its largest torsion subobject can, using the axiom of choice, be extended to a functor $t:\\mathsf A \\rightarrow \\mathcal T$ A torsion theory is hereditary iff $t$ is left exact First of all I have no intuition at all for the notion of hereditary. Is the first part of the theorem mostly technical? What's a reference? What's the intuitive meaning of the left exactness of $t$ ? When does it have a right adjoint and what would it be? What about an analogous \"torsion-free part\" functor? For future reference - does a question like this belong on MSE? reference-request ct.category-theory intuition abelian-categories torsion-theory Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Feb 1, 2015 at 15:02 Exterior 945 7 7 silver badges 19 19 bronze badges $\\endgroup$ 2 $\\begingroup$ The inclusion $i \\colon \\mathcal T \\hookrightarrow \\mathsf A$ is a left adjoint of $t$. Did you mean to ask about a right adjoint? $\\endgroup$ Dag Oskar Madsen –  Dag Oskar Madsen 2015-02-01 20:40:38 +00:00 Commented Feb 1, 2015 at 20:40 $\\begingroup$ @DagOskarMadsen yes, sorry. Corrected. $\\endgroup$ Exterior –  Exterior 2015-02-01 22:29:34 +00:00 Commented Feb 1, 2015 at 22:29 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request ct.category-theory intuition abelian-categories torsion-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 42 Cocomplete but not complete abelian category 4 Cohomology Ring of a small category $\\mathsf{C}$ 6 Why are simplicial objects monadic over split (contractible) simplicial objects? 26 Another notion of exactness: how to refine it, and where does it fit? 4 Tannaka-Krein reconstruction and rigidity 6 Adjusting the definition of a well-powered category to category theory with universes: size issues 8 Intuition for the \"internal logic\" of a cotopos $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 195414, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,ct.category-theory,intuition,abelian-categories,torsion-theory,reference-request,ct.category-theory,intuition,abelian-categories,torsion-theory",
  "scraped_at": "2026-01-14T04:12:53.730227",
  "answer": ""
}