{
  "id": "q_193574",
  "mathoverflow_id": 193574,
  "url": "https://mathoverflow.net/questions/193574/embedding-a-collection-of-finite-subsets-efficiently",
  "title": "co.combinatorics - Embedding a collection of finite subsets efficiently",
  "body": "Are there any general non-trivial methods for solving the following problem? Suppose one has a collection of subsets $\\mathcal{C} \\subseteq \\mathcal{P}\\mathcal{P}\\{1,\\dots,n\\}$ . They may be viewed as generating a sub boolean algebra $\\langle\\mathcal{C}\\rangle \\subseteq \\mathsf{2}^{2^n}$ of the free boolean algebra on $n$ generators. Let $G \\subseteq \\langle\\mathcal{C}\\rangle$ be a subset whose closure under unions contains $\\mathcal{C}$ . I would like to compute the minimum cardinality over all such sets $G$ . For example: If $\\mathcal{C}$ consists of the $2^n$ atoms then the answer is $2^n$ . If $\\mathcal{C}$ consists of the $2^n$ co-atoms then the answer is $\\leq 2n$ by choosing $p_1,\\neg p_1,\\dots,p_n,\\neg p_n$ . co.combinatorics boolean-algebras Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jan 9, 2015 at 22:14 Rob Myers 1,299 7 7 silver badges 16 16 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions co.combinatorics boolean-algebras See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 5 How complete is $\\mathcal P(\\kappa)/J_{bd}$? 12 Fomin-Kirillov algebras and Schubert calculus 13 Maximum number of vectors in a hypercube satisfying given conditions 3 Finitely additive measures on Boolean algebras of regular open subsets: Is there a relationship with Borel measures? A theory of integration? 14 What are internal complete atomic boolean algebras, intuitively? 7 Are no infinite subsets of the set of all propositional atoms definable in this structure, even with parameters? 5 Kuratowski's 14 theorem and universal algebra $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 193574, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "co.combinatorics,boolean-algebras,co.combinatorics,boolean-algebras",
  "scraped_at": "2026-01-14T04:12:47.004083",
  "answer": ""
}