{
  "id": "q_195255",
  "mathoverflow_id": 195255,
  "url": "https://mathoverflow.net/questions/195255/a-lie-algebra-associated-with-a-one-dimensional-foliation",
  "title": "dg.differential geometry - A Lie algebra associated with a one dimensional foliation",
  "body": "A non vanishing vector field $X$ on a manifold is called \"well behaved\" if for every non vanishing smooth function $f$ we have $$C(X)\\simeq C(fX)$$ This means that the centralizer Lie algebras $C(X)$ and $C(fX)$ are isomorphic Lie algebra. Example: The vector field $\\partial_{x}$ is a well behaved vector field on $\\mathbb{R}^{2}$. Nonexample: The vector field $y\\partial_{x}-x\\partial_{y}$ is not a well behaved vector field on $\\mathbb{R}^{2}-\\{0\\}$. We conclude from the above definition that this concept is a \"foliation\" concept. That is to every one dimensional foliation tangent to a well behaved vector field $X$, we associate a Lie algebra $C(X)$. Two questions: 1.Is there a well behaved vector field on $\\mathbb{R}^{2}$ which foliation is not topological equivalent to the foliation of the above example $\\partial_{x}$? If the answer is no, is it true to say that every non vanishing vec. field on the plane is well behaved?(Please see the Note at the end of this post). 2.What is an example of a well behaved vector field on a compact manifold?In particular is a Kronecker foliation on tori, a well behaved foliation? Note: More than 10 years ago, if I remember well, I heard from a specialist of foliation that \"every foliation of the whole plane is actually well behaved\" and he described this lie algebra via extension of some Lie algebra by another one. I really do not remember the details. dg.differential-geometry ap.analysis-of-pdes ds.dynamical-systems lie-algebras foliations Share Cite Improve this question Follow edited May 27, 2019 at 6:36 asked Jan 30, 2015 at 9:32 Ali Taghavi 1 $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions dg.differential-geometry ap.analysis-of-pdes ds.dynamical-systems lie-algebras foliations See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 A special non vanishing vector field on $S^{3}$ 6 A vector space associated with a vector field on a symplectic manifold 1 A Lie algebra associated to a foliation(A kind of saturation of foliations) 5 The diversity of Riemannian metrics adapted to a given (1 dimensional) foliation, A Krein Millman view point 2 A 1 dimensional foliation of $\\mathbb{R}^4$ with few compact leaves 0 A foliation version of the Seifert conjecture $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 195255, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "dg.differential-geometry,ap.analysis-of-pdes,ds.dynamical-systems,lie-algebras,foliations,dg.differential-geometry,ap.analysis-of-pdes,ds.dynamical-systems,lie-algebras,foliations",
  "scraped_at": "2026-01-14T04:12:51.475332",
  "answer": ""
}