{
  "id": "q_201302",
  "mathoverflow_id": 201302,
  "url": "https://mathoverflow.net/questions/201302/notions-of-consistency-heterogeneity-in-sets-of-vector-values",
  "title": "co.combinatorics - Notions of consistency / heterogeneity in sets of vector values?",
  "body": "The problem Let us consider a row vector u of size $n\\in\\mathbb{N}$ , containing only binary values (0,1): $$u=(u_1 \\cdots u_n), n\\in\\mathbb{N}$$ $$\\forall i \\in \\{1\\ldots n\\}, u_i \\in\\{0,1\\}$$ I would like to define notions of consistency and heterogeneity (for lack of better terminologies...), in order to quantify how the vector values are distributed. Concretely, I would like to mathematically quantify the difference between this (ideal) vector $$u=(0,0,0,0,1,1,1)$$ where I can find a rank k such as: $$\\forall i \\in \\{2\\ldots k\\} \\ \\ u(i)=u(i-1) $$ and $$ \\forall i \\in \\mathbb{N}, i>k+2 \\ \\ u(i)=u(i-1)$$ and this vector $$v=(0,1,0,1,0,1,0)$$ where I can't. In practice, my vectors (which represent experimental data) will most likely look like that: $$ u=(0,0,0,1,0,0,0,1,1,1,1,0,1,1) $$ and I will have to determine empirically until what point I can consider a vector to contain \"homogeneous\" values which can be \"grouped\" into two sets. In this case, the first 7 components (0,0,0,1,0,0,0) would be one set, the next 7 components (1,1,1,1,0,1,1) another set. Definitions Heterogeneity I would define the concept of heterogeneity $\\mathscr{H}$ of the m-s+1 sub-values (ranging from u(s) to u(m)) of a vector u as follows: $$\\mathscr{H}(u,s,m)=\\sum_{k=s}^{m-1}{|u_{k+1}-u_{k}|}$$ $$s\\in\\{1...n\\}, m\\in\\{1...n\\}, n=size(u), s<m$$ Example: $$u=(0,0,1,1,1,0,0)$$ $$\\mathscr{H}(u,3,5)=0$$ Perfectly consistent vector A given vector u of size n is said to be perfectly consistent if and only if $$\\mathscr{H}(u,1,n)=0$$ Example: $$u=(0,0,0,0,0,0,0)$$ $$ and $$ $$v=(1,1,1,1,1,1,1) $$ are perfectly consistent vectors of size 7 Perfectly homogeneous vector A given vector u of size n is said to be perfectly homogeneous if and only if $$\\exists i, i\\in\\{2...n\\}, \\mathscr{H}(u,1,i-1)=\\mathscr{H}(u,i,n)=0$$ The vector u is then said to be homogeneous of rank i. For instance: $$u=(0,0,0,1,1,1,1)$$ is homogeneous of rank 4. I most likely need to refine this definition, but you get the idea. Perfectly heterogeneous vector A given vector u of size n is said to be perfectly heterogeneous if and only if $$\\mathscr{H}(u,1,n)=\\max_{v, size(v)=n}\\mathscr{H}(v,1,n) $$ Heterogeneity is maximal given all sets of possible vectors of size n containing binary values (0,1). Example: $$u=(0,1,0,1,0,1,0)$$ is a perfectly heterogeneous vector of size 7. So is $$v=(1,0,1,0,1,0,1)$$ My question Assuming what I wrote above makes sense, I feel I am reinventing the wheel. This surely exists and has be done already somewhere, but my lack of mathematical knowledge prevents me from knowing even what to google and where to look for. Could anyone point me toward useful resources that would help me achieve what I am trying to do here? Is there a better way to name those concepts, instead of \"heterogeneity\" and \"consistency\"? Is what I am trying to do a particular case of a broader field, from which I could use the results / theorems with particular conditions? Misc. considerations This is my first time writing maths in English and on MathOverflow. Any help on improving the quality of this post will be greatly appreciated. I have very basic maths knowledge from undergrad. I need this for modeling correlations in a psychology experiment. The value of the rank i of a homogeneous vector does not matter. What matters is that, as much as possible, my vectors contain two clear \"groups\" of 0 and 1. I am not sure about the tags for this question. If you have any recommendation, I'd be grateful as well. co.combinatorics linear-algebra mathematical-modeling Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Mar 28, 2015 at 6:31 Hazan Tayeb 11 3 3 bronze badges $\\endgroup$ 1 $\\begingroup$ You're using Hamming or $\\ell_1$ distance so heterogeneity formula could just have $\\sum_{k=s}^{m-1} |u_{k+1}-u_k|$. It can be seen as an absolute valued first derivative measure. Such notions are richer if you consider the space not as binary functions on $\\mathbb{N}$ but binary functions on some finite field $\\mathbb{F}_2^a$ where you can choose $a$ as large as you need. However, the idea of \"clear\" groups depends on the regularity of the set $f^{-1}(1)$ in $\\mathbb{N}$ so I am not sure if your data has some relationship to this \"labeling\", i.e. the topology of integers. $\\endgroup$ kodlu –  kodlu 2015-03-28 23:18:24 +00:00 Commented Mar 28, 2015 at 23:18 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions co.combinatorics linear-algebra mathematical-modeling See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 1 Quantifying aggregate vector strength/vector arithmetic 8 Complexity of finding a 0-1 vector in a subspace or showing that there is none 2 Separations between notions of rank for modules over commutative (semi-)rings with no zero divisors. 5 Estimate the rank of a vector 3 Number of *distinct* dot products of an integer vector by elements of a hyper-rectangle 1 Solving $Ax=e_k$ for standard basis vector $e_k$, sparse $A$ 1 vector partition 1 Is there a bound on the norm of the product of second moment matrix with random vector? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 201302, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "co.combinatorics,linear-algebra,mathematical-modeling,co.combinatorics,linear-algebra,mathematical-modeling",
  "scraped_at": "2026-01-14T04:13:00.440412",
  "answer": ""
}