{
  "id": "q_207868",
  "mathoverflow_id": 207868,
  "url": "https://mathoverflow.net/questions/207868/multivariable-polynomial-interpolation-via-evaluations-from-entrywise-powers-of",
  "title": "reference request - Multivariable polynomial interpolation via evaluations from entrywise powers of a point",
  "body": "I am interested in multivariate polynomial interpolation. Within computational complexity theory, I use it to create efficient reductions between counting problems. In the univariate case, there is a useful characterization of when such polynomials of degree $d$ can be interpolated: $d+1$ distinct evaluation points (since the coefficient matrix of the corresponding linear system is Vandermonde ). In the multivariate case, it is my understanding that a similarly useful characterization is not known. However, I often encounter the following special case (for which I hope more is known). For $n \\ge 3$ , let $$p \\in \\mathbb{C}[X_1, X_2, \\dotsc, X_n]$$ be a homogeneous polynomial of (total) degree $d \\ge 1$ , which has $N = \\binom{d+n-1}{n-1}$ coefficients. Given a point $$x = (x_1, x_2, \\dotsc, x_n) \\in \\mathbb{C}^n,$$ consider the set of points $$S = \\left\\{\\left(x_1^k, x_2^k, \\dotsc, x_n^k\\right) \\in \\mathbb{C}^n~\\middle|~0 \\le k \\le N - 1\\right\\}$$ defined by taking entrywise (aka Hadamard or Schur) powers of $x$ . Given the evaluations of $p$ at all the points in $S$ , we have a linear system whose coefficient matrix is Vandermonde (which follows from the definition of $S$ ). We can interpolate $p$ iff this matrix is invertible iff the monomials of $p(x) = p(x_1, x_2, \\dotsc, x_n)$ are distinct. For $n=2$ , these monomials are distinct iff the points in $S$ (when viewed as length-two vectors) are pairwise linearly independent iff neither $x_1$ nor $x_2$ is $0$ and the ratio $x_1 / x_2$ is not a root of unity. This is a useful characterization. Question What about a useful characterization when $n > 2$ ? For any $n \\ge 3$ , is there a useful characterization of $x$ with the property that, for all degrees $d \\ge 1$ and all homogeneous polynomials $p$ of (total) degree $d$ , the monomials of $p(x)$ are distinct? reference-request polynomials Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked May 28, 2015 at 18:34 Tyson Williams 563 3 3 silver badges 17 17 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request polynomials See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 17 Finite interpolation by a nondecreasing polynomial 0 About the maximum degree of multivariate polynomial interpolation 6 Abel-Ruffini theorem for systems of polynomial equations 3 Checking presence of a specific term in product polynomial 0 On the solutions of system of homogeneous polynomials of degree $d$ in $n$ variables $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 207868, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,polynomials,reference-request,polynomials",
  "scraped_at": "2026-01-14T04:13:04.935479",
  "answer": ""
}