{
  "id": "q_204471",
  "mathoverflow_id": 204471,
  "url": "https://mathoverflow.net/questions/204471/solving-a-certain-constrained-isoperimetric-approximation-problem",
  "title": "na.numerical analysis - Solving a Certain Constrained Isoperimetric Approximation-Problem",
  "body": "This question is related to my question Differential Geometric Aspects of Rubber Bands , where I asked for a mathematical model of contracting rubber bands. In contrast to my former question, the situation is different here, because meanwhile I have devised a model, that seems appropriate and am now interested in solutions of the related mathematical questions (comments regarding physical aspects are however still welcome). A model for rubber bands prior to contraction the rubber band is modelled as a closed curve of length $2\\pi$ closed. continuous, length-parameterized curve $$x_0(u): [0,2\\pi)\\ni u\\mapsto\\mathbb{R}^n$$ $$x_0(u+2\\pi)=x_0(u)$$ $$\\|\\dot x_0(u)\\|=1 $$ after the rubber band has been released and $\\Delta t$ seconds have passed, it is assumed that it has contracted to $x_{\\Delta t}(u)$ of length $2\\pi-\\Delta s$ with the following properties: $$x_{\\Delta t}(u):[0,2\\pi)\\ni u\\mapsto\\mathbb{R}^n$$ $$x_{\\Delta t}(u+2\\pi)=x_{\\Delta t}(u)$$ $$\\|\\dot x_{\\Delta t}(u)\\|=1-\\frac{\\Delta s}{2\\pi}$$ Under the further assumption that the points of $x_0(u)$ are initially at rest and then are linearly accelerated on their way to position $x_{\\Delta t}(u)$ , it is possible to calculate the final speed from the distance of the initial and the final position and thus to obtain a factor for energy consumption: $$s(t) = \\frac{1}{2}at^2\\iff a=\\frac{2s(t)}{t^2}$$ $$v(t) = at$$ $$E_{kin}(t)\\ \\propto\\ \\frac{1}{2}v^2(t) = \\frac{2s^2}{t}$$ The total energy, $\\Delta E_{kin}$ , that is released during the time span $\\Delta t$ , in which the rubber band contracts from its initial state, that is modelled by $x_0(u)$ , to its final state, modelled by $x_{\\Delta t}(u)$ , is proportional to the integral over the squared distances between corresponding curve points: $$\\Delta E_{kin}\\ \\propto\\ \\int_{0}^{2\\pi}{\\frac{\\|x_0(u)-x_{\\Delta t}(u)\\|^2}{\\Delta t}du}\\ \\propto\\ \\int_{0}^{2\\pi}{\\|x_0(u)-x_{\\Delta t}(u)\\|^2du}$$ Question: given $x_0(u)$ , $\\Delta t$ and $\\Delta s$ as defined above, how can the $x_{\\Delta t}(u)$ , with the stated properties, be determined, that minimizes $\\int_{0}^{2\\pi}{\\|x_0(u)-x_{\\Delta t}(u)\\|^2du}$ ? na.numerical-analysis approximation-algorithms Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked May 1, 2015 at 18:19 Manfred Weis 14k 4 4 gold badges 40 40 silver badges 82 82 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions na.numerical-analysis approximation-algorithms See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 5 Differential Geometric Aspects of Rubber Bands Related 1 Bivariate Function Approximation 2 Need a graph theory problem with nontrivial faster approximation algorithm 2 2-approximation algorithm for Minimum Maximal Matching (MMM) problem 3 Approximation of half-integers modified Bessel function of the second kind 0 Solving (or approximating) a certain delay differential equation 1 Approximation for interpolation of harmonic numbers 1 Chebyshev approximation via iterated weighted least squares fits $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 204471, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "na.numerical-analysis,approximation-algorithms,na.numerical-analysis,approximation-algorithms",
  "scraped_at": "2026-01-14T04:13:02.693872",
  "answer": ""
}