{
  "id": "q_209932",
  "mathoverflow_id": 209932,
  "url": "https://mathoverflow.net/questions/209932/bounding-distance-between-geodesics-in-manifolds-with-nonpositive-curvature",
  "title": "dg.differential geometry - Bounding distance between geodesics in manifolds with nonpositive curvature",
  "body": "This is a duplicate of a question at the stackexchange which was not answered . I've recently read (in some notes by Mark Pollicott) the following related claims, which, although quite intuitive, I would like to see proven (and clarified). Let $M$ be a compact, connected Riemannian manifold of nonpositive curvature and let $\\tilde{M}$ be its universal cover. Let $\\sigma,\\tau:[0,T]\\to \\tilde{M}$ be two unit speed geodesics. Then: (a) $d(\\sigma(t),\\tau(t))\\leq d(\\sigma(0),\\tau(0))+d(\\sigma(T),\\tau(T))$ , for all $0\\leq t\\leq T$ (b) $d(\\dot \\sigma(t),\\dot \\tau(t))\\leq d(\\dot \\sigma(0),\\dot \\tau(0))+d(\\dot\\sigma(T),\\dot\\tau(T))$ , for all $0\\leq t\\leq T$ Note : In item (a), $d$ refers to the shortest-path distance induced by the Riemannian metric. In (b) there is a distance $d$ on $T\\tilde{M}$ , but there's no clarification for this on the notes I read, it might be the distance induced by the Sasaki metric or maybe $d(v,w)=\\sup\\{d(\\pi(\\phi_tv),\\pi(\\phi_tw)):\\ t\\in[0,1]\\}$ (where $\\phi_t$ is the geodesic flow on $T\\tilde{M}$ and $\\pi:T\\tilde{M}\\to\\tilde{M}$ is the projection). dg.differential-geometry riemannian-geometry curvature Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jun 23, 2015 at 4:35 EvaristoCarriego 191 4 4 bronze badges $\\endgroup$ 1 6 $\\begingroup$ For (a) you can use that $d$ is convex for manifolds of nonpositive curvature to get a stronger statement. See Sturm (Probability measures on metric spaces of nonpositive curvature) or Ballman (Prop. 5.4. of \"Lectures on spaces of nonpositive curvature\"). $\\endgroup$ user35593 –  user35593 2015-06-23 08:47:00 +00:00 Commented Jun 23, 2015 at 8:47 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions dg.differential-geometry riemannian-geometry curvature See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 11 Strong equivalence between intrinsic and extrinsic metrics on $GL_n^+$? 6 A step in the proof on the uniqueness of mass 4 Bishop-Gromov type inequality for Jordan curve on 2-sphere 4 Comparing two Riemannian metrics on Grassmannian 6 How to prove two curves in the frame bundle to project to the same curve on base manifold? 8 If a (distance) metric on a connected Riemannian manifold locally agrees with the Riemannian metric, is it equal to the induced metric? 5 Manifolds with nonpositive radial curvature 1 Curve length in the Sasaki metric 5 Clarifying a result of Klingenberg $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 209932, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "dg.differential-geometry,riemannian-geometry,curvature,dg.differential-geometry,riemannian-geometry,curvature",
  "scraped_at": "2026-01-14T04:12:03.945916",
  "answer": ""
}