{
  "id": "q_202819",
  "mathoverflow_id": 202819,
  "url": "https://mathoverflow.net/questions/202819/universal-anti-horn-classes",
  "title": "reference request - Universal anti-Horn classes?",
  "body": "Is there published work about universal anti-Horn classes? Anti-Horn formulas are also sometimes known as dual Horn. See also related question Is there any research of universal algebras axiomatized by non-Horn clauses? asking about universal classes more generally. A universal class is definable by the conjunction of a set of universal sentences, which here are formulas with universal quantification. The underlying language allows relational symbols and an equality symbol $\\approx$; terms are built from variables, constants, and functional symbols; and atoms are either relational expressions $R(\\mathbf{t})$ or identities $s \\approx t,$ where $s$ and $t$ are terms and $\\mathbf{t}$ is a sequence of terms. Quantification is first-order. Because propositional formulas are equivalent to formulas in conjunctive normal form, universal sentences can be considered to be disjunctions of atoms or negated atoms. Each universal sentence can then be classified by how many atoms and negated atoms it contains in the disjunction. A Horn formula is a disjunction of atoms or negated atoms, with at most one atom that is not negated; the remaining atoms are all negated. An anti-Horn or dual Horn formula has at most one atom that is negated. First, consider Horn classes. Varieties are universal classes definable by identities. Denote a list of variables by $\\mathbf{x}$. Quasivarieties are universal classes definable by quasi-identities of the form $\\alpha_1(\\mathbf{x})\\land\\dots\\land\\alpha_k(\\mathbf{x}) \\to \\alpha_0(\\mathbf{x}),$ where each $\\alpha_i$ is either an identity or a relational atom $R(\\mathbf{x}).$ If in a quasi-identity $k=1$ and $\\alpha_1$ is allowed to be the special symbol $\\top$, denoting a relation with arity 0 that is always interpreted as true, then quasi-identities subsume identities. If in a quasi-identity $\\alpha_0$ is the special symbol $\\bot$, interpreted as false, then such a quasi-identity is known as an anti-identity. Anti-identities define anti-varieties. A universal Horn sentence is then either an identity, anti-identity, or a quasi-identity; and a universal Horn class is a class definable by universal Horn sentences. (These definitions are essentially those of Gorbunov.) The theory of universal Horn classes is therefore rather general, encompassing all of classical universal algebra. However, to characterize some classes of structures one sometimes requires sentences that are universal anti-Horn, i.e. of the form $$\\forall \\mathbf{x}\\; \\alpha_0(\\mathbf{x}) \\to \\alpha_1(\\mathbf{x})\\lor\\dots\\lor\\alpha_k(\\mathbf{x}),$$ or equivalently disjunctions with at most one negated atom. Anti-Horn sentences capture fixed finite cardinality of a structure, and other desirable properties that are not closed under products (recall a result by Keisler-Galvin-Shelah that first-order formulas preserved by reduced products are precisely those that are equivalent to a Horn formula). Throwing out products means losing all the nice tools in chapter 9 of Hodges or chapter 6 of Chang & Keisler. Compactness also fails for classes of such structures. Finite model theory considers classes of finite structures, i.e. models of infinite disjunctions of universal anti-Horn sentences of a special form, but its focus is often beyond first-order logic and existential quantification is rather important for the core machinery of Ehrenfeucht–Fraïssé games . One obviously cannot expect universal anti-Horn classes to have the same nice structure theory that exists for varieties, and to a lesser extent for quasi-varieties and universal Horn classes, nor can one expect to be able to use the tools of finite model theory, but there should be some basic theory. I've found a few of the later papers by Mal'tsev that start sketching a theory of universal classes, but he died before getting far. If such work has been done it is therefore possibly quite old and difficult to find in English, so I am hoping to find pointers to such theory. I intend to apply it to classes defined by means of both universal Horn and universal anti-Horn sentences, arising naturally in constraint satisfaction. This question seems extremely basic, but also missing from standard textbooks, so perhaps I am missing an extremely basic insight about why universal anti-Horn classes are mathematically uninteresting—if so, a hint would be appreciated. Viktor A. Gorbunov, Algebraic theory of quasivarieties , Plenum, 1998. (ISBN 0-306-11063-6) A. I. Mal'tsev, Universally axiomatizable subclasses of locally finite classes of models , Siberian Mathematical Journal 8 (5), 1967, pp.764–770. (doi: 10.1007/BF01040652 ) Edit 2015-04-20: as suggested in comments here and at the linked question, I'm now investigating multiple-conclusion rules, preservation theorems relating to coproducts and the \"arrows reversed\" notion corresponding to reducts, discriminator terms, pseudoidentities, and also considering the term \"dual Horn\" instead of \"anti-Horn\". Additional references 2015-04-23: A. I. Mal'cev, Algebraic Systems , Springer, 1973. (ISBN 0-387-05792-7) See Section 7. D. J. Shoesmith and T. J. Smiley, Multiple-conclusion Logic , Cambridge University Press, 1978. reference-request lo.logic model-theory universal-algebra algebraic-systems Share Cite Improve this question Follow edited May 13, 2020 at 23:03 YCor 67.5k 5 5 gold badges 203 203 silver badges 301 301 bronze badges asked Apr 13, 2015 at 17:38 András Salamon 2,370 2 2 gold badges 19 19 silver badges 33 33 bronze badges $\\endgroup$ 3 $\\begingroup$ I'm going to spout some moderately informed nonsense, with the hope that some sense and a possible answer you need can be found in it. Such classes can be imagined as unions or coproducts of varieties, which is like saying a set is a union of its elements. If there is a uniform description to these elements, there may be more interest; otherwise, do you care about my laundry list and should I care about yours? Coproducts should be better understood, but that may mean doing a lot of laundry. Gerhard \"Read This Metaphorically, Not Literally\" Paseman, 2015.04.13 $\\endgroup$ Gerhard Paseman –  Gerhard Paseman 2015-04-13 17:48:47 +00:00 Commented Apr 13, 2015 at 17:48 $\\begingroup$ I suspect that's supposed to allow $\\alpha_i$ to be $T$, not just $\\alpha_0$? $\\endgroup$ Noah Schweber –  Noah Schweber 2015-04-14 02:40:38 +00:00 Commented Apr 14, 2015 at 2:40 $\\begingroup$ Literature on multiple-conclusion rules might be relevant... $\\endgroup$ მამუკა ჯიბლაძე –  მამუკა ჯიბლაძე 2015-04-14 06:30:39 +00:00 Commented Apr 14, 2015 at 6:30 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request lo.logic model-theory universal-algebra algebraic-systems See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 4 Is there any research of universal algebras axiomatized by non-Horn clauses? Related 4 Survey of finite axiomatizability for relational theories? 3 Is quasivariety generated by all perfect graphs finitely axiomatizable? 4 Preservation theorem for intersection of relations on a fixed set 4 Classes of algebras axiomatizable by special formulas; and free objects $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 202819, relatedQuestionId: +questionId, location: 'sidebar', source",
  "tags": "reference-request,lo.logic,model-theory,universal-algebra,algebraic-systems,reference-request,lo.logic,model-theory,universal-algebra,algebraic-systems",
  "scraped_at": "2026-01-14T04:12:01.706153",
  "answer": ""
}