{
  "id": "q_217486",
  "mathoverflow_id": 217486,
  "url": "https://mathoverflow.net/questions/217486/thomsen-blaschke-condition",
  "title": "gt.geometric topology - Thomsen Blaschke condition",
  "body": "I am reading a paper (Paper 1: https://ideas.repec.org/p/cwl/cwldpp/76.html , that cites another paper ( Paper 2 ) for its proof. Paper 1, page 1, line 10 says : Consider the topological image G of a 2-dimensional convex set and 3 families of curves in that set such that a) exactly one curve of each family goes through a point of G and b)two curves of different families have at most one common point. I want to know if condition (a) means that exactly one curve of each family goes through every point of G, or if there can be points in G where no curve passes. I tried to read Paper 2 to get a better idea, but it is written in German, a language I am unable to understand. Any help will be appreciated. From what I understand, this problem is related to given 3 families of curves in a plane when is there a transformation that carries it to 3 families of parallel straight lines. The author of paper 1 calls it as Thomsen Blaschke condition, and a google search on the condition did not help me. gt.geometric-topology geometry Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Sep 4, 2015 at 21:26 Juanito 221 1 1 silver badge 7 7 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions gt.geometric-topology geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 12 The mathematics of tavern puzzles 2 Blaschke Condition for hyperbolic lattices 3 Number of curves in an admissible system of Jordan curves on a surface 5 The metric difficulty of unknotting unknots 4 Topological type of complement of Heegaard curves in Heegaard surface $(\\Sigma - \\alpha - \\beta)$ $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 217486, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "gt.geometric-topology,geometry,gt.geometric-topology,geometry",
  "scraped_at": "2026-01-14T04:13:13.938575",
  "answer": ""
}