{
  "id": "q_219664",
  "mathoverflow_id": 219664,
  "url": "https://mathoverflow.net/questions/219664/hypoelliptic-pseudodifferential-operators-and-fredholm-equations",
  "title": "ap.analysis of pdes - Hypoelliptic pseudodifferential operators and Fredholm equations?",
  "body": "I read here the following: The parametrix is a useful concept in the study of elliptic differential operators and, more generally, of hypoelliptic pseudodifferential operators with variable coefficient, since for such operators over appropriate domains a parametrix can be shown to exist, can be somewhat easily constructed and be a smooth function away from the origin. Having found the analytic expression of the parametrix, it is possible to compute the solution of the associated fairly general elliptic partial differential equation by solving an associated Fredholm integral equation: also, the structure itself of the parametrix reveals properties of the solution of the problem without even calculating it, like its smoothness and other qualitative properties. Does anyone know any reference (books/papers) where I can find more infomation about using parametrix and Fredholm integral equations for attacking hypoellipticity problems? Thanks ap.analysis-of-pdes elliptic-pde pseudo-differential-operators Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Sep 30, 2015 at 13:22 PtF 383 1 1 silver badge 6 6 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ap.analysis-of-pdes elliptic-pde pseudo-differential-operators See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 1 Elliptic Differential Equations with rough boundary data 0 Differences between parabolic operators of second order and higher order 2 Parabolic PDE Long Time Asymptotics and Elliptic Operator Spectrum 6 The adjoint operators as elliptic operators 3 Resources on Elliptic Boundary Value Problems on manifolds 2 Resolvent of the Laplacian as a pseudodifferential operator and its single layer potential $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 219664, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ap.analysis-of-pdes,elliptic-pde,pseudo-differential-operators,ap.analysis-of-pdes,elliptic-pde,pseudo-differential-operators",
  "scraped_at": "2026-01-14T04:13:18.431218",
  "answer": ""
}