{
  "id": "q_214503",
  "mathoverflow_id": 214503,
  "url": "https://mathoverflow.net/questions/214503/in-how-many-ways-can-one-extend-the-zero-section-of-the-affine-line-with-a-doubl",
  "title": "ag.algebraic geometry - In how many ways can one extend the zero section of the affine line with a double origin",
  "body": "Let $X$ be the affine line with a double origin over $\\mathrm{Spec}\\,\\mathbb Z$ . Let $X_\\eta$ be its generic fibre, the affine line with a double origin over $\\mathrm{Spec}\\,\\mathbb Q$ . Let $0$ be one of the origins of $X_\\eta$ . Are there infinitely many ways of extending $0$ to a section of $X$ ? My feeling is that besides taking the closure of $0$ in $X$ , we can also alter our choice of origin at some primes. If that feeling is correct, then we would get infinitely many sections of $X\\to \\mathrm{Spec}\\,\\mathbb Z$ inducing the same section generically. ag.algebraic-geometry nt.number-theory arithmetic-geometry schemes Share Cite Improve this question Follow edited Apr 16, 2019 at 20:47 user137767 asked Aug 11, 2015 at 8:35 Shane 21 1 1 bronze badge $\\endgroup$ 2 1 $\\begingroup$ You should think about this on your own. Do you know a finite atlas of open affines for $X$? For each such open, what is the relative closure of $\\{0\\}$ in that open? $\\endgroup$ Jason Starr –  Jason Starr 2015-08-11 12:01:27 +00:00 Commented Aug 11, 2015 at 12:01 1 $\\begingroup$ ... My last sentence should have been: What are the inverse images of these open affines with respect to your (putative) section? $\\endgroup$ Jason Starr –  Jason Starr 2015-08-11 13:51:02 +00:00 Commented Aug 11, 2015 at 13:51 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry nt.number-theory arithmetic-geometry schemes See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 3 Detecting sections on an arithmetic variety 4 Shrinking the target to make the domain affine 3 When do generizations (\"generalizations\") lift uniquely? 2 Chow ring of an affine line with a double origin 1 Specialization of points on the generic fiber in a prestable model of $\\mathbb{P}^1$ $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 214503, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,nt.number-theory,arithmetic-geometry,schemes,ag.algebraic-geometry,nt.number-theory,arithmetic-geometry,schemes",
  "scraped_at": "2026-01-14T04:13:11.645233",
  "answer": ""
}