{
  "id": "q_221923",
  "mathoverflow_id": 221923,
  "url": "https://mathoverflow.net/questions/221923/complexity-of-finding-algebraic-dependency-of-polynomials-over-the-rationals-or",
  "title": "Complexity of finding algebraic dependency of polynomials over the rationals or in a finite field?",
  "body": "Let $f_1,\\ldots f_m \\in K[x_1,\\ldots,x_n]$ where $K$ is $\\mathbb{Q}$ or a finite field. Q1 What is the complexity of finding all algebraic dependencies between $f_i$ ? Q2 What is the complexity of finding all algebraic dependencies between $f_i$ of degree up to $d$ ? Sage can compute this and I believe it computes first Groebner basis, which is slow. Today I am still waiting for dependency of only six low degree polynomials. Couldn't find the answer with web searching. polynomials computational-complexity Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Oct 27, 2015 at 8:20 joro 25.8k 10 10 gold badges 69 69 silver badges 135 135 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions polynomials computational-complexity See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 8 Does there exist a general theory of \"arithmetic complexity\"/\"arithmetic height\"? 1 best deterministic complexity for factoring polynomials over finite field 5 homogeneous polynomials over a finite field 11 How hard is it to guess Kuperberg's certificate of knottedness? 9 What is the state-of-the-art for solving polynomials systems over fields that are not algebraically closed? 0 Ideal membership and change of fields 15 The most efficient algorithm for finding a root of a polynomial over finite field $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 221923, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "polynomials,computational-complexity,polynomials,computational-complexity",
  "scraped_at": "2026-01-14T04:13:22.903474",
  "answer": ""
}