{
  "id": "q_220620",
  "mathoverflow_id": 220620,
  "url": "https://mathoverflow.net/questions/220620/graded-structures-for-simple-c-algebras-without-nontrivial-idempotent",
  "title": "reference request - Graded structures for simple $C^{*}$ algebras without nontrivial idempotent",
  "body": "Edit(A confession): I just realized that the question is trivial: Since one can easily prove that the convex hull of the spectrum of every nontrivial homogeneous element of a $\\mathbb{Z}_{n}$ -graded $C^{*}$ algebra must contatin the origin. But is this statement true if we replace $\\mathbb{Z}_{n}$ by an arbitrary finite group $G$ ? So I confess that the last statement of this note was a trivial statement about Kaplanski-Kadison conjecture. http://arxiv.org/abs/1110.0091 But I am still interested to know: \"Is there a $\\mathbb{Z}_{2}$ graded structure for $C^{*}_{red} F_{2}$ such that a non trivial homogeneous element is invertible and can be connected to the identity? (A question which I explained in question 2 in the above paper) Edit: According to the comment of Qiaochu Yuan I realize that $\\mathbb{C}^{2}$ is a counter example. So I add the assumption \"simplicity\" to this edited version Note: In this post, the cyclic group of order $n$ is denoted by $\\mathbb{Z}_{n}$ . For a unital simple $C^{*}$ algebra $A$ , are the following two statements equivalent? A has no nontrivial projection. For all natural number $n$ and every $\\mathbb{Z}_{n}$ -graded structure for $A$ , the convex hull of the spectrum of every nontrivial homogeneous element $a\\in A$ , must contain the origin. Note that 1. implies 2.(for this implication we do not need \"simplicity\") By a non trivial homogeneous element of a $\\mathbb{Z}_{n}$ -graded algebra $A=\\oplus_{i=0}^{n-1} A_{i}$ , we mean an element $a\\in A_{i}$ for some $i\\neq 0$ . Can one consider the matrix algebras as a possible counter example? Is it easy to classify all $\\mathbb{Z}_{m}$ graded structures for matrix algebra $M_{n}(\\mathbb{C})$ ? As another related question: What reference classified the $\\mathbb{Z}_{n}$ graded structures for $C^{*}_{red} \\Gamma$ where $\\Gamma$ is a torsion free group? reference-request oa.operator-algebras c-star-algebras operator-theory noncommutative-geometry Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Oct 11, 2015 at 6:35 Ali Taghavi 1 $\\endgroup$ 1 1 $\\begingroup$ The answer should be no. It suffices to find a compact Hausdorff space $X$ which admits no nontrivial $\\mathbb{Z}_n$-action (note that this $\\mathbb{Z}_n$ is not the same as the $\\mathbb{Z}_n$ in the question, it is the Pontryagin dual) but which has more than one clopen connected component; then $A = C(X)$ will be a counterexample. $\\endgroup$ Qiaochu Yuan –  Qiaochu Yuan 2015-10-11 17:31:33 +00:00 Commented Oct 11, 2015 at 17:31 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request oa.operator-algebras c-star-algebras operator-theory noncommutative-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 5 Fuglede-Kadison determinants in $L(\\mathbb{F}_2)$ 7 $H^{*}$ algebras as a generalization of $C^{*}$ algebras 11 Free graded Lie algebras 8 A question regarding Kadison-Kaplansky idempotent conjecture (A nearest group element $g$ to a nontrivial self adjoint unitary element u ) 4 On differential equation $Z'=Z^2-Z$ on a $C^*$ algebra 5 Integer elements of a $C^*$ algebra and the Kaplansky conjecture $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 220620, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,oa.operator-algebras,c-star-algebras,operator-theory,noncommutative-geometry,reference-request,oa.operator-algebras,c-star-algebras,operator-theory,noncommutative-geometry",
  "scraped_at": "2026-01-14T04:13:20.663158",
  "answer": ""
}