{
  "id": "q_226482",
  "mathoverflow_id": 226482,
  "url": "https://mathoverflow.net/questions/226482/does-%c5%81o%c5%9bs-theorem-imply-choice-given-a-free-ultrafilter",
  "title": "model theory - Does Łoś&#39;s theorem imply choice given a free ultrafilter?",
  "body": "In the paper \"Łoś's theorem and the boolean prime ideal theorem imply axiom of choice\" Howard has shown that Łoś's theorem and the boolean prime ideal theorem imply axiom of choice. At the end of the paper, author remarks that it was not known at the time whether BPIT can be removed from their argument, but he mentions that if there are no free ultrafilters on any set, then Łoś's theorem (pretty trivially) holds, while choice doesn't, so we might be unable to remove BPIT. Indeed, two years later Blass has shown that it is consistent with ZF that there are no free ultrafilters on any set, and hence Łoś's theorem doesn't imply axiom of choice. This argument shows that in order to deduce full axiom of choice from Łoś's theorem, we need some ultrafilters. Here comes my question: Is it known whether Łoś's theorem implies full axiom of choice in conjuntion with: There exists a free ultrafilter or There exists a free ultrafilter on every infinite set Thanks in advance model-theory axiom-of-choice ultrafilters Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Dec 18, 2015 at 21:50 Wojowu 33.8k 3 3 gold badges 126 126 silver badges 219 219 bronze badges $\\endgroup$ 3 2 $\\begingroup$ That's an incredibly tough question to answer. If the answer is at all positive, this would require a very different proof (since just a simple reduction to Howard's proof is likely to be caught in the many years since that paper was published); if the answer is negative, this would require coming up with brand new models in which LT's holds and the axiom of choice fails (because I don't know if we even know of such models except Blass' model without ultrafilters). $\\endgroup$ Asaf Karagila –  Asaf Karagila ♦ 2015-12-19 01:10:01 +00:00 Commented Dec 19, 2015 at 1:10 $\\begingroup$ @AsafKaragila Thanks for the reply. I hoped that there would have been some \"simple reduction\" over these years which I just couldn't have find be searching. Feel free to post this as an answer. $\\endgroup$ Wojowu –  Wojowu 2015-12-19 07:47:08 +00:00 Commented Dec 19, 2015 at 7:47 $\\begingroup$ In fact Howard applied only a special form of BPI, sometimes called the ultrafilter lemma, which claims that any filter over any set can be extended to an ultrafilter. $\\endgroup$ Vladimir Kanovei –  Vladimir Kanovei 2017-03-11 04:56:52 +00:00 Commented Mar 11, 2017 at 4:56 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions model-theory axiom-of-choice ultrafilters See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 10 Reference Request: Independence of the ultrafilter lemma from ZF 23 How \"much\" does (Grigorieff) forcing destroy an ultrafilter? 21 How do I apply the Boolean Prime Ideal Theorem? 17 Artin Rings, Noetherian Rings, and the Axiom of Choice 4 Does Tarski's squaring theorem imply Axiom of Choice in NFU? 4 Supremum of infimum of measure of members of a free ultrafilter 12 Ultrafilter lemma for arbitrary lattice 11 Does subsingleton choice imply LEM? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 226482, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "model-theory,axiom-of-choice,ultrafilters,model-theory,axiom-of-choice,ultrafilters",
  "scraped_at": "2026-01-14T04:13:32.153266",
  "answer": ""
}