{
  "id": "q_229240",
  "mathoverflow_id": 229240,
  "url": "https://mathoverflow.net/questions/229240/does-feuter-regularity-imply-derivability-in-all-directions",
  "title": "cv.complex variables - Does Feuter regularity imply derivability in all directions?",
  "body": "The standard type of regularity in Clifford Calculus is the one introduced by Feuter, namely: a function is Feuter regular iff it is in the zero set of the Clifford-Dirac operator $D= \\partial x_0 + \\sum e_i \\partial x_i$ where the $e_i$ are the orthonormal basis of vectors, bivectors, $\\ldots$ of the algebra Now, onto my question. In the case of the Clifford algebra $Cl(0, 1)$ , aka the complex numbers, Feuter regularity at a point plus suitable differentiability in its neighborhood implies the existence and uniqueness of the derivative in all directions. Is this true in a general Clifford algebra? I suspect not (*). In that case, what goes wrong in generalizing the standard proof there (by that I mean the usual proof in complex analysis books, such as the one reported by the wiki using the decomposition via the Wirtinger derivatives)? What else can be done to ensure that the derivative in all directions exists and it is unique? (*) actually, I am pretty certain. In the quaternions, aka $Cl(0, 2)$ , the usual naive version of derivative is satisfied only by a trivial class of functions (namely the linear ones), whereas there are tons of Feuter regular functions there. cv.complex-variables quaternions clifford-algebras Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jan 25, 2016 at 13:43 Mirco A. Mannucci 8,048 4 4 gold badges 39 39 silver badges 71 71 bronze badges $\\endgroup$ 7 $\\begingroup$ I can't really comment on the general case of Clifford analysis, but I can say as much. The special case of bicomplex numbers works out just like the complex case, but that's because it too is a special case among the Clifford algebras by being commutative. In general, from the POV of associative algebras, you need the derivative/Jacobian to be in the center of the algebra. If the algebra has a trivial center, well you get the trivial class of functions (dep. on the field). I don't see a way out in the real case (maybe weakly?). OTH, in the complex case you have automatic joint holomorphy.. $\\endgroup$ M.G. –  M.G. 2016-01-25 16:17:37 +00:00 Commented Jan 25, 2016 at 16:17 $\\begingroup$ @July, can you provide some intuition as to why the Jacobian should be in the center of the algebra? Do you have some useful refs? $\\endgroup$ Mirco A. Mannucci –  Mirco A. Mannucci 2016-01-25 18:38:31 +00:00 Commented Jan 25, 2016 at 18:38 1 $\\begingroup$ Is'nt it Fueter de.wikipedia.org/wiki/Rudolf_Fueter $\\endgroup$ Peter Michor –  Peter Michor 2016-01-25 19:13:22 +00:00 Commented Jan 25, 2016 at 19:13 $\\begingroup$ @Mirco Mannucci: If $A$ is a finite-dim. associative algebra over the real or complex numbers and $f:A\\to A$ is $A$-differentiable (also called $A$-holomorphic) in a neighbourhood of $z_0\\in A$, then $f'(z_0)\\in A$ gives an $A$-linear map $A\\to A$ via the algebra multiplication. (Translated into a concrete matrix representation, you get the Jacobian or a transpose of it as well as generalized CR-equations.) Some key words: $A$-holomorphy, $A$-analyticity, $A$-differentiability, hypercomplex analysis, paracomplex geometry, hyperholomorphic functions... $\\endgroup$ M.G. –  M.G. 2016-01-25 19:19:16 +00:00 Commented Jan 25, 2016 at 19:19 $\\begingroup$ (cont) There is actually tons of literature that remains rather obscured for some reason. The whole story starts with Sheffer in 19th century, and many took over his ideas to generalize complex analysis. In fact, Clifford Analysis was invented partially to remedy the bad behavior in case of noncommutative algebras by dropping certain part of the generalized CR-equations. There is the Kazan school: Shirokov, Shurygin, Vishnevskii, Shpakivskyi, Gaisin, Rosenfeld, Plaksa, Krasnov on the one hand. On the other hand, following Sheffer, there are papers of Fox, Ketchum, Kristzen, Hausdorff, Zorn... $\\endgroup$ M.G. –  M.G. 2016-01-25 19:27:48 +00:00 Commented Jan 25, 2016 at 19:27  |  Show 2 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions cv.complex-variables quaternions clifford-algebras See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 3 What is the correct generalization of the Wirtinger derivatives to arbitrary Clifford algebras? Related 2 Isomorphisms of Positive and Negative Spinor Bundles 3 What is the correct generalization of the Wirtinger derivatives to arbitrary Clifford algebras? 4 Why does the Bogolyubov transformation work? - In language of Clifford Algebras? 15 Is there Cauchy-Goursat for $1$-cycles without invoking winding numbers? 5 Does $P_xP_y+Q_xQ_y=0 \\implies$ \"non-existence of limit cycle\" for $P\\partial_x+Q\\partial_y$? (Complex dilatation and limit cycle theory) 1 Uniqueness of spinor representation $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 229240, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "cv.complex-variables,quaternions,clifford-algebras,cv.complex-variables,quaternions,clifford-algebras",
  "scraped_at": "2026-01-14T04:13:38.868317",
  "answer": ""
}