{
  "id": "q_228236",
  "mathoverflow_id": 228236,
  "url": "https://mathoverflow.net/questions/228236/maximization-of-the-difference-of-a-monotone-submodular-function-and-a-linear-fu",
  "title": "na.numerical analysis - Maximization of the difference of a monotone submodular function and a linear function with a cardinality constraint",
  "body": "Maximizing a monotone submodular function with a cardinality constraint can be solved by using a simple greedy heuristic. However, if the submodular function is non-monotone, the greedy heuristic can perform arbitrarily poorly. Now I have a very special non-monotone submodular function: $$G(S)=F(S)−a|S|,\\qquad S\\subseteq V$$ where $F(S)$ is monontone submodular, $a$ is a constant. Furthermore, $G(S)≥0,G(\\emptyset)=G(V)=0$. Does the greedy heuristic still perform poorly for problem $\\max_{|S|\\leq K}G(S)$? na.numerical-analysis Share Cite Improve this question Follow edited May 19, 2020 at 5:46 Martin Sleziak 4,813 4 4 gold badges 39 39 silver badges 42 42 bronze badges asked Jan 12, 2016 at 12:17 LaoMao 11 2 2 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions na.numerical-analysis See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 2 Algorithmic aspects of maximizing a convex function over a convex set 4 Numerical instability using only Heun's method on a simple PDE 7 Random, Linear, Homogeneous Difference Equations and Time Integration Methods for ODEs 1 Does Monotone (linear) convergence of iterates imply monotone (linear) convergence of function values? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 228236, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "na.numerical-analysis,na.numerical-analysis",
  "scraped_at": "2026-01-14T04:13:34.395404",
  "answer": ""
}