{
  "id": "q_228917",
  "mathoverflow_id": 228917,
  "url": "https://mathoverflow.net/questions/228917/non-adjacent-pair-of-edges-with-minimal-weight-sum",
  "title": "reference request - Non-adjacent Pair of Edges with Minimal Weight Sum",
  "body": "Given an weighted, undirected Graph $G(V,E)$ without loops or parallel edges, what is the complexity of determining a pair of non-adjacent edges, whose sum of weights is w.l.o.g. minimal? is that pair of edges contained in a minimum weight (almost) perfect matching? how is the situation for euclidean graphs, i.e. when the vertices correspond to points in euclidean space and the edge weights correspond to the distance between the points of the adjacent vertices? I am interested in results about exact algorithms as well as about good heuristics. Pointers to articles are also welcome. reference-request graph-theory discrete-geometry matching-theory Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jan 21, 2016 at 8:59 Manfred Weis 14k 4 4 gold badges 40 40 silver badges 82 82 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request graph-theory discrete-geometry matching-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 3 Bellman-Ford for Matching Problems? 2 Worst case performance of heuristic for the non-Eulerian windy postman problem 3 Is it possible to improve the weight of perfect bipartite matchings faster than with Bellman-Ford? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 228917, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,graph-theory,discrete-geometry,matching-theory,reference-request,graph-theory,discrete-geometry,matching-theory",
  "scraped_at": "2026-01-14T04:13:36.632856",
  "answer": ""
}