{
  "id": "q_220215",
  "mathoverflow_id": 220215,
  "url": "https://mathoverflow.net/questions/220215/a-finiteness-question-for-integrable-polynomial-distributions-on-mathbbr3",
  "title": "ds.dynamical systems - A finiteness question for integrable polynomial distributions on $\\mathbb{R}^3$",
  "body": "This question is motivated by the finitness of limit cycles for polynomial vector fields on $\\mathbb{R}^2$ Assume that $X,Y$ are two independent polynomial vector fields on $\\mathbb{R}^{3}$ such that the distribuation $\\{X,Y\\}$ is an integrable distribution. So we have a foliation. Is it true to say that there are only a finite number of compact leaves(torus) with nontrivial holonomy? What is an example of this situation such that the foliation has at least one compact leaf? ds.dynamical-systems differential-equations foliations Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Oct 6, 2015 at 18:55 Ali Taghavi 1 $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ds.dynamical-systems differential-equations foliations See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 1 Two limit cycles which lie on the same leaf 4 A certain generalization of the Poincare Bendixson theorem 1 A Lie algebra associated to a foliation(A kind of saturation of foliations) 4 On certain 2 dimensional foliation of $Gl(2,\\mathbb{R})$ deleted by scalar matrices 2 A complex limit cycle not intersecting the real plane(2) 2 A 1 dimensional foliation of $\\mathbb{R}^4$ with few compact leaves 5 Foliation of $TM$ arising from a flat connection $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 220215, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ds.dynamical-systems,differential-equations,foliations,ds.dynamical-systems,differential-equations,foliations",
  "scraped_at": "2026-01-14T04:12:06.184632",
  "answer": ""
}