{
  "id": "q_222470",
  "mathoverflow_id": 222470,
  "url": "https://mathoverflow.net/questions/222470/factorization-of-the-fokker-planck-semigroup",
  "title": "fa.functional analysis - Factorization of the Fokker-Planck semigroup",
  "body": "I have posted this question on stackexchange over four month ago, but didn't get an answer: \"In the classical theory of Markov processes, the Fokker-Planck semigroup $\\{T_t:t\\ge 0\\}$ can be factored as $T_t=N\\circ U_t \\circ j$, $t\\ge 0$, where $j$ is an embedding, $U_t$ is a group of automorphisms, and $N$ is a conditional expectation.\" This is a direct quote from the book \"Dilation of Irreversible Evolutions in Algebraic Quantum Theory\" by D.E. Evans and J.T. Lewis. Could anyone please provide me with a concrete reference where I can find the proof of the statement above? Thanks! fa.functional-analysis oa.operator-algebras stochastic-processes operator-theory semigroups-of-operators Share Cite Improve this question Follow edited Feb 7, 2020 at 10:21 YCor 67.5k 5 5 gold badges 203 203 silver badges 301 301 bronze badges asked Nov 2, 2015 at 20:54 Andrew Frigyik 21 1 1 gold badge 1 1 silver badge 1 1 bronze badge $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions fa.functional-analysis oa.operator-algebras stochastic-processes operator-theory semigroups-of-operators See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 3 Generator of a generated $C_0$ semigroup 6 How is Kolmogorov forward equation derived from the theory of semigroup of operators? 4 Fokker-Planck equation for a truncated process 1 Does an evolution family commute with the right shift semigroup? 2 Generalized Fokker-Planck equation $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 222470, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "fa.functional-analysis,oa.operator-algebras,stochastic-processes,operator-theory,semigroups-of-operators,fa.functional-analysis,oa.operator-algebras,stochastic-processes,operator-theory,semigroups-of-operators",
  "scraped_at": "2026-01-14T04:13:25.395481",
  "answer": ""
}