{
  "id": "q_239268",
  "mathoverflow_id": 239268,
  "url": "https://mathoverflow.net/questions/239268/reference-needed-for-exact-sequence-of-acm-curves-with-homogeneous-coordinate-ri",
  "title": "homological algebra - Reference needed for exact sequence of ACM curves with homogeneous coordinate ring.",
  "body": "Let $C\\subset\\Bbb{P}^n$ be an ACM (arithmetically Cohen-Macaulay) curve with homogeneous coordinate ring $R$ . Then there is an exact sequence $$0\\to \\text{Tor}_i(R,\\Bbb{C})_k\\to H^1(C,\\wedge^{i+1}M_L(k-i-1))\\to H^1(C,\\wedge^{i+1}\\Gamma(k-i-1))\\to H^1(C,\\wedge^i M)L(k-i))\\to 0$$ Where $\\Gamma$ is trvial of rank $n+1$ and and $M_L$ is the kernel of the surjection $\\Gamma(C,\\mathcal{O}_C(1))\\to \\mathcal{O}_C(1)$ Can someone please suggest a reference for this fact? I cannot find it anywhere homological-algebra picard-group Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked May 19, 2016 at 10:30 Ryan Hendricks 951 1 1 gold badge 7 7 silver badges 11 11 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions homological-algebra picard-group See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 17 How do I get the correct long exact sequence for relative group cohomology in terms of derived functors? 4 Second differential in long exact sequence for Cech cohomology for nonabelian groups 2 Splitting of short exact sequence in the category of finitely generated modules over a commutative Noetherian ring 6 Weibel's H-book, Milnor's exact sequence for spectral sequence of filtered complex, Theorem 5.5.5 2 Exact sequence for relative cohomology + normal crossing divisors 3 The Peel exact sequence for hook Specht modules: conceptual proof $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 239268, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "homological-algebra,picard-group,homological-algebra,picard-group",
  "scraped_at": "2026-01-14T04:13:57.133891",
  "answer": ""
}