{
  "id": "q_23341",
  "mathoverflow_id": 23341,
  "url": "https://mathoverflow.net/questions/23341/an-inequality-for-certain-characters",
  "title": "finite groups - An inequality for certain characters",
  "body": "First some definitions: Let $cd(G)$ be the set of degrees of irreducible complex characters of the group $G$. Let $X$ be the collection of finite groups with the properties: $\\{1\\}\\in X$. If $G$ is a finite group such that for each $n\\in cd(G)$, $G$ has a subgroup $H$ of index $n$ with $H\\in X$, then $G\\in X$ (so the groups of $X$ are those with subgroups of all indices from character degrees, where these subgroups themselves have the same property). Let $G$ be a finite group whose complex irreducible character degrees are $1 = f_1 < f_2 < \\dots < f_t$. For a character $\\chi$ of $G$, let $s(\\chi)$ be the $k$ such that if $\\psi$ is an irreducible constituent of $\\chi$ of smallest possible degree, then $\\psi(1) = f_k$. Let $v(\\chi)$ be the $k$ such that if $\\psi$ is an irreducible constituent of $\\chi$ of largest possible degree, then $\\psi(1) = k$. What I am trying to prove (and hoping holds) is that if $G\\in X$ and $\\chi$ is an irreducible character of $G$ of degree $n = f_k$, then $G$ has a subgroup $H$ of index $n$ such that $H\\in X$ and additionally, $$s(\\chi_H) + min\\{v(\\psi^G) | \\psi\\in Irr(H)\\}\\leq k$$ The motivation for this is that if I can prove this, then I can prove the Taketa inequality for groups in $X$. Does anyone know if the result holds, or can someone find an example where it does not. It would still be interesting if the result turns out to hold under some more restrictions on $X$, like requiring the existence of subgroups of a larger set of orders, or requiring more structure on those subgroups. Edit: Disregard this question. I will ask a related but different question What conditions guarantee that a group is in the following collection? which turned out be what really mattered. finite-groups rt.representation-theory Share Cite Improve this question Follow edited Apr 13, 2017 at 12:57 Community Bot 1 2 2 silver badges 3 3 bronze badges asked May 3, 2010 at 12:52 Tobias Kildetoft 2,558 2 2 gold badges 24 24 silver badges 32 32 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions finite-groups rt.representation-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 1 What conditions guarantee that a group is in the following collection? Related 21 What can be said about Schur indices, given only the character table? 2 Some special characters of finite groups 1 About the character degree of an extension 7 Finite group with a character having one nonzero absolute value 2 Restriction of real irreducible 2-Brauer characters to subnormal subgroups $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 23341, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "finite-groups,rt.representation-theory,finite-groups,rt.representation-theory",
  "scraped_at": "2026-01-14T04:10:04.523421",
  "answer": ""
}