{
  "id": "q_230895",
  "mathoverflow_id": 230895,
  "url": "https://mathoverflow.net/questions/230895/spectra-of-certain-totally-positive-matrices",
  "title": "linear algebra - Spectra of certain totally positive matrices",
  "body": "Let $S$ be the set of $3 \\times 3$ matrices $A$ satisfying the following conditions: All minors are $>0$ (i.e., $A$ is a strictly totally positive matrix ); all principal minors are $>1$, except for the $3\\times 3$ minor $\\mathrm{det}(A)$, which is assumed to be $1$. By general theory of total positivity, the eigenvalues of $A$ are simple and positive. Question: Given positive numbers $\\lambda_1>\\lambda_2>\\lambda_3$ whose product is $1$, does it exist a matrix $A$ in the set $S$ whose eigenvalues are exactly the $\\lambda_i$'s? Some crude computer simulations indicate that the answer is no, but this may be a mistake. Remark: It is known that strictly totally positive matrices can have any simple positive spectrum (see Barrett and Johnson, Possible spectra of totally positive matrices . Linear Algebra Appl. 62 (1984), 231–233). linear-algebra eigenvalues inverse-problems total-positivity Share Cite Improve this question Follow edited Dec 5, 2019 at 20:44 Sam Hopkins ♦ 26.1k 5 5 gold badges 108 108 silver badges 200 200 bronze badges asked Feb 11, 2016 at 19:48 Jairo Bochi 2,781 20 20 silver badges 35 35 bronze badges $\\endgroup$ 0 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions linear-algebra eigenvalues inverse-problems total-positivity See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 21 What are the possible eigenvalues of these matrices? 11 $q$-analogs of total positivity 1 Derivative of eigenpair with respect to matrix 4 Total positivity tests: optimal in the number of minors vs. the computational cost 4 Are the minors of this Hadamard product Schur positive? 1 Eigenvalues of positive matrices in $\\mathrm{SL}(d,\\mathbb{Z})$ $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 230895, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "linear-algebra,eigenvalues,inverse-problems,total-positivity,linear-algebra,eigenvalues,inverse-problems,total-positivity",
  "scraped_at": "2026-01-14T04:13:41.180836",
  "answer": ""
}