{
  "id": "q_232325",
  "mathoverflow_id": 232325,
  "url": "https://mathoverflow.net/questions/232325/invariants-of-permutations-with-predicate-and-equivalency-relation",
  "title": "reference request - Invariants of Permutations with Predicate and Equivalency Relation",
  "body": "Has the following kind of problem been investigated previously and, where can I find information about it: Given the set $\\mathbb{P}_{n_0}$ of all permutations of $n_0$ elements a predicate $P: p\\in\\mathbb{P}_{n_0}\\mapsto w\\in\\{true,false\\}$ an equivalence relation $R:(p,q)\\in\\mathbb{P}_{n_0}\\times\\mathbb{P}_{n_0}\\mapsto w\\in\\{true,false\\}$ a maximal subset $\\mathcal{P}\\subseteq\\mathbb{P}_{n_0}:\\ p\\in\\mathcal{P}\\iff P(p)=true,\\ (p,q)\\in\\mathbb{P}_{n_0}\\times\\mathbb{P}_{n_0}\\implies R(p,q)=false$ determine the set of maximal sub-permutations, that are found in every $p\\in\\mathcal{P}$ ? $$ $$ Background: this question is a generalisation of Calculating a Combinatorial Generalization of Planar Convex Hulls and was motivated by Joseph O'Rourke's request for an example of a $k$ -hull in his comment. The attempt to devise some brute force algorithm for hunting down such a specimen led to some very fruitful ideas and solutions and, also to the \"discovery\" of what the essence of the problem actually is. I could find information about the statistics of random permutations (e.g here , but nothing that relates to invariant sub-permutations as specified above, so any pointers to literature or online resources would be appeciated. $$ $$ Examples of predicates may be (but are not limited to) certain degrees of optimality of tours in TSP instances. Examples for equivalence of tours may be invariance of the length measure under cyclic permutation of vertex labels and/or invariance under inversion of their sequence, as found in the problems of finding directed or undirected optimal Hamilton paths or cycles. reference-request co.combinatorics permutations Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Feb 28, 2016 at 13:09 Manfred Weis 14k 4 4 gold badges 40 40 silver badges 82 82 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request co.combinatorics permutations See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 2 Calculating a Combinatorial Generalization of Planar Convex Hulls Related 1 Permutations with extra restrictions 0 Computing Permutations with Partial Duplicates 18 Salié permutations and fair permutations 5 The proportion between permutations and derangements. 8 Permutations with all cycles odd length and permutations with all cycles even length 7 Decorated permutations and subset permutations 13 Minuscule weights of parabolic sub-root systems are not far from dominant 0 Sequence Generation with Combinations and Permutations 6 Permutations, skew-symmetric forms and degeneracy $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 232325, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,co.combinatorics,permutations,reference-request,co.combinatorics,permutations",
  "scraped_at": "2026-01-14T04:13:48.186129",
  "answer": ""
}