{
  "id": "q_231512",
  "mathoverflow_id": 231512,
  "url": "https://mathoverflow.net/questions/231512/linking-circles-inside-an-immersed-surface",
  "title": "reference request - Linking circles inside an immersed surface",
  "body": "( Migrated from Math Stack Exchange ) A smooth embedding $f : D \\to \\mathbb{R}^3$ can be isotoped to a canonical inclusion $D \\hookrightarrow \\mathbb{R}^3$. (This is part of a proof that only the unknot has the disk as a Seifert surface.) A consequence of this is that two disjoint circles $C_1, C_2 \\subset D$ cannot link in their image, that is, $f(C_1)$ is not linked with $f(C_2)$. However if $f$ is an immersion then linking is enabled near a double curve: find two small disks inside $D$ whose images intersect along a double curve, then perturb them until the boundaries of those disks form a Hopf link. The enablement of linking via an immersion seems interesting but is there any established theory on this that you could refer me to? reference-request differential-topology knot-theory seifert-surfaces Share Cite Improve this question Follow edited Jun 14, 2018 at 10:20 Manuel Bärenz 5,695 21 21 silver badges 53 53 bronze badges asked Feb 18, 2016 at 14:19 Herng Yi 221 1 1 silver badge 7 7 bronze badges $\\endgroup$ 2 1 $\\begingroup$ Here is a simple comment: each two-component link can be realized in this way. In fact, each knot in $S^3$ bounds an immersed disk with some clasp singularities. You can choose one clasp disk for each component respectively, and perturb them into general position. By taking a band sum of them you will obtain the desired immersed disk. For links with components more than 2 this is also correct. $\\endgroup$ Zhiyun Cheng –  Zhiyun Cheng 2016-03-20 04:46:42 +00:00 Commented Mar 20, 2016 at 4:46 $\\begingroup$ That sounds very interesting, do you have a reference for this construction? $\\endgroup$ Herng Yi –  Herng Yi 2016-04-04 17:38:28 +00:00 Commented Apr 4, 2016 at 17:38 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request differential-topology knot-theory seifert-surfaces See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 Immersed Seifert surfaces of minimal genus 2 Minimal genus of Seifert surface of torus knot 2 Criteria for existence of basis for Seifert surface that has trivial linking with other component of link 4 How disconnected can a Seifert surface be? 10 Different definitions of the linking number 7 Assigning a \"canonical geometry\" to a Seifert surface 2 A definition of linking number for knots in $S^3$ using chains in $D^4$ $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 231512, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,differential-topology,knot-theory,seifert-surfaces,reference-request,differential-topology,knot-theory,seifert-surfaces",
  "scraped_at": "2026-01-14T04:13:43.665095",
  "answer": ""
}