{
  "id": "q_236386",
  "mathoverflow_id": 236386,
  "url": "https://mathoverflow.net/questions/236386/a-question-about-canonical-bundle-of-moduli-space-of-kahler-einstein-metrics",
  "title": "sg.symplectic geometry - A question about canonical bundle of moduli space of Kahler Einstein metrics",
  "body": "Let $\\mathcal M$ be a moduli space of Kahler-Einstein metrics with negative Ricci curvatures on pairs $(X,D)$ . Is the canonical bundle of $\\mathcal M$ nef? Motivation : If we know the nefness of $\\mathcal M$ then due to a result of E.Viehweg, we can prove that $\\mathcal M$ is quasi-projective and its compactification $\\overline{\\mathcal M}$ is projective. Note: Georg Schumacher has another approach for it by uniruled method. sg.symplectic-geometry moduli-spaces kahler-manifolds kahler-einstein-metric projective-varieties Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Apr 16, 2016 at 8:55 user21574 $\\endgroup$ 3 1 $\\begingroup$ The very first example is when $X$ is a smooth, genus $2$ curve. Then the moduli space $\\mathcal{M}$ is a dense open subset of a rational threefold. What is your definition of \"nef\" if you allow the canonical bundle of an open subset of a rational threefold to be nef? $\\endgroup$ Jason Starr –  Jason Starr 2016-04-16 09:51:19 +00:00 Commented Apr 16, 2016 at 9:51 $\\begingroup$ Good example: A line bundle is nef (numerically effective)if the degree of its restriction to every algebraic curve in the variety is non-negative. $\\endgroup$ user21574 –  user21574 2016-04-16 09:54:29 +00:00 Commented Apr 16, 2016 at 9:54 $\\begingroup$ yes, certainly we must be in deal with an open dense subvariety, for nefness $\\endgroup$ user21574 –  user21574 2016-04-16 09:58:13 +00:00 Commented Apr 16, 2016 at 9:58 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Question feed",
  "tags": "sg.symplectic-geometry,moduli-spaces,kahler-manifolds,kahler-einstein-metric,projective-varieties",
  "scraped_at": "2026-01-14T04:13:54.888245",
  "answer": ""
}