{
  "id": "q_234899",
  "mathoverflow_id": 234899,
  "url": "https://mathoverflow.net/questions/234899/siegels-article-the-volume-of-the-fundamental-domain-for-some-infinite-groups",
  "title": "cv.complex variables - Siegel&#39;s article “The volume of the fundamental domain for some infinite groups”: trouble with understanding computations",
  "body": "This is the article I mentioned. While the idea of what Siegel is doing in order to compute the volume of the fundamental domain described in the article (the very first one, for there are discussed several domains) is clear, I do not quite understand how to prove some statements he makes about his computations, namely, on the page 3, the integral $$\\int_{F_{1}}{|X|^{\\frac{s}{2}-1} \\sum_{|K|=0} e^{-\\pi\\cdot tr(K'XK)} dX}$$ is proclaimed to be a regular function of $s$ near $s=1$ . (Siegel uses very specific notations, $|X|$ is the determinant, and $X'$ is $X$ transposed. $X$ is a positive definite real-valued symmetric matrix $n\\cdot n$ , $F_{1}$ is the part of the fundamental domain where $det(X)<1$ , $K$ is a matrix with integer entries.) I do not see why this is true and, being not very good at studying zeta and theta functions, I would welcome any help. If there is some profound knowledge concerning theta functions that might explain everything, please share! cv.complex-variables analytic-number-theory algebraic-number-theory theta-functions theta-series Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Mar 31, 2016 at 1:04 James 31 1 1 bronze badge $\\endgroup$ 2 $\\begingroup$ You should say how the fundamental domain is defined. $\\endgroup$ ThiKu –  ThiKu 2016-03-31 01:57:42 +00:00 Commented Mar 31, 2016 at 1:57 $\\begingroup$ @ThiKu, The fundamental domain corresponds to the group of all transformations $C'XC$ where $C$ is any unimodular matrix. $\\endgroup$ James –  James 2016-03-31 15:09:17 +00:00 Commented Mar 31, 2016 at 15:09 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions cv.complex-variables analytic-number-theory algebraic-number-theory theta-functions theta-series See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 130 What are the shapes of rational functions? 11 What's the difference between a Riemann theta and a Siegel theta function? 4 Are there cusp forms for the full modular group Sp(2,Z) and representations det^3 \\otimes Sym^2j(\\rho_standard) 30 On determinants of Laplacians on Riemann surfaces 15 How to interpret Gauss's late fragments on conformal mapping of the interior of an ellipse (to the unit disk) in modern mathematical terms? 8 The smallest volume possible for a lattice with integer distances? 0 Evaluating a matrix Pick function via its integral representation $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 234899, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "cv.complex-variables,analytic-number-theory,algebraic-number-theory,theta-functions,theta-series,cv.complex-variables,analytic-number-theory,algebraic-number-theory,theta-functions,theta-series",
  "scraped_at": "2026-01-14T04:13:52.662104",
  "answer": ""
}