{
  "id": "q_243233",
  "mathoverflow_id": 243233,
  "url": "https://mathoverflow.net/questions/243233/sufficient-condition-for-the-unique-solvability-of-dirichlet-problem-of-hamilton",
  "title": "fa.functional analysis - Sufficient condition for the unique solvability of Dirichlet problem of Hamilton-Jacobi equation",
  "body": "It shall be an old story in PDE. I am looking for a sufficient condition of Dirichlet problem for the existence of the unique viscosity solution of the equation in the form of $$\\inf_{a \\in [-1,1]} \\{b(a) \\cdot D u(x) + \\frac 1 2 tr (A(a) D^{2} u(x) )\\} + f(x) = 0, \\ \\forall x\\in O$$ with boundary condition $u = g$ on $\\partial O$. In particular, I want to explain the following two simple examples. [ex1] There is no solution for $$- u' + u - 1 = 0, \\ \\forall x\\in (-1,1) \\hbox{ with } u (\\pm 1) = 0.$$ Although $u(x) = 1 - e^{-1+x}$ is the unique solution of generalized Dirichlet problem according to the generalized definition of section 7 of [User's Guide by Crandall, Ishii, and Lions], it does not meet boundary data in the strong sense. END [ex2] One can check $u(x) = 1 - e^{-1+|x|}$ is the solution of $$- \\inf_{b\\in [-1,1]} b u' + u - 1 = 0, \\ \\forall x\\in (-1,1) \\hbox{ with } u (\\pm 1) = 0.$$ This equation also satisfies comparison principle, and hence it has unique solution. END [ex3] As of discussion by @Willis Wong below, there is no solution for $$- \\inf_{b\\in [-1,1]} b u' + u + 1 = 0, \\ \\forall x\\in (-1,1) \\hbox{ with } u (\\pm 1) = 0.$$ Indeed, all equations satisfy comparison principle. But first and last one have no solution, while second has unique one. According to Perron's method, the existence holds if one can construct sub and supersolution, but the sufficient condition of the existence is still left vague from Perron's method. [Q.] Is there any reference which can explicitly explain why the [ex1] and [ex3] have no solution but [ex2] does? It's more desirable if the sufficient condition works for the general equation with the second order term in the above. fa.functional-analysis pr.probability ap.analysis-of-pdes elliptic-pde viscosity-solutions Share Cite Improve this question Follow edited May 19, 2020 at 7:54 leo monsaingeon 5,285 2 2 gold badges 26 26 silver badges 51 51 bronze badges asked Jun 28, 2016 at 14:55 kenneth 1,439 14 14 silver badges 24 24 bronze badges $\\endgroup$ 15 $\\begingroup$ Regarding your tag choice: [ex1] is not elliptic in any way you look at it. The principal part of [ex2] is in fact just a complicated way to write $|u'|$ which I guess may be thought of as being elliptic due to coercivity? (Incidentally, do you really mean $-\\inf bu'$? Maybe you want it without the leading minus sign?) $\\endgroup$ Willie Wong –  Willie Wong 2016-06-28 15:45:55 +00:00 Commented Jun 28, 2016 at 15:45 $\\begingroup$ @WillieWong I am not familiar in PDE, so I am not confident. Anyway, by the definition of [User's guide], it may be regarded as elliptic, but degenerate. In [ex2], I do really mean $- \\inf b u'$, which is indeed $|u'|$ as you mentioned. But, the result is the same if the $\\inf$ is over $[-1, 2]$, by only changing a bit on explicit form of the solution. Thanks. $\\endgroup$ kenneth –  kenneth 2016-06-28 15:58:56 +00:00 Commented Jun 28, 2016 at 15:58 $\\begingroup$ @WillieWong I am also curious about the case without leading minus sign. I believe the unique solvability shall be true? $\\endgroup$ kenneth –  kenneth 2016-06-28 16:02:58 +00:00 Commented Jun 28, 2016 at 16:02 $\\begingroup$ Sorry, you are right about the minus sign. Mea culpa (I dropped a minus sign in checking your computations.) // I'll let someone more familiar with the method answer the technical part of your question. $\\endgroup$ Willie Wong –  Willie Wong 2016-06-28 16:03:33 +00:00 Commented Jun 28, 2016 at 16:03 $\\begingroup$ With the other sign the second equation has no (continuous) solutions. $|u'| \\geq 0$ but by boundary data assumption $u-1 < 0$ in a neighborhood of $\\pm1$. (In fact that's why I queried in my first comment; I've mistakenly thought you were in this case.) $\\endgroup$ Willie Wong –  Willie Wong 2016-06-28 16:09:58 +00:00 Commented Jun 28, 2016 at 16:09  |  Show 10 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions fa.functional-analysis pr.probability ap.analysis-of-pdes elliptic-pde viscosity-solutions See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 28 Why are viscosity solutions useful solutions? 3 Stability of Dirichlet data for Helmholtz equation 1 Sufficient condition of continuity of the expected stopping time 4 Uniqueness condition for Hamilton-Jacobi equation? 2 Existence of classical solution for a parabolic equation without Hölder continuity in time for its coefficients $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 243233, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "fa.functional-analysis,pr.probability,ap.analysis-of-pdes,elliptic-pde,viscosity-solutions,fa.functional-analysis,pr.probability,ap.analysis-of-pdes,elliptic-pde,viscosity-solutions",
  "scraped_at": "2026-01-14T04:14:06.121718",
  "answer": ""
}