{
  "id": "q_243970",
  "mathoverflow_id": 243970,
  "url": "https://mathoverflow.net/questions/243970/probability-for-a-srw-to-be-at-some-place-in-an-even-number-of-steps",
  "title": "reference request - Probability for a SRW to be at some place in an even number of steps",
  "body": "I am looking for some references for the following problem. Consider a graph $G$ and a simple continuous time random walk $(X_t)_{t\\geqslant 0}$ on this graph. Consider the family of events $(e_t)_{t\\geqslant 0}$ where $e_t$ is the event $\\{X_t$ has jumped an even number of times $\\}$ and the family $(o_t)_{t\\geqslant 0}$ the event for odd number of jumps. What is a sharp bound for the following quantity: $$G(x,t)=\\mathbb{P}_0(X_t=x\\cap e_t)-\\mathbb{P}_0(X_t=x\\cap o_t)$$ Where $\\mathbb{P}_0$ means the probability measure given that the random walk is starting from 0. Trivial examples: On $\\mathbb{Z}$ , if $x$ is at even distance of the origin then the walker had to make an even number of steps to be at that position at time $t$ and we have: $$G(x,t)=\\mathbb{P}_0(X_t=x\\cap e_t)=\\mathbb{P}_0(X_t=x)\\sim \\frac{1}{\\sqrt t}$$ If we add a loop with rate 1 on each site and $x$ at even distance of the origin then: $$G(x,t)= e^{-t} [\\cosh(t)\\mathbb{P}_0(X_t=x)-\\sinh(t)\\mathbb{P}_0(X_t=x)] = e^{-2t}\\mathbb{P}_0(X_t=x)$$ Less Trivial I am looking for references for this type of question for less trivial graph such as the triangular graph. For various reasons, in the triangular graph, it should look like: $$G(x,t) \\sim e^{-4t} \\mathbb{P}_0(X_t=x)$$ If you can prove it or provide me with some references, it would be much appreciated. PS: This question has been asked on Math StackExchange and it was advised to ask this here. reference-request pr.probability stochastic-processes random-walks Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jul 8, 2016 at 20:44 Salsifis 166 4 4 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request pr.probability stochastic-processes random-walks See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 9 Probability of return vs. probability of return in minimal number of steps 4 Transience of self avoiding random walks on $\\mathbb{Z}^d$ 4 Probability of a topologically non-trivial random walk on a finte torus 8 A discrete random walk that avoids previously visited vertices for an exponentially distributed time interval 6 Nonmonotonicity of expected distance of a random walk 3 Hitting probabilities for conditioned oriented random walk monotonic? 3 Walk with randomised boosts 4 Expected distance from the origin for a recurrent 1D random walk in a random environment 2 Occupation time of non-stationary random walk 0 How far does a random walker travel before returning to the origin? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 243970, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,pr.probability,stochastic-processes,random-walks,reference-request,pr.probability,stochastic-processes,random-walks",
  "scraped_at": "2026-01-14T04:14:08.388473",
  "answer": ""
}