{
  "id": "q_249752",
  "mathoverflow_id": 249752,
  "url": "https://mathoverflow.net/questions/249752/references-about-distances-between-singular-probability-measures",
  "title": "pr.probability - References about distances between singular probability measures",
  "body": "I would be interested in references on the topic of distances between probability measures that are singular with one another and not reduced to trivial ones. For example from here we know that total variation distance is not suitable for such a problem. In the end I am looking for a structure that would be fine enough to be able to address mutually singular Wiener measures in a non trivial way (for example it is well known that the Wiener measures associate with the two process driven by a BM are mutually singulars : $X^1_t =\\sigma_1.W_t$ and $X^2_t =\\sigma_2.W_t$, with $X^i_0=0, i=1,2$ as soon as $\\sigma_1\\not=\\sigma_2$ so finding a meaningful distance between those measures is a matter of interest for me). Best regards Note : This a re-post from MathstackExchange where no answers nor useful comments where posted, the subject might be advanced enough to be worthy of Mathoverflow. If you feel that it is not the case not a problem as long as you can post useful elements at the MSE post. Edit : I received an interesting idea from a contributor (Ilya who is also active on this forum) in the MSE post that I (tried to) developed there and which is elaborating on one of the metric (Wasserstein-Kantorovitch) pointed out in the article by Aryeh Kontorovich. reference-request pr.probability measure-theory stochastic-processes wiener-measure Share Cite Improve this question Follow edited Mar 9, 2019 at 17:12 YCor 67.5k 5 5 gold badges 203 203 silver badges 301 301 bronze badges asked Sep 13, 2016 at 8:44 The Bridge 1,334 1 1 gold badge 12 12 silver badges 21 21 bronze badges $\\endgroup$ 2 5 $\\begingroup$ Here's a decent start: math.hmc.edu/~su/papers.dir/metrics.pdf $\\endgroup$ Aryeh Kontorovich –  Aryeh Kontorovich 2016-09-13 10:19:09 +00:00 Commented Sep 13, 2016 at 10:19 2 $\\begingroup$ In particular, any of those metrics which induce the weak topology on the space of probability measures should give you what you desire: that the law of $X_t$ varies continuously with $\\sigma$. $\\endgroup$ Nate Eldredge –  Nate Eldredge 2016-10-03 17:56:15 +00:00 Commented Oct 3, 2016 at 17:56 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request pr.probability measure-theory stochastic-processes wiener-measure See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 2 measuring distance between probability measures only at the tail 1 Linear Maps between $L^1$-spaces of singular measures 5 Coupling of non-probability/sub-probability measures 3 A question about stochastic kernels and invariant measures 6 Contraction of probability measures 13 Random matrix with given singular values 6 Absolutely continuous coupling of probability measures $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 249752, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,pr.probability,measure-theory,stochastic-processes,wiener-measure,reference-request,pr.probability,measure-theory,stochastic-processes,wiener-measure",
  "scraped_at": "2026-01-14T04:14:17.331722",
  "answer": ""
}