{
  "id": "q_244635",
  "mathoverflow_id": 244635,
  "url": "https://mathoverflow.net/questions/244635/a-question-about-smooth-convex-lattice-polygons",
  "title": "nt.number theory - A question about smooth convex lattice polygons",
  "body": "Let $P$ be a smooth convex lattice polygon in $\\mathbb{R}^2$ (the lattice being $\\mathbb{Z}^2$ ). Here smooth means that at any vertex of $P$ , the two primitive integer vectors (i.e. vectors whose coordinates are coprime) directing the two edges generate the whole lattice, or in other words, the associated toric surface is smooth. Take a lattice point $M$ in the interior of $P$ . Is it always possible to find a boundary lattice point $B$ of $P$ which is at integer length $1$ of $M$ , i.e. such that the vector $MB$ is primitive? Is there also a toric interpretation of this property? If one removes the smoothness assumption, there are counter-examples. However, the answer is yes for many simple polygons (e.g. for the ones associated to $\\mathbb{C}P^2$ , the Hirzebruch surfaces, and some of their blow-ups). Edit: We were just given a counter-example by Christian Haase. Take the vectors v from the columns of 1 2 1 1 0 -1 0 1 1 2 1 1 and consider the zonotope of the segments [-v,v]. Then the origin cannot be joined to its boundary with a primitive vector. Let me refine the question by assuming moreover that the interior polygon $Q$ of $P$ is divisible by $2$ (i.e. its image by an homothetie of center one of its corners and rate $1/2$ is still a lattice polygon). Translate $P$ so that one of the corner of $Q$ is at the origin. Assume now that the coordinates of $M$ are both even. With all these assumptions, is it now possible to find a boundary point $B$ with the needed property? nt.number-theory co.combinatorics lattices toric-varieties Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jul 19, 2016 at 11:50 Rémi Cr. 113 4 4 bronze badges $\\endgroup$ 2 $\\begingroup$ @FriederLadisch Indeed, thank you for the remark! It is corrected. The integer length of a vector with integer coordinates is the gcd of its coordinates. So here, integer length $1$ is the same as coprime coordinates which is what I meant by primitive. $\\endgroup$ Rémi Cr. –  Rémi Cr. 2016-07-20 08:25:35 +00:00 Commented Jul 20, 2016 at 8:25 $\\begingroup$ Thanks for your answer. I was not familiar with this usage of \"integer length\", so I got confused, but it is clear now. $\\endgroup$ Frieder Ladisch –  Frieder Ladisch 2016-07-21 09:18:46 +00:00 Commented Jul 21, 2016 at 9:18 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions nt.number-theory co.combinatorics lattices toric-varieties See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 Intersection of curves on projective toric surface and some enumerative questions 4 Zoll Flat Finsler tori and convex bodies on a starry night 4 Can we count the number of integer lattice points in this case? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 244635, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "nt.number-theory,co.combinatorics,lattices,toric-varieties,nt.number-theory,co.combinatorics,lattices,toric-varieties",
  "scraped_at": "2026-01-14T04:14:10.635828",
  "answer": ""
}