{
  "id": "q_247891",
  "mathoverflow_id": 247891,
  "url": "https://mathoverflow.net/questions/247891/the-category-of-sets-and-stateful-functions",
  "title": "ct.category theory - The category of sets and &quot;stateful&quot; functions",
  "body": "In some programming languages, there's functions whose output can change on the basis of changing internal state; for example, the second time you compute $f(5)$ you might get a different answer. This doesn't really happen in mathematics. Nonetheless, I'd like to better understand the extent to which mathematics relies on the \"statelessness\" of mathematical functions. To this end, define: Definition 0. Given a set $X$ , view the Kleene closure $X^*$ as an $(\\mathbb{N},\\leq)$ presheaf as follows: $X^*(n) = \\{x \\in X^* \\mid \\mathrm{length}(x) = n\\} \\cong X^n$ If $\\varphi:a \\leq b$ , then $X^*(\\varphi) : X^*(b) \\rightarrow X^*(a)$ is the restriction map that takes the first $a$ -many letters of the word and deletes the rest. Definition 1. Given sets $X$ and $Y$ , a stateful function $X \\rightarrow Y$ is a natural transform $X^* \\rightarrow Y^*$ , where $X^*$ is the set of all words in $X$ . Write $\\mathbf{Set}^*$ for the category whose objects are sets and whose morphisms are stateful functions. My questions are whether or not this has been studied, and in particular, whether or not there is a sensible answer to the admittedly rather vague question: \"What is the internal logic of $\\mathbf{Set}^*$ ?\" ct.category-theory lo.logic ds.dynamical-systems computer-science Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Aug 20, 2016 at 7:11 goblin GONE 3,903 21 21 silver badges 41 41 bronze badges $\\endgroup$ 6 $\\begingroup$ As you admit yourself, the question is rather vague, so I don't know how to answer. Still, in case it helps to clarify something - your $\\mathbf{Set}^*$ seems to be isomorphic to the coKleisli category of the comonad structure on $\\_^*$, with $\\varepsilon(x_1,...,x_n)=x_n$ and $\\delta(x_1,...,x_n)=((x_1),...,(x_1,...,x_n))$. $\\endgroup$ მამუკა ჯიბლაძე –  მამუკა ჯიბლაძე 2016-08-20 07:53:46 +00:00 Commented Aug 20, 2016 at 7:53 $\\begingroup$ This seems to be essentially the theory of polymorphic list operations ---as in functional programming--- and there's a host of categorical results there. As for the internal logic, in computer science, lists are used as naive representations for relations and so looking in that direction may be fruitful. $\\endgroup$ Musa Al-hassy –  Musa Al-hassy 2016-08-20 18:51:49 +00:00 Commented Aug 20, 2016 at 18:51 $\\begingroup$ It is unclear what you mean by \"natural transform $X*\\to Y^*$\". Do you mean \"natural transformations between the functors from the functor $X\\mapsto X^*$ to $Y\\mapsto Y^*$? If yes, note that all pairs of sets $(X,Y)$ have the same hom-set. If no, what's a natural transform? $\\endgroup$ Thorsten –  Thorsten 2017-08-07 13:25:18 +00:00 Commented Aug 7, 2017 at 13:25 $\\begingroup$ And in programming, stateful functions are modelled using the Kleisli-Category of the state monad. $\\endgroup$ Thorsten –  Thorsten 2017-08-07 13:27:08 +00:00 Commented Aug 7, 2017 at 13:27 $\\begingroup$ $\\DeclareMathOperator\\Hom{Hom}$@Thorsten, I think I must misunderstand your [comment]( mathoverflow.net/questions/247891/… ). What does \"all pairs of sets $(X, Y)$ have the same hom-set\" mean? Surely $\\Hom_{\\mathbf{Set}}(\\emptyset, {*}) \\ne \\Hom_{\\mathbf{Set}}({*}, \\emptyset)$? $\\endgroup$ LSpice –  LSpice 2019-03-25 21:16:28 +00:00 Commented Mar 25, 2019 at 21:16  |  Show 1 more comment 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ct.category-theory lo.logic ds.dynamical-systems computer-science See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 9 Does equality between sets contradict the philosophy behind structural set theory? 7 How do we describe the right adjoint? 13 Elementary theory of the category of groupoids? 6 A possible alternative model for $\\infty$-groupoids 5 What are the 2-categorical mono/epimorphisms in the 2-category of relations? 13 What's the deal with De Morgan algebras and Kleene algebras? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 247891, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ct.category-theory,lo.logic,ds.dynamical-systems,computer-science,ct.category-theory,lo.logic,ds.dynamical-systems,computer-science",
  "scraped_at": "2026-01-14T04:14:15.117885",
  "answer": ""
}