{
  "id": "q_245285",
  "mathoverflow_id": 245285,
  "url": "https://mathoverflow.net/questions/245285/a-second-order-axiomatic-characterization-of-the-integers-which-rules-out-surr",
  "title": "lo.logic - A (second-order) axiomatic characterization of the integers which rules out surreal/hyperreal versions",
  "body": "I've seen it stated, for example here , that the integers are the unique commutative ordered ring with identity whose positive elements are well-ordered. I understand why the integers are the smallest such ring, (and thus the initial object in the category of rings, for example), but why must they be the only one? In particular, why can't we have a commutative ring based on some larger well-ordered set? In particular, there are the \"omnific integers\" sitting within the surreal numbers, and presumably some hyperreal version of this as well. What I have in mind is some version of the natural operations on the class of ordinals, extended suitably (by the Grothendieck group construction perhaps, if the surreal number version doesn't work) to include additive inverses. Why can't something like this work? (Before you complain and say that surreals aren't a set , preventing them from being a ring, let's say that we define \"the class of ordinals\" by some suitable large cardinal or Grothendieck universe or something similar.) EDIT As Wojowu pointed out in the comments, I'm probably over-thinking this: if $R$ is some commutative ordered ring whose positive elements are well-ordered, then there must be a map $f$ from $\\mathbb{N}$ to $R$ by recursion (or initial-object stuff). Then, the set $X$ of all $x \\in R$ which are greater than $f(n)$ for all $n \\in \\mathbb{N}$ is either empty (in which case it's not hard to verify that $\\mathbb{Z} \\simeq R$ ), or has a least element $x$ . Then $x -1 < x$ , so we have a contradiction. Maybe there is a set vs. class subtlety here? If we take the actual class of all ordinals, then $X$ won't be a set, so we need well-ordering for sub-classes . What happens if we only assume well-ordering for subsets ? Does this sort of ambiguity ever matter, or are the integers really that unique? lo.logic model-theory surreal-numbers Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jul 28, 2016 at 5:44 dorebell 3,148 17 17 silver badges 34 34 bronze badges $\\endgroup$ 4 8 $\\begingroup$ If an ordered ring contains $\\Bbb Z$ properly, then it contains either an element $\\varepsilon$ between $0$ and $1$, in which case the elements $\\varepsilon,\\varepsilon^2,\\varepsilon^3,\\dots$ are positive elements and there is no smallest element of this set, or it contains an infinite positive element $\\omega$, in which case you can take $\\omega,\\omega-1,\\omega-2,\\dots$ for the same purpose. $\\endgroup$ Wojowu –  Wojowu 2016-07-28 06:03:54 +00:00 Commented Jul 28, 2016 at 6:03 4 $\\begingroup$ As for your last question, my above remark works for class-sized rings as well. $\\endgroup$ Wojowu –  Wojowu 2016-07-28 06:09:02 +00:00 Commented Jul 28, 2016 at 6:09 1 $\\begingroup$ good point! If you'd like to put that up as an answer, I'd be happy to accept. $\\endgroup$ dorebell –  dorebell 2016-07-28 06:27:27 +00:00 Commented Jul 28, 2016 at 6:27 2 $\\begingroup$ @dorebell: the issue with the example of ordinals isn't a set vs. class issue, it's that, as Wojowu's argument shows, requiring additive inverses breaks the well-ordering property. $\\endgroup$ Qiaochu Yuan –  Qiaochu Yuan 2016-07-28 08:55:41 +00:00 Commented Jul 28, 2016 at 8:55 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions lo.logic model-theory surreal-numbers See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 23 Axiomatic definition of integers Related 24 Can we axiomatize Omnific Integers without the Surreal Number system? 25 Surreal exponentiation -- are the varying definitions equivalent? If not, is there agreement on which ones are better? 5 Definable map from all the ordinals to the surreal numbers with a dense image? 32 Are Conway's omnific integers the Grothendieck group of the ordinals under commutative addition? 10 Transcendence degree of the surreals over the subfield generated by the ordinals 18 Nice sign-expansions of special surreal numbers 3 Smallest ring whose field of fractions includes all the reals (subring of omnific integers?) 9 A \"surnatural numbers\" as a largest model of the natural numbers $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 245285, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "lo.logic,model-theory,surreal-numbers,lo.logic,model-theory,surreal-numbers",
  "scraped_at": "2026-01-14T04:14:12.874498",
  "answer": ""
}