{
  "id": "q_242701",
  "mathoverflow_id": 242701,
  "url": "https://mathoverflow.net/questions/242701/construction-of-model-of-arithmetic-from-an-arbitrary-model",
  "title": "lo.logic - Construction of model of arithmetic from an arbitrary model",
  "body": "Let $M$ be a non-standard model of $PA$ , $a\\in |M|$ be an arbitrary non-standard number and $T$ be a theory of arithmetic. We want to choose a subset $M'\\subsetneq M$ such that: $M'\\models PA^-$ (or $Q$ ) $a\\not \\in |M'|$ there exists $b\\in M'$ such that $M\\models a<b$ $M'\\models T$ Q1. For which $M\\models PA$ , $a\\in M$ , and $T$ we can find a subset $M'$ satisfies above conditions? Q2. For which $T$ is it true that: for every model $M\\models PA$ , for every nonstandard $a \\in M$ , there exists $M'$ satisfies above conditions? Thanks. lo.logic model-theory peano-arithmetic Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jun 20, 2016 at 22:07 Erfan Khaniki 1,709 1 1 gold badge 11 11 silver badges 17 17 bronze badges $\\endgroup$ 13 3 $\\begingroup$ If you take for $a$ a (parameter-free) $\\Delta_0$-definable element of $M$, the conditions imply that $M'$ is not a $\\Delta_0$-elementary submodel of $M$, hence it cannot satisfy the formalized MRDP theorem. That is, this property is false for any theory $T\\supseteq I\\Delta_0+\\mathit{EXP}$. $\\endgroup$ Emil Jeřábek –  Emil Jeřábek 2016-06-20 22:50:56 +00:00 Commented Jun 20, 2016 at 22:50 $\\begingroup$ @EmilJeřábek: Thank you for your comment. What about weaker theories like $I\\Delta_0$ or even weaker like $IE_1$? (I edited my post as you suggested.) $\\endgroup$ Erfan Khaniki –  Erfan Khaniki 2016-06-21 00:05:12 +00:00 Commented Jun 21, 2016 at 0:05 2 $\\begingroup$ @EmilJeřábek Could you explain your comment? In a nonstandard model of true arithmetic, for example, which extends that theory, there are no such definable nonstandard elements. $\\endgroup$ Joel David Hamkins –  Joel David Hamkins 2016-06-21 00:32:38 +00:00 Commented Jun 21, 2016 at 0:32 $\\begingroup$ But meanwhile, the theory TA of true arithmetic does not have the desired property, because of Gaifman's theorem on minimal extensions. That is, there is a minimal extension of the standard model, which would violate the desired properties. $\\endgroup$ Joel David Hamkins –  Joel David Hamkins 2016-06-21 01:12:54 +00:00 Commented Jun 21, 2016 at 1:12 $\\begingroup$ @Joel I read the question as \"for which theories T is it true that: for every model M of PA, for every nonstandard a in M, there exists M' etc.\" So, my argument works as long as there exists at least one model of PA with a nonstandard $\\Delta_0$-definable element, which it does. The existence of other models without such elements is irrelevant. $\\endgroup$ Emil Jeřábek –  Emil Jeřábek 2016-06-21 08:28:13 +00:00 Commented Jun 21, 2016 at 8:28  |  Show 8 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions lo.logic model-theory peano-arithmetic See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 9 Essential incompleteness via diophantine formulas? Related 2 \"standard system\" of a nonstandard model of PA, interpreted in ZFCfin? 9 Incompleteness and nonstandard models of arithmetic 6 How many models of Peano arithmetic are isomorphic to the standard model and how many models of Peano arithmetic are non-standard? 9 Is a model of arithmetic contained in a model of arithmetic an initial segment? 16 Is there a nonstandard model of arithmetic having precisely one inductive truth predicate? 7 Finding a PA cut in a nonstandard model of PA 19 Existence of a model of ZFC in which the natural numbers are really the natural numbers $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 242701, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "lo.logic,model-theory,peano-arithmetic,lo.logic,model-theory,peano-arithmetic",
  "scraped_at": "2026-01-14T04:14:03.873157",
  "answer": ""
}