{
  "id": "q_241921",
  "mathoverflow_id": 241921,
  "url": "https://mathoverflow.net/questions/241921/yoneda-embedding-and-horn-sentences",
  "title": "lo.logic - Yoneda embedding and Horn sentences",
  "body": "The following is taken from Borceux and Bourn's Mal'cev, Protomodular, Homological, and Semi-Abelian Categories . Metatheorem 0.1.3. Let $\\mathcal P$ be a statement of the form $\\varphi\\implies \\psi$ , where $\\varphi$ and $\\psi$ can be expressed as conjunctions of properties in the following list: some finite diagram is commutative; some morphism is a monomorphism; some morphism is an isomorphism; some finite diagram is a limit diagram; an arrow $f:\\rightarrow B$ factors (of course, uniquely) through some specified monomorphism $s:S\\rightarrowtail B$ . If this statement is valid in the category of sets, it is valid in every category. After the proof comes the following remark. It is probably useful to make a comment. The list of properties in our metatheorem is not exhaustive. A better way to express the metatheorem would have been to state it for Horn sentences and the \"unique existential quantifier $\\exists!$ \", but we do not want to enter those considerations here. I tried googling 'Yoneda embedding horn sentence' but didn't find anything I thought was relevant. What is the \"better way to express the metatheorem\", and why is it true? I'm guessing some topos theory comes in, but I don't really know anything about (the logical aspect of) it. lo.logic topos-theory limits-and-colimits representable-functors yoneda-lemma Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jun 11, 2016 at 10:12 Arrow 10.7k 1 1 gold badge 29 29 silver badges 73 73 bronze badges $\\endgroup$ 13 $\\begingroup$ The unstated metatheorem is true because the Yoneda embedding preserves all limits and is fully faithful. Every one of the explicit examples listed can be proved using that fact, and many more besides. $\\endgroup$ Zhen Lin –  Zhen Lin 2016-06-11 12:43:57 +00:00 Commented Jun 11, 2016 at 12:43 $\\begingroup$ @ZhenLin those are the properties I do know, but I don't know how they interact with Horn sentences. Could you briefly explain what Horn sentences are and why the interact well with limit preserving fully faithful functors? $\\endgroup$ Arrow –  Arrow 2016-06-11 12:50:28 +00:00 Commented Jun 11, 2016 at 12:50 $\\begingroup$ Horn sentences are, roughly speaking, a logical way of thinking about finite limits. $\\endgroup$ Zhen Lin –  Zhen Lin 2016-06-11 13:12:05 +00:00 Commented Jun 11, 2016 at 13:12 $\\begingroup$ @ZhenLin could you recommend a light, category-oriented introduction to the topic? $\\endgroup$ Arrow –  Arrow 2016-06-11 13:17:51 +00:00 Commented Jun 11, 2016 at 13:17 $\\begingroup$ Not really. But you can find it in [ Sketches of an elephant , Part D]. $\\endgroup$ Zhen Lin –  Zhen Lin 2016-06-11 13:24:14 +00:00 Commented Jun 11, 2016 at 13:24  |  Show 8 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions lo.logic topos-theory limits-and-colimits representable-functors yoneda-lemma See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 10 Subcategories which still give a Yoneda embedding 1 Is Mumford's statement about the representability of some functor wrong? 1 Yoneda Embedding and pull back 6 Yoneda map for a composition of a representable functor and an arbitrary functor 1 Yoneda lemma for one object categories 11 Do all toposes satisfy the internal Zorn's lemma? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 241921, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "lo.logic,topos-theory,limits-and-colimits,representable-functors,yoneda-lemma,lo.logic,topos-theory,limits-and-colimits,representable-functors,yoneda-lemma",
  "scraped_at": "2026-01-14T04:14:01.622257",
  "answer": ""
}