{
  "id": "q_253402",
  "mathoverflow_id": 253402,
  "url": "https://mathoverflow.net/questions/253402/two-hilbert-g-bundles-are-isomorphic-iff-the-representations-of-the-little-gro",
  "title": "rt.representation theory - Two Hilbert $G$-bundles are isomorphic iff the representations of the little group are equivalent",
  "body": "While reading Mackey's \"Unitary Group Representations in Physics, Probability and Number Theory\", at page 66 I encountered the following statement (my reformulation): if $\\mathcal K$ and $\\mathcal K'$ are two $G$ -bundles over the same base $S$ (on which $G$ acts transitively) and if $H \\le G$ is the stabilizer subgroup of some $s_0 \\in S$ , and if $L, L'$ are the representations of $G$ in $L^2 (S, \\mathcal K, \\mu)$ and, respectively, $L^2 (S, \\mathcal K', \\mu)$ , naturally induced by the actions of $G$ on $\\mathcal K$ and $\\mathcal K'$ , then: $$\\mathcal K \\simeq \\mathcal K' \\iff L \\Big| _H \\simeq L' \\Big| _H$$ (i.e. the bundles are isomorphic if and only if the restrictions of the natural representations are unitarily equivalent). Mackey gives no proof, and I've lost myself in it. For the direct implication, I tried to proceed like this: if $\\alpha : \\mathcal K \\to \\mathcal K'$ is the isomorphism, letting $\\alpha_0 : S \\to S$ denote its natural restriction on the base $S$ allows us to define $U^s : \\mathcal K _s \\to \\mathcal K _{s \\alpha_0}$ by $(s, v) \\alpha = (s \\alpha_0, U^s v)$ (Mackey writes the actions and the isomorphism to the right); this then allows us to define $U : L^2 (S, \\mathcal K, \\mu) \\to L^2 (S, \\mathcal K ', \\mu)$ by $U (\\varphi) (s) = U^{s \\alpha_0 ^{-1}} (\\varphi (s \\alpha_0 ^{-1}))$ . The trouble is that this $U$ turns out not to be good for what I want to prove, and I can't think of anything else. For the converse, it's even worse: the fact that those two representations are equivalent gives a unitary transformation between sections, but how does that allow me to get an isomorphism between the bundles? Where do I use the transitivity of the actions, and how do I use that $H$ stabilizes $s_0$ ? There is also the possibility that I have misunderstood Mackey's statement, since it is given in prose. For the converse, it is not clear whether $G$ acts on the bundles and we speak of the restrictions to $H$ of its natural representations, or if I consider $H$ to act on the bundles and then consider its natural representations, in which case there is no need to restrict anything anymore. rt.representation-theory vector-bundles topological-groups group-actions unitary-representations Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Oct 29, 2016 at 19:04 Alex M. 5,517 11 11 gold badges 39 39 silver badges 56 56 bronze badges $\\endgroup$ 5 $\\begingroup$ The statement in grey is wrong. Take for example $H$ which is normal in $G$ and not of finite index. Take two representations of $H$, the one dimensional trivial and the infinite dim trivial. Induce both to $K$ and $K'$ respectively. You get different Hilbert bundle, but $L|_H$ and $L'|_H$ both will be infinite dim trivial. $\\endgroup$ Uri Bader –  Uri Bader 2016-10-30 07:08:39 +00:00 Commented Oct 30, 2016 at 7:08 $\\begingroup$ I don't have Macky's book at hand, but I suppose he relates the Hilbert bundle with the rep of $H$ on the fiber over $s_0$, not with the restriction of $L$. $\\endgroup$ Uri Bader –  Uri Bader 2016-10-30 07:10:30 +00:00 Commented Oct 30, 2016 at 7:10 $\\begingroup$ @UriBader: You might be right. The book that I am reading is written mostly in prose, without proofs, in an attempt to give a conceptual, non-technical overview of the subject. This is why some statements, given somewhat informally, are ambiguous, leaving much to the interpretation of the reader. $\\endgroup$ Alex M. –  Alex M. 2016-10-30 07:16:13 +00:00 Commented Oct 30, 2016 at 7:16 $\\begingroup$ How long is this \"prose\" part? What about pasting it in, instead of speculating? $\\endgroup$ Uri Bader –  Uri Bader 2016-10-30 07:53:53 +00:00 Commented Oct 30, 2016 at 7:53 $\\begingroup$ @UriBader: I have reread that part with your interpretation in mind, and yes, it seems to make sense. Let me see whether I can do it by myself now. $\\endgroup$ Alex M. –  Alex M. 2016-10-30 10:43:31 +00:00 Commented Oct 30, 2016 at 10:43 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions rt.representation-theory vector-bundles topological-groups group-actions unitary-representations See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 44 How to think about parabolic induction. 5 The equivalence of category of equivariant sheaves on principal bundle and category of sheaves on base space 10 Which groups can be recovered from their unitary dual? 9 Are the reduced group Von Neumann algebra/ Group $C^{\\ast}$ algebra functorial in the case of LCH groups 3 On an example by Romagny about fixed point stack not commuting with coarse moduli space 3 On a result of Sir Michael Atiyah \"Vector bundles on Elliptic curves\" Theorem 2 Page 426 5 Are there Mackey decompositions for closed subgroups of profinite groups? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 253402, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "rt.representation-theory,vector-bundles,topological-groups,group-actions,unitary-representations,rt.representation-theory,vector-bundles,topological-groups,group-actions,unitary-representations",
  "scraped_at": "2026-01-14T04:14:19.560583",
  "answer": ""
}