{
  "id": "q_258144",
  "mathoverflow_id": 258144,
  "url": "https://mathoverflow.net/questions/258144/mean-and-variance-of-sde",
  "title": "stochastic processes - Mean and Variance of SDE",
  "body": "What is the mean and the variance of $y_t$ , given the following SDE: $dy_t = -x_t y_t dt + \\sigma_1 dW^1_t$ $dx_t = -\\sigma_2 y_t dW^2_t$ $W^1$ and $W^2$ are (possibly correlated) Wiener processes. stochastic-processes stochastic-calculus stochastic-differential-equations Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Dec 27, 2016 at 19:37 Posch79 111 1 1 bronze badge $\\endgroup$ 1 $\\begingroup$ Call the correlation of the two Wiener processes $\\rho$. $\\endgroup$ Posch79 –  Posch79 2016-12-27 21:27:07 +00:00 Commented Dec 27, 2016 at 21:27 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions stochastic-processes stochastic-calculus stochastic-differential-equations See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 1 Mixing the Ornstein-Uhlenbeck Process and Geometric Brownian Motion 4 Almost sure stability of a scalar, nonautonomous, nonlinear SDE 1 Can derivatives of 2 stochastic processes be multiplied? 6 Conditioning an SDE on the event that the driving noise is small 1 Is there an inverse Lamperti transformation for diffusions? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 258144, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "stochastic-processes,stochastic-calculus,stochastic-differential-equations,stochastic-processes,stochastic-calculus,stochastic-differential-equations",
  "scraped_at": "2026-01-14T04:14:26.357945",
  "answer": ""
}