{
  "id": "q_265572",
  "mathoverflow_id": 265572,
  "url": "https://mathoverflow.net/questions/265572/principal-bundle-a-criterion",
  "title": "ag.algebraic geometry - Principal bundle: A criterion",
  "body": "I am referring to page 300 of Okonek et al. book \"Vector Bundles on Complex Projective Spaces\" (1988.) Let $G=GL_n(\\mathbb{C})$ act holomorphically and freely on a complex manifold $X$ . Define the mapping $\\gamma:X\\times G\\longrightarrow X\\times X$ by sending $(x,g)$ to $(x,gx)$ . Given that $\\gamma$ is an isomorphism onto a closed analytic subspace of $X\\times X$ , Why is $X/G$ also a complex manifold? Why is $X\\rightarrow X/G$ a $G$ -principal bundle (in the complex analytic category)? Apparently, this result can be found in the two papers: Holmann, H.: Komplexe Raume mit komplexen Transformationsgruppen. Math Ann. 150, 1963 (p.359), Holmann, H.: Quotienten komplexer Raume. Math Ann 142, 1961 (p.433.) However, Germans is so hard for me and I would like to understand at least the rough idea. My feeling is that this should be something standard nowadays? I know the condition on the image of $\\gamma$ is basically to ensure separatedness/Hausdorffness of $X/G$ so maybe the first question is not hard but for the second question I really have no idea. ag.algebraic-geometry complex-geometry lie-groups principal-bundles Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Mar 26, 2017 at 2:12 HLC 307 1 1 silver badge 5 5 bronze badges $\\endgroup$ 2 3 $\\begingroup$ If you prefer French (resp. English) see Prop. 10, section 1.5, Chapter III of Bourbaki's Groupes et Alg`ebres de Lie (resp. Lie groups and Lie algebras ) for such an action by any real or complex Lie group; also see Prop. 13 there. Also see section 12 in Chapter III of Part II of Serre's book \"Lie groups and Lie algebras\" (Springer LNM 1500) for a wider context (also treated elsewhere in Bourbaki). $\\endgroup$ nfdc23 –  nfdc23 2017-03-26 02:39:50 +00:00 Commented Mar 26, 2017 at 2:39 2 $\\begingroup$ Since the $G$-action on $X$ is free, the quotient $X/G$ is a complex manifold [see Complex Tori and Abelian Varieties, by Olivier Debarre, page 75]. Since the $G$-action preserves the fibers of $X/G$, $X\\rightarrow X/G$ is a principal $G$-bundle. $\\endgroup$ Mee Seong Im –  Mee Seong Im 2017-03-26 03:56:17 +00:00 Commented Mar 26, 2017 at 3:56 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry complex-geometry lie-groups principal-bundles See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 Principal bundle connections 3 Lie algebra version of principal bundle? 5 Semistability of principal bundle vs vector bundle 4 Quotient of complex manifold by a free and locally proper action (difficulty with reading German) 3 Global trivialization of a Principal G bundle 11 Motivation for construction of associated fiber bundle from a principal bundle 2 Holomorphic local trivialization of a principal toric bundle 1 Universal principal bundle on stack $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 265572, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,complex-geometry,lie-groups,principal-bundles,ag.algebraic-geometry,complex-geometry,lie-groups,principal-bundles",
  "scraped_at": "2026-01-14T04:14:53.300619",
  "answer": ""
}