{
  "id": "q_261179",
  "mathoverflow_id": 261179,
  "url": "https://mathoverflow.net/questions/261179/recursive-method-to-construct-self-dual-codes",
  "title": "co.combinatorics - Recursive method to construct self-dual codes",
  "body": "I'm looking for the recursive methods of constructing self-dual binary codes. Recently, I found an interesting way to constructing such codes here . In this method, by using $[2n,n,d]$ self-dual code, we can construct the $[2(n+1),n+1,d']$ self-dual code. I constructed thousands of these binary self-dual codes, but I saw that $d' \\leq d$ . Now my question is: Can we find some codes with this method such that $d'>d$ ? Or, Are there exist another methods to construct $[2(n+1),n+1,d']$ self-dual code from $[2n,n,d]$ self-dual code such away that $d'>d$ ? co.combinatorics coding-theory Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Feb 2, 2017 at 12:31 Meysam Ghahramani 507 3 3 silver badges 19 19 bronze badges $\\endgroup$ 2 1 $\\begingroup$ Just a comment, Patrick Sole might be a good person to email and ask. $\\endgroup$ kodlu –  kodlu 2017-02-17 23:10:06 +00:00 Commented Feb 17, 2017 at 23:10 $\\begingroup$ @kodlu, Thanks for your comment. I asked him. $\\endgroup$ Meysam Ghahramani –  Meysam Ghahramani 2017-02-20 21:37:22 +00:00 Commented Feb 20, 2017 at 21:37 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions co.combinatorics coding-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 7 request sources about self-dual cyclic codes 5 Balanced binary code that \"resists\" local decoding? 2 Need help with paper written in Russian... Yorgov's paper on self-dual codes with automorphisms of odd order 4 Self-dual binary codes of Hamming weight divisible by 8? 4 Binary linear codes, juxtaposition and similarity 8 Are there Type III codes with small but nonzero \"index\"? 2 Perfect 1 error correcting codes non-isomorphic to Hamming codes? 1 Method of constructing nonlinear codes. Nordstrom-Robinson code and its shortened versions $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 261179, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "co.combinatorics,coding-theory,co.combinatorics,coding-theory",
  "scraped_at": "2026-01-14T04:14:30.823902",
  "answer": ""
}