{
  "id": "q_262938",
  "mathoverflow_id": 262938,
  "url": "https://mathoverflow.net/questions/262938/constructing-graphs-from-subsets-of-a-minimal-alphabet",
  "title": "reference request - Constructing graphs from subsets of a minimal alphabet",
  "body": "From an alphabet of $N$ letters, choose $n$ pairwise distinct subsets $ v_1,\\dots,v_n$ of a fixed size $k$ and define a graph on $V=\\{v_1,\\dots,v_n\\}$ , which has an edge for each pair of vertices that have no letters in common. For the occasion, we'll call such a graph a subset graph (knowing that usually the term is used in a different sense). Special cases would be the Kneser graphs , where $V$ is the complete set of $k$ -subsets. Obviously any finite simple graph can be realized as a subset graph if only we make $N$ big enough, maybe even $N>n$ . So it makes sense to define for a given graph $G$ its \" lexicalicity \" $\\ell(G)$ as the smallest possible such $N$ . I am not sure whether it is useful to also define the \"subset cardinality\" $sc(G)$ as the smallest possible $k$ in such a construction, as that might be at the expense of $N$ becoming much bigger than $\\ell(G)$ , which would (intuitively) make the structure less interesting. Question: Are there classes of graphs for which a construction featuring $\\ell(G)$ also features $sc(G)$ ? I am only interested in regular graphs here and guess anyway that the higher the \"symmetry\" of $G$ , the smaller $\\ell(G)$ and $sc(G)$ . The idea is in fact inspired by the construction mentioned here . I am probably not the first person thinking about that, so I'll ask first what is known about $\\ell(G)$ . In particular: What about $\\ell(G)$ if $G$ is the complement of a Kneser graph? For a strongly regular graph $G$ , is $\\ell(G)$ bounded in terms of its parameters? (Or can it even be derived from the parameters?) reference-request co.combinatorics graph-theory extremal-graph-theory Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Feb 23, 2017 at 14:39 Wolfgang 13.6k 5 5 gold badges 49 49 silver badges 108 108 bronze badges $\\endgroup$ 4 $\\begingroup$ In a $d$-regular graph $G$, you can use $E(G)$ as the alphabet to demonstrate that $sc(G) \\leq d$ and $\\ell(G) \\leq |E(G)|$. I think both bounds are tight if $G$ is triangle-free. $\\endgroup$ D. Ror. –  D. Ror. 2017-02-24 16:11:39 +00:00 Commented Feb 24, 2017 at 16:11 $\\begingroup$ @DannyRorabaugh You can do a cube graph with 8 letters: 123 - 456 - 457 - 458 -126 - 127 - 128 - 345. So at least here $\\ell(G) \\leq |V(G)|$. $\\endgroup$ Wolfgang –  Wolfgang 2017-02-24 16:50:53 +00:00 Commented Feb 24, 2017 at 16:50 $\\begingroup$ Oops, I was thinking of connecting subsets that DO have a letter in common. Never mind. $\\endgroup$ D. Ror. –  D. Ror. 2017-02-24 17:18:53 +00:00 Commented Feb 24, 2017 at 17:18 $\\begingroup$ The case @DannyRorabaugh mentioned is known as the intersection number. There is also another related problem, where there is an edge iff the corresponding sets overlap (i.e., intersect but are not strictly contained in each other). $\\endgroup$ Vinicius dos Santos –  Vinicius dos Santos 2017-03-23 12:36:32 +00:00 Commented Mar 23, 2017 at 12:36 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request co.combinatorics graph-theory extremal-graph-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 14 Bipartite graphs arising from two $k$-partitions of a given graph 5 irregular pairs in half graphs - Szemeredi regularity 4 Smallest pair of non-isomorphic graphs equivalent under the Weisfeiler-Leman algorithm 1 Existence of a strongly regular vertex ordering on cubic graphs 3 Free partially commutative monoid and the subset of the edge set $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 262938, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,co.combinatorics,graph-theory,extremal-graph-theory,reference-request,co.combinatorics,graph-theory,extremal-graph-theory",
  "scraped_at": "2026-01-14T04:14:37.606476",
  "answer": ""
}