{
  "id": "q_263311",
  "mathoverflow_id": 263311,
  "url": "https://mathoverflow.net/questions/263311/what-do-the-components-of-the-global-nilpotent-cone-look-like",
  "title": "ag.algebraic geometry - What do the components of the global nilpotent cone look like?",
  "body": "Let $C$ be an algebraic curve. Let $H_C(n,d)$ be the moduli space of rank $n$ and degree $d$ semistable Higgs bundles. Recall the Hitchin fibration -- the map associating a Higgs bundle to its spectral curve -- $h: H_C(n,d) \\to A$ , and the global nilpotent cone $h^{-1}(0)$ . This contains as a component the moduli space of semistable bundles (when the Higgs field is zero) but also many other components (when the Higgs field is nilpotent but nonzero). If say (n,d) are coprime, then all semistables are stable and $H_c(n,d)$ is smooth; and the same holds for the same reason for the component of the nilpotent cone which is the moduli of bundles. Each of the other components is the stable manifold of some $\\mathbb{C}^*$ fixed locus, thus has an open subset which is a vector bundle over a smooth space. To be clear, I am interested in the closures of these vector bundles. Can these other components also be described as moduli spaces of bundles with extra structure? In terms of the combinatorial data, which ones appear? Are they also smooth? If not, what are their singularities? The nilpotent cone is Lagrangian. Thus the neighborhood of a smooth component will be symplectomorphic to its cotangent bundle. In this description, do the other components which meet it arrive as conormals to some strata (which themselves have some modular description?) ag.algebraic-geometry Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Feb 28, 2017 at 6:45 Vivek Shende 8,903 4 4 gold badges 40 40 silver badges 71 71 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 12 Hitchin fibration and Springer resolution Related 34 What is the precise statement of the correspondence between stable Higgs bundles on a Riemann surface, solutions to Hitchin's self-duality equations on the Riemann surface, and representations of the fundamental group of the Riemann surface? 9 Higgs bundles and stable vector bundle 4 Properness of moduli space 10 Interesting geometric application of Hitchin Fibration 8 Moduli of stable and semistable $G$-Higgs bundles on curves $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 263311, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,ag.algebraic-geometry",
  "scraped_at": "2026-01-14T04:14:42.088575",
  "answer": ""
}