{
  "id": "q_264968",
  "mathoverflow_id": 264968,
  "url": "https://mathoverflow.net/questions/264968/conditions-on-a-quillen-functor-so-that-its-comonad-is-homotopy-full",
  "title": "reference request - Conditions on a Quillen functor so that its comonad is homotopy-full",
  "body": "I am looking for an answer to the following question: Let $F : {\\cal C} \\to {\\cal D}$ be a left Quillen functor between combinatorial model categories; let $\\tilde F \\dashv \\tilde G$ be the induced adjunction between the homotopy categories. Which assumptions[1] on $F$ ensure that the comonad $\\tilde F\\tilde G : {\\sf Ho}({\\cal D})\\to {\\sf Ho}({\\cal D})$ is a full functor? [1] I already know that $F=1$ works. :-) reference-request ct.category-theory model-categories Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Mar 18, 2017 at 14:59 fosco 14.2k 2 2 gold badges 32 32 silver badges 87 87 bronze badges $\\endgroup$ 0 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request ct.category-theory model-categories See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 14 Does the right adjoint of a Quillen equivalence preserve homotopy colimits? 9 Homotopy left-exactness of a left derived functor 17 Do combinatorial model categories and Quillen adjunctions model presentable $\\infty$-categories? 1 left quillen functor and fibrant objects 7 Is the Thomason model structure the optimal realization of Grothendieck's vision? 4 Quillen pairs / $\\infty$-adjunctions / adjunctions of homotopy categories $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 264968, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,ct.category-theory,model-categories,reference-request,ct.category-theory,model-categories",
  "scraped_at": "2026-01-14T04:14:48.804898",
  "answer": ""
}