{
  "id": "q_265997",
  "mathoverflow_id": 265997,
  "url": "https://mathoverflow.net/questions/265997/forgetful-determinacy-and-gale-stewart-theorem",
  "title": "descriptive set theory - Forgetful Determinacy and Gale-Stewart theorem",
  "body": "I have been studying a 1969 article by Rabin that proofs his apparently very influential Tree Theorem (that says the monadic second-order theory of 2 successors, S2S, is decidable). To give a bit of context: the proof is focused around automata on infinite trees, and his basic idea is to construct an automaton $\\mathcal A_\\phi$ for each sentence $\\phi$ of S2S representing it. This is done inductively on the structure of a formula, and thus to do this, we need to see that we can construct automata that represent the union or intersection of two automata (for $\\vee$ and $\\wedge$ ), and the complement and projection of an automaton (for $\\neg$ and $\\exists$ ). Then it is shown that a sentence $\\phi$ is true iff $\\mathcal A_\\phi$ accepts at least one tree (that is, $T(\\mathcal A_\\phi)$ , the set of tree accepted by $\\mathcal A_\\phi$ is non-empty). To prove the negation and emptiness parts of this proof, I have read an article of Thomas (Languages, Automata, and Logic, ch.6, 1997). In his paper, he views runs of an automaton as games, and negation and emptiness follow from a certain determinacy theorem. This approach follows (Gurevich and Harrington, 1982). The determinacy theorem stated by Thomas is the following: Theorem. (Determinacy of Rabin chain tree automata games) In the game $\\Gamma_{\\mathcal A,t}$ based on a Rabin chain tree automaton $\\mathcal A$ and a tree $t$ , from any game position, either player 0 (Automaton) or player 1 (Pathfinder), has a memoryless winning strategy . This theorem seems to come from Gurevich and Harrington, who in their paper prove a Forgetful Determinacy Theorem . Now my question is about this determinacy result. It reminds something of Gale-Stewart games and their theorem. Now I am not yet very familiar with Gale-Stewart games and descriptive set theory, but I am wondering: Question. Is there a link between the Determinacy Theorem by Thomas or Gurevich and Harrington and the Gale-Stewart Theorem? Can one be proven using the other, can we alter circumstances to see some equivalence, etc. So basically: (How) are the results related? descriptive-set-theory game-theory determinacy Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Mar 31, 2017 at 9:54 konewka 171 3 3 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions descriptive-set-theory game-theory determinacy See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 3 Related Open Game in Analytic Determinacy 5 Games of imperfect information (e.g. Blackwell's games) in Set Theory? 12 Coding a model of $0^\\sharp$ from a $\\Pi^1_1$ Gale-Stewart game 11 Is determinacy on an infinite Dedekind finite set consistent? 7 On the topological complexity of the set of winning strategies for Gale-Stewart Games 11 The Axiom of Determinacy and the Banach-Mazur game 7 How complicated are 3-player clopen determinacy facts? 15 Examples of concrete games to apply Borel determinacy to $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 265997, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "descriptive-set-theory,game-theory,determinacy,descriptive-set-theory,game-theory,determinacy",
  "scraped_at": "2026-01-14T04:15:00.041582",
  "answer": ""
}