{
  "id": "q_269617",
  "mathoverflow_id": 269617,
  "url": "https://mathoverflow.net/questions/269617/general-treatments-of-the-problem-of-extending-a-functor-from-a-small-category-t",
  "title": "reference request - General treatments of the problem of extending a functor from a small category to its power set to an endofunctor on it?",
  "body": "Suppose you analyse a small category $\\mathsf{C}$ whose set of objects you again denote by $\\mathsf{C}$ . Suppose you have found a natural categorical structure on $2^{\\mathsf{C}^{\\mathrm{op}}}$ (having much to do with the category $\\mathsf{C}$ ). Suppose you have also found a functor $F\\colon\\mathsf{C}\\rightarrow $ $2^{\\mathsf{C}^{\\mathrm{op}}}$ important to you. Suppose you would like to construct an endofunctor $\\overline{F}\\colon 2^{\\mathsf{C}^{\\mathrm{op}}}\\rightarrow2^{\\mathsf{C}^{\\mathrm{op}}}$ naturally 'extending' $F$ , at least in the sense that $\\overline{F}(\\{O\\})=F(O)$ $\\quad$ (point.condition) for each object $O$ of $\\mathsf{C}$ . Suppose you try this by defining $\\overline{F}$ on objects of $2^{\\mathsf{C}^{\\mathrm{op}}}$ by doing the most obvious: taking the image (in the set-map-sense) under $F$ of any given set of objects of $\\mathsf{C}$ . This might or might not work out to give an endofunctor, depending on how the category with set of objects $2^{\\mathsf{C}}$ is defined. This is not an 'extension problem' in the most elementary sense of the term, since $\\mathsf{C}$ is not a subset of $2^{\\mathsf{C}}$ , but a member. Question 0. Are there general treatments of this particular kind of functor extension problem that you would recommend? Question 1. Is there a usual technical term for this extension problem, and is there a, in some precise sense, canonical construction of the endofunctor $\\overline{F}$ ? I have seen this process once in the literature, but in a special case, and have forgotten where. Now I need it in my own work, and would like to read general theoretical treatments of it. I am aware of the importance and relevance of embedding a small categories $\\textsf{C}$ into its presheaf category $\\widehat{\\mathsf{C}}$ , which $2^{\\mathsf{C}^{\\mathrm{op}}}$ is a subcategory of, but could not find a treatment specifically relevant to the extension problem described above. I would like not to explicitly describe my specific problem, not to bias the question and keep in general. Very roughly speaking, the motivation comes from a problem in algebraic geometry, with $\\mathsf{C}$ corresponding to some sort of variety equipped with a notion of morphisms between its points, the points of $\\mathsf{C}$ parametrize a notion $S$ of `set of equations' each of whose possible solutions is again a point of $\\mathsf{C}$ , $F$ describes the correspondence ( $\\mathsf{C}\\ni O \\mapsto F(O) = $ set of all solutions to the set of equations $S(O)$ $\\in$ $2^{\\mathsf{C}}$ ) The goal is to extend $F$ to an endofunctor of the kind described above which formalizes the correspondence ( $2^{\\mathsf{C}}\\ni \\mathbb{O} \\mapsto \\overline{F}(\\mathbb{O}) = $ set of all solutions to the set of equations $\\bigcup_{O\\in\\mathbb{O}}S(O)$ $\\in$ $2^{\\mathsf{C}}$ ) Moreover, I know at least one $O\\in\\mathsf{C}$ with $F(O)=\\emptyset$ . Therefore,another necessary condition on the endofunctor $\\overline{F}$ is $\\overline{F}(\\mathsf{C})=\\emptyset$ . reference-request ct.category-theory mathematical-writing Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked May 12, 2017 at 15:22 Peter Heinig 6,151 1 1 gold badge 30 30 silver badges 50 50 bronze badges $\\endgroup$ 4 2 $\\begingroup$ If you don't forget that $\\sf C$ is a category you can endow $2^{\\sf C}$ with a category structure in a pretty much standard way: it is the category of functors ${\\sf C}\\to 2$ and natural transformations. It's up to you now to say whether $2=\\{0,1\\}$ or $2=\\{0\\le 1\\}$, but in both cases it is a category ($\\sf C\\times C$ in the first case, and something a little bit more complicated in the other case. $\\endgroup$ fosco –  fosco 2017-05-12 16:17:51 +00:00 Commented May 12, 2017 at 16:17 1 $\\begingroup$ I'll just throw an irresponsible answer, ok? If you can find a functor $y\\colon {\\sf C}\\to 2^{\\sf C}$ out of the Yoneda embedding (let's say for example that you send $c\\in\\sf C$ to the composition ${\\sf C} \\overset{y}\\to [{\\sf C}^\\text{op}, {\\bf Sets}] \\overset{[{\\sf C}^\\text{op},empty?]}\\to [{\\sf C}^\\text{op},2]$, where $empty?\\colon {\\bf Set}\\to 2$ does the obvious thing) then you can perform a Kan extension. Nontriviality of this extension is far from being granted, of course. :-) $\\endgroup$ fosco –  fosco 2017-05-12 17:17:35 +00:00 Commented May 12, 2017 at 17:17 1 $\\begingroup$ @FoscoLoregian, when $2=\\{0,1\\}$, isn't it the case that the category $2^\\mathsf{C}$ is the powerset of connected components of $\\mathsf{C}$, not $\\mathsf{C}\\times\\mathsf{C}$? $\\endgroup$ Kaya Arro –  Kaya Arro 2017-05-14 16:53:33 +00:00 Commented May 14, 2017 at 16:53 $\\begingroup$ Sure, you're right. Functors to a discrete category descend to functors from the $\\pi_0$ $\\endgroup$ fosco –  fosco 2017-05-14 18:55:58 +00:00 Commented May 14, 2017 at 18:55 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request ct.category-theory mathematical-writing See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 11 Is the functor of points of a scheme cofinally small? 5 When is the endofunctor category of a monoidal category braided? When is it ribbon? Fusion? Modular? 15 When is the category of small (pre)sheaves a(n elementary) topos? 8 Quotient-free monoidal categories 3 Usual technical term for replacing a set by the set of singletons of its members? 5 On some sense of representing an endofunctor of the category of modules over polynomial rings 4 Universal bundle and conjugacy classes $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 269617, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,ct.category-theory,mathematical-writing,reference-request,ct.category-theory,mathematical-writing",
  "scraped_at": "2026-01-14T04:15:06.844044",
  "answer": ""
}