{
  "id": "q_263773",
  "mathoverflow_id": 263773,
  "url": "https://mathoverflow.net/questions/263773/implicit-function-theorem-for-operators",
  "title": "fa.functional analysis - Implicit function theorem for operators",
  "body": "Let $P: (-a,a) \\rightarrow \\Psi_h^0(\\mathbb{R}),$ be a pseudodifferential operator in Weyl quantization with $(-a,a) \\ni z \\mapsto P(z)$ depending smoothly on this parameter $z$ . Note that this parameter is not the semiclassical parameter which is $h$ . Moreover, $P$ is supposed to be self-ajoint, of principal type, elliptic and satisfy $\\partial_z p(z)\\le -C<0$ bounded away by some constant. Here $p$ is the symbol of $P.$ Then, in the link it is claimed that we can write $P(z)= A^*(z)(P-z)A(z)$ where $P,A \\in \\Psi_h^0(\\mathbb{R}):$ click me. In other words, what is claimed here is that by an application of the implicit function theorem and some iteration we can transform any PDO that may depend non-linearly on $z$ into a form that depends on $z$ in the trivial way $P-z.$ What I understand so far is that the condition $\\partial_zp(x,\\xi,z)<0$ allows us to apply the implicit function theorem, i.e. we get that $$p(x,\\xi,z)=g(x,\\xi,z)(h(x,\\xi)-z)$$ for some local functions $h,g.$ But I am not really sure what kind of iteration may be meant here? Which kind of symbolic iteration allows us to go from this equation to the identity above. Apparently $P$ is the symbol associated with $h$ but how do we construct $A$ ? In other words, does anybody understand how those operators $A$ and $P$ are constructed then? If you have any questions, please let me know. fa.functional-analysis ap.analysis-of-pdes real-analysis elliptic-pde pseudo-differential-operators Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Mar 5, 2017 at 4:24 gipom 115 1 1 silver badge 5 5 bronze badges $\\endgroup$ 2 $\\begingroup$ Can you find a squre root of $P(z)$ under the conditions given? If the answer is yes, then $Q(z)=P(z)^{1/2}$ should be able to be factorized into something similar to $E(I-R)$, with $R$ a smoothing operator, and the theorem then follows. $\\endgroup$ Bombyx mori –  Bombyx mori 2017-03-06 02:40:20 +00:00 Commented Mar 6, 2017 at 2:40 1 $\\begingroup$ I guess $g$ is positive and real, therefore $p(z) = g(z)^{1/2} (h - z) g(z)^{1/2}$ is the principal symbol of $A(z)^* (P - z) A(z)$ if $g(z)^{1/2}$ is the principal symbol of $A(z)$. Now use the usual iteration to get an error $O(h^\\infty)$. $\\endgroup$ mcd –  mcd 2017-03-06 10:30:51 +00:00 Commented Mar 6, 2017 at 10:30 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions fa.functional-analysis ap.analysis-of-pdes real-analysis elliptic-pde pseudo-differential-operators See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 Interpretation of a parameter in forming a pseudodifferential operator 1 semiclassical principal symbol 9 Pseudodifferential operators on spaces with boundary 5 Positivity of semiclassical pseudodifferential operators 11 Is every non-negative test function the limit of a sequence of sums of squares of test functions? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 263773, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "fa.functional-analysis,ap.analysis-of-pdes,real-analysis,elliptic-pde,pseudo-differential-operators,fa.functional-analysis,ap.analysis-of-pdes,real-analysis,elliptic-pde,pseudo-differential-operators",
  "scraped_at": "2026-01-14T04:14:44.321609",
  "answer": ""
}