{
  "id": "q_272683",
  "mathoverflow_id": 272683,
  "url": "https://mathoverflow.net/questions/272683/puiseuxs-theorems-converse",
  "title": "ag.algebraic geometry - Puiseux&#39;s theorem&#39;s converse",
  "body": "Puiseux's theorem asserts that given a polynomial equation $P(x,y)=0$ , its solutions in $y$ , viewed as functions of $x$ , may be expanded as Puiseux series that are convergent in some neighbourhood of the origin ( $0$ excluded, in the case of a solution that tends to infinity at the origin). In other words, every branch of an algebraic curve may be locally (in terms of $x$ ) described by a Puiseux series. I'm also interested in expansions around $x=\\infty$ , which can be obtained by applying Puiseux's theorem to the equivalent polynomial equation $$t^dP(t^{-1},y)=0,$$ with $t=x^{-1}$ and $d =\\deg_x P(x,y).$ My questions are as follows: Let $k_0,n$ be integers, and suppose we have a relationship of the form $$y=\\sum_{k=k_0}^\\infty c_k \\frac{1}{x^{k/n}} $$ with complex $\\{c_k\\}_k$ , and $x$ sufficiently large. Is there a polynomial curve $P(x,y)=0$ , with one of the branches of which having a Puiseux series expansion as in above? A different version of this question is an asymptotic one: Suppose $$y \\sim \\sum_{k=k_0}^\\infty c_k \\frac{1}{x^{k/n}}, \\; \\text{as }x \\to \\infty. $$ Is there a polynomial curve $P(x,y)=0$ , such that one of its branches admits an asymptotic Puiseux series expansion as above? In the case where the answer to both of my questions is 'no', I'm still interested in any kind of information/reference regarding analytic curves $f(x,y)=0$ with branches which can be expanded in a Puiseux series as $x \\to \\infty$ (possibly in the asymptotic sense). If the answer to any of my questions is a 'yes', I'd like to know: how to start constructing such a polynomial curve? does the number $n$ in the Puiseux series say anything about the degree of $P(x,y)$ ? Thank you! ag.algebraic-geometry puiseux-series Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jun 21, 2017 at 9:10 user1337 473 2 2 silver badges 10 10 bronze badges $\\endgroup$ 4 1 $\\begingroup$ Do you really think that there exists a polynomial relation $P(x,e^{\\frac{1}{x} })=0$? $\\endgroup$ abx –  abx 2017-06-21 09:19:05 +00:00 Commented Jun 21, 2017 at 9:19 $\\begingroup$ @abx I don't think so. $\\endgroup$ user1337 –  user1337 2017-06-21 09:28:53 +00:00 Commented Jun 21, 2017 at 9:28 $\\begingroup$ So, doesn't that give a counter-example to your first question? $\\endgroup$ abx –  abx 2017-06-21 13:01:05 +00:00 Commented Jun 21, 2017 at 13:01 $\\begingroup$ Elaborating somewhat on abx's comment, the solutions $y$ of $y^n+a_{n-1}(x)y^{n-1} + \\ldots + a_0(x) = 0$ are still Puiseux series if the coefficients are only holomorphic (rather than polynomials). $\\endgroup$ Christian Remling –  Christian Remling 2017-06-21 18:13:41 +00:00 Commented Jun 21, 2017 at 18:13 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry puiseux-series See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 2 Puiseux series for roots of polynomials with smooth coefficients 2 Isolated zero set of real polynomial in two variables 6 Puiseux series expansion for space curves? 8 Singular points of algebraic varieties and parametrization by Puiseux series 9 Ramification and Puiseux series in Several Variables 7 Do amoebas obtain extra tentacles as we take the tropical limit? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 272683, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,puiseux-series,ag.algebraic-geometry,puiseux-series",
  "scraped_at": "2026-01-14T04:15:27.070889",
  "answer": ""
}