{
  "id": "q_27763",
  "mathoverflow_id": 27763,
  "url": "https://mathoverflow.net/questions/27763/subrandom-walkers",
  "title": "pr.probability - subrandom walkers",
  "body": "Does anyone know of any work on the following model or variants thereof?: Finitely many chips are distributed on the integers at time 0. To find the distribution at time $t+1$, take all the chips at each location $n$ at time $t$ and send equal numbers of them to $n-1$ and $n+1$, with the proviso that if the numbers of chips at $n$ at time $t$ was odd, say $2k+1$, then $k$ chips go left, $k$ chips go right, and the last chip goes either left or right, as determined by a coin flip. (We assume that the coin used at location $n$ at time $t$ is independent of all the coin flips at all other locations and times.) Note that if the ``odd chip'' is required to stay put at $n$, this is precisely the chip-firing or sandpile analogue of random walk on the integers, as described for instance in R. J. Anderson, L. Lovasz, P. W. Shor, J. Spencer, E. Tardos and S. Winograd, Disks, balls and walls: Analysis of a combinatorial game, American Math. Monthly 96, pp. 481-493 (1989). pr.probability sandpile Share Cite Improve this question Follow edited Feb 7, 2017 at 8:31 Nikita Kalinin 5,183 1 1 gold badge 42 42 silver badges 63 63 bronze badges asked Jun 11, 2010 at 2:00 James Propp 20.2k 5 5 gold badges 58 58 silver badges 147 147 bronze badges $\\endgroup$ 4 $\\begingroup$ Do you have a specific question in mind, James? $\\endgroup$ Tom LaGatta –  Tom LaGatta 2010-06-11 05:15:36 +00:00 Commented Jun 11, 2010 at 5:15 $\\begingroup$ What about the following deterministic variation? ... if the number of chips at $n$ is odd, say $2k+1$ then $k$ go left and $k+1$ go right if $n$ is even, respectively $k$ go right and $k+1$ go left if $n$ is odd. $\\endgroup$ Roland Bacher –  Roland Bacher 2010-06-11 18:06:39 +00:00 Commented Jun 11, 2010 at 18:06 $\\begingroup$ Tom: I have a number of specific questions in mind. One is, how big could the discrepancy be between the number of chips at $n$ at time $t$ under odd-chip-moves-randomly and the expected number of chips at $n$ at time $t$ under every-chip-moves-randomly, starting from the same initial state? This is a question I already know the answer to, thanks to private email from Joel Spencer. But has Joel rediscovered something that's already in the literature? $\\endgroup$ James Propp –  James Propp 2010-06-12 01:47:47 +00:00 Commented Jun 12, 2010 at 1:47 $\\begingroup$ Roland: Your variation looks sensible. So do some others that can be derived from the various rules for rounding described in en.wikipedia.org/wiki/Rounding . E.g., the odd-chip-moves-randomly rule is related to stochastic rounding, aka dithering, and the rotor-router rule described in arxiv4.library.cornell.edu/abs/0904.4507 is related to the round-half-alternatingly rule. All such variants are of potential interest to me. My question is \"What's already known?\" $\\endgroup$ James Propp –  James Propp 2010-06-12 01:55:43 +00:00 Commented Jun 12, 2010 at 1:55 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions pr.probability sandpile See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 19 What is the probability that two random walkers will meet? 7 First Collision Time for k Random Walkers on a Torus 5 Duration and critical groups order in sandpile models and chip firing games 4 First collision time of $n$ random walkers on a cycle 1 Two types of random walkers on square lattice 4 Dynamic site percolation of independent random walkers on 2-dimensional square lattice 16 Annihilating random walkers $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 27763, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "pr.probability,sandpile,pr.probability,sandpile",
  "scraped_at": "2026-01-14T04:10:06.776642",
  "answer": ""
}