{
  "id": "q_272030",
  "mathoverflow_id": 272030,
  "url": "https://mathoverflow.net/questions/272030/what-kind-of-null-set-is-this",
  "title": "reference request - What kind of null set is this?",
  "body": "Let $H$ be a Hilbert space. Suppose the following holds: for every orthonormal basis $\\{e_n\\}$ of $H$ and sequence $\\{\\epsilon_n\\} \\in \\ell^2(\\mathbb{N})$ , with $C:= \\prod_n [-\\epsilon_n e_n, \\epsilon_n e_n ]$ , if $\\nu$ denotes the product measure $dx/2\\epsilon_n$ , then $\\nu((H\\backslash A) \\cap C) = 0$ . Then $H\\backslash A$ is called a negligible set. Is there a technical term for this type of set? I want to know more details about it but no clue what to search for. Thanks. reference-request fa.functional-analysis Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jun 12, 2017 at 15:48 Gorge 11 1 1 bronze badge $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request fa.functional-analysis See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 7 Nice orthonormal basis for L^2(Cantor set) 0 Reference for compact operators in quaternionic Hilbert spaces 3 Transform Riesz basis $\\{e^{i \\lambda_n t}\\}_{n\\in\\mathbb Z}$ to an orthogonal basis 10 Approximation via finite rank Cameron-Martin projections 1 interchanging limits and summation 0 Weak convergence of Hilbert Schmidt operators 3 What is the most natural way to define the density of the set in a separable Hilbert space? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 272030, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,fa.functional-analysis,reference-request,fa.functional-analysis",
  "scraped_at": "2026-01-14T04:15:24.784120",
  "answer": ""
}