{
  "id": "q_271693",
  "mathoverflow_id": 271693,
  "url": "https://mathoverflow.net/questions/271693/what-is-the-classification-of-this-group",
  "title": "reference request - What is the classification of this group?",
  "body": "Let $K=\\mathbb C((t))$ and $O=\\mathbb C[[t]]$ , and $n\\geq 1$ . Consider the matrix $$J_{2n}=\\begin{pmatrix} 0& I_n \\\\ -I_n & 0\\end{pmatrix},$$ And let $\\Psi : K^{2n}\\times K^{2n}\\rightarrow K$ given by $$\\Psi(u,v)=u\\cdot J_{2n}\\cdot \\overline v,$$ where $\\overline{f(t)}=f(-t)$ . What is the type of the group $S(\\Psi)_{2n}(K)=\\{g\\in SL_{2n}(K); \\Psi(g,g)=\\Psi\\}$ ? (as in the table given by Tits) Is it Split? Simply connected? Is $P=S(\\Psi)_{2n}(O)$ is a maximal parahoric subgroup? This has been studied by Pappas and Rapoport for a Hermitian $\\Psi$ , but I couldn't find any reference for this case. Thanks reference-request algebraic-groups local-fields Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jun 8, 2017 at 10:45 Z.A.Z.Z 1,969 11 11 silver badges 16 16 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request algebraic-groups local-fields See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 16 Simply connected algebraic groups and reductive subgroups of maximal rank 1 Subgroups generated by opposite root groups 4 Rational Characters of a reductive group have the same rank as split component 5 What condition makes unitary reductive group unramified? 6 The Tits classes of simply connected simple real groups 3 Is this unipotent group, over characteristic 2, connected? 2 What are the Tits algebras of $\\mathrm{SO}(A, \\sigma)$ if $A$ is split? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 271693, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,algebraic-groups,local-fields,reference-request,algebraic-groups,local-fields",
  "scraped_at": "2026-01-14T04:15:20.305535",
  "answer": ""
}