{
  "id": "q_270275",
  "mathoverflow_id": 270275,
  "url": "https://mathoverflow.net/questions/270275/testing-randomness-of-permutation-sequences",
  "title": "algorithms - Testing Randomness of Permutation Sequences",
  "body": "Maybe this question is too simple, but I couldn't find anything that is concerned with measuring how random a sequence of permutations of $n$ elements( w.l.o.g. of the numbers $\\lbrace 1,\\ \\dots,\\ n \\rbrace\\ $ ) is. For sequences of numbers or points there are quite a few tests available, that have to be passed to qualify as sufficiently random, i.e. lacking discernible patterns. Questions: is there something like the Diehard Tests for sequences of permutations of a fixed set of elements? which random permutation generators are considered \"safe\"? algorithms random-permutations Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked May 20, 2017 at 13:21 Manfred Weis 14k 4 4 gold badges 40 40 silver badges 82 82 bronze badges $\\endgroup$ 3 $\\begingroup$ I think you need to provide more details. For instance, what is your sampling space? If you are just selecting a member of a set with n! elements with uniform probability, is this problem not trivial? What do you mean by generators? $\\endgroup$ thedude –  thedude 2017-05-20 14:46:54 +00:00 Commented May 20, 2017 at 14:46 $\\begingroup$ @thedude I don't want to select just one member, but a representative sample of manageable size, analogous to asking 1000 carefully selected people instead of several millions to get representative answers. In the same manner I want a set of representative permutations, of which I can test certain properties and be sure, that the results are not much different when performing the tests on all permutations. A generator is an algorithm or device, that produces sequences of permutations. $\\endgroup$ Manfred Weis –  Manfred Weis 2017-05-20 15:16:34 +00:00 Commented May 20, 2017 at 15:16 $\\begingroup$ @thedude, a lot of effort has gone into solving the \"trivial\" problem of selecting a member of a finite set with uniform probability. Keyphrase: \"uniform random number generator\". $\\endgroup$ Gerry Myerson –  Gerry Myerson 2017-05-21 00:11:30 +00:00 Commented May 21, 2017 at 0:11 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions algorithms random-permutations See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 Toroidality testing 3 What is the probability of a given induced ordering of a random permutation? 10 fixed points of permutation groups 1 Popular algorithms (stopping rules) with output - a prefix of a permutation 16 Algorithm for selecting a fixed-point free permutation $\\varphi:\\{1,\\ldots,n\\}\\to\\{1,\\ldots,n\\}$ $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 270275, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "algorithms,random-permutations,algorithms,random-permutations",
  "scraped_at": "2026-01-14T04:15:13.575318",
  "answer": ""
}