{
  "id": "q_278231",
  "mathoverflow_id": 278231,
  "url": "https://mathoverflow.net/questions/278231/curvature-geq-1-but-not-geq1",
  "title": "reference request - Curvature $\\geq-1$ but not $\\geq1$",
  "body": "(Edited again) In the following, for brevity, I will say that $$X\\ \\ \\mathrm{has}\\ \\ \\kappa_{\\mathrm{max}}=k$$ if $X$ is a compact ( $n$ -dimensional with $n\\geq2$ , with empty boundary) Aleksandrov space of curvature $\\geq k$ , but not of curvature $\\geq k+\\varepsilon$ for all $\\varepsilon>0$ . Note that the curvature bound is from below . I apologize to the experts if the terminology is not standard. There are many facts like Fact: If $X$ has $\\kappa_{\\mathrm{max}}=1$ , then $X$ has the property $\\mathcal P$ . E.g. $\\mathcal P=$ \"diameter $\\leq\\pi$ \" Question 1: Does someone know, instead, some property $\\mathcal P$ such that the following holds? Fact 1: If $X$ has $\\kappa_{\\mathrm{max}}=-1$ then $X$ has the propery $\\mathcal P$ . On the other hand, there exists $X$ that has $\\kappa_{\\mathrm{max}}=1$ and the property $\\neg\\mathcal P$ . Example of answer: $\\mathcal P=$ \"is not isometric to a spherical join $X_1*X_2$ of two spaces $X_1$ and $X_2$ with $\\kappa_{\\mathrm{max}}=1$ \". (I hope in some \"less trivial\" answer). Actually, I am interested in a very special class of Aleksandrov spaces: hyperbolic, Euclidean and spherical cone-manifolds with all cone angles $<2\\pi$ . $X$ is such a space iff it admits a piecewise hyperbolic (resp. Euclidean, spherical) triangulation (i.e. simplices = non-degenerate geodesic simplices $\\subset\\mathbb H^n$ , simplicial maps = isometries) such that $X$ is a normal pseudo-manifold (in particular the space of directions at every point is a compact connected spherical cone $(n-1)$ -manifold) and the link of every $(n-2)$ -simplex has length $\\leq2\\pi$ . In that case, $X$ has $\\kappa_{\\mathrm{max}}=-1$ (resp. $0, 1$ ), and the curvature is constant outside the singular locus. Let us assume always compactness, empty boundary, and $n\\geq2$ . Question 2 Let $X$ be a cone-manifold with all (if any) cone-angles $<2\\pi$ . Does someone know some property $\\mathcal P$ such that the following holds? Fact 2: If $X$ is hyperbolic, then $X$ has the propery $\\mathcal P$ . On the other hand, there exists a spherical $X$ with property $\\neg\\mathcal P$ . I do not nothing about Aleksandrov spaces. Since I imagine there is a (big) difference between, let's say, spherical and hyperbolic cone-manifolds (with all cone-angles $<2\\pi$ ), I am curious about that differences that depend mainly on $\\kappa_{\\mathrm{max}}$ , in some sense. If you think that such a list of $\\mathcal P$ would be too much long (or that this is just a basic question for the experts about Aleksandrov spaces with lower curvature bounds), also some references containing facts like Fact 1 would be appreciated (and I will consider it as an answer). Thanks. reference-request mg.metric-geometry hyperbolic-geometry alexandrov-geometry curvature Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Aug 8, 2017 at 4:28 stefaNo 31 4 4 bronze badges $\\endgroup$ 7 $\\begingroup$ By analogy with the Riemannian picture that would be natural to use another global result: namely Cartan-Hadamard theorem. So the property would be: the universal cover is contractable. $\\endgroup$ Dmitrii Korshunov –  Dmitrii Korshunov 2017-08-08 08:04:22 +00:00 Commented Aug 8, 2017 at 8:04 $\\begingroup$ Probably what you say is true for curvature bounds from above . For example, by doubling a geodesic hyperbolic triangle you get a simply connected (homeomorphic to $S^2$) Aleksandrov space with curvature bounded below that is not contractible. $\\endgroup$ stefaNo –  stefaNo 2017-08-08 12:18:46 +00:00 Commented Aug 8, 2017 at 12:18 1 $\\begingroup$ The question is overly broad (many results in comparison geometry can serve as an answer). Voted to close. $\\endgroup$ Igor Belegradek –  Igor Belegradek 2017-08-08 13:10:16 +00:00 Commented Aug 8, 2017 at 13:10 3 $\\begingroup$ If you provide some motivation (i.e. why do you care), the question would be easier to answer. $\\endgroup$ Igor Belegradek –  Igor Belegradek 2017-08-08 20:29:54 +00:00 Commented Aug 8, 2017 at 20:29 1 $\\begingroup$ I don't understand what \"Let us assume that $\\kappa=\\kappa_{max}$ is the maximum possible\" means. Also, I don't see how Fact 1 could hold for any $\\mathcal{P}$, since having curvature bounded below by $1$ is stronger than having it bounded by $-1$: if the latter implies something, then certainly the former does. I must have misunderstood your question. $\\endgroup$ Benoît Kloeckner –  Benoît Kloeckner 2017-08-11 13:05:04 +00:00 Commented Aug 11, 2017 at 13:05  |  Show 2 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request mg.metric-geometry hyperbolic-geometry alexandrov-geometry curvature See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 28 Tetrahedra with prescribed face angles 17 Is there Domain Invariance for Alexandrov spaces? 4 Manifold with a quasi-positive curvature 4 Surfaces with curvature $\\leq K$ are of bounded integral curvature 3 Smooth approximation of locally CAT(-1) metrics 3 2-orbifolds that I expect to be hyperbolic, but they're nonnegatively curved 4 On the history of cone-3-manifolds $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 278231, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,mg.metric-geometry,hyperbolic-geometry,alexandrov-geometry,curvature,reference-request,mg.metric-geometry,hyperbolic-geometry,alexandrov-geometry,curvature",
  "scraped_at": "2026-01-14T04:15:38.314043",
  "answer": ""
}