{
  "id": "q_273639",
  "mathoverflow_id": 273639,
  "url": "https://mathoverflow.net/questions/273639/optimal-encoding-of-sets-with-debruijn-likesequences",
  "title": "algorithms - Optimal Encoding of Sets with DeBruijn-likeSequences",
  "body": "A DeBruijn sequences of order $n$ encodes all possible strings of length $n$ over an alphabet with $k$ symbols and algorithms for their construction are well known among those familiar with the subject; see for example this MO question . Question: Given a fixed collection of sets of length $n$ strings over an alphabet with $k$ symbols: (when) is it possible to find a (minimal) set of additional length $n$ strings that, when added (possibly with repetitions) to the given collection of sets, allows it to encode each set in a DeBruijn-like manner, i.e. in each of the generated (cyclic) sequences $n$ adjacent symbols either resemble an element of the encoded set or an element of the additional set? provided the existence of such sequences: is it possible to construct them to optimality, i.e., either minimizing the maximal length of the set-encoding strings or minizing their summed lengths. Remark: In the encoding of the sets uniqueness of the elements is not required; especially if non-uniqueness allows more compact overall encoding of the sets. algorithms sequences-and-series coding-theory Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jul 4, 2017 at 12:25 Manfred Weis 14k 4 4 gold badges 40 40 silver badges 82 82 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions algorithms sequences-and-series coding-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 5 How to construct particular De Bruijn sequences Related 7 Can you hide a letter without losing information? 1 Optimal covering 3 Generating uniquely $k$-optimal point sets 1 What is the quotient (pseudo)metric $d_\\sim$ and how do I identify the infimum of possible sequences in this instance? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 273639, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "algorithms,sequences-and-series,coding-theory,algorithms,sequences-and-series,coding-theory",
  "scraped_at": "2026-01-14T04:15:31.569386",
  "answer": ""
}