{
  "id": "q_289904",
  "mathoverflow_id": 289904,
  "url": "https://mathoverflow.net/questions/289904/influence-of-vertex-weights-on-performance-of-polyhedral-tsp-algorithms",
  "title": "convex polytopes - Influence of Vertex Weights on Performance of Polyhedral TSP Algorithms",
  "body": "It is well known, that the optimal tours are invariant under the addition of vertex weights; it is also known, that minimum spanning trees provide an upper bound on the length of the shortest Hamilton cycle in a graph and, that the MST is sensitive to the addition/subtraction of vertex weights, which makes it possible to penalize vertices with high degree in the MST and thus improve the upper bound in some cases. Questions: are TSP algorithms, that are based on polyhedral methods, such as e.g. Cut&Branch , sensitive to the addition/subtraction of vertex weights in the sense, that the execution path from the input of a TSP instance to reporting the optimal solutions can vary, if vertex weights are added/subtracted? In case of an affirmative answer: what would be good criteria for the vertex weights to be added/subtracted (e.g. maximize sum of subtracted weights, that leave all edge weights non-negative; add large weights; add random weights)? convex-polytopes combinatorial-optimization Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jan 4, 2018 at 9:37 Manfred Weis 14k 4 4 gold badges 40 40 silver badges 82 82 bronze badges $\\endgroup$ 4 $\\begingroup$ This sounds exactly like the One-tree relaxation: www2.imm.dtu.dk/courses/02713/NewLectures/bbtsp4.pdf $\\endgroup$ John Gunnar Carlsson –  John Gunnar Carlsson 2018-01-04 17:22:07 +00:00 Commented Jan 4, 2018 at 17:22 $\\begingroup$ @JohnGunnarCarlsson that's exactly the case, but AFAIK only the numerical value of the upper bound is exploited by adding it as a constraint on the length of optimal tour; the edge-weights of the problem instance are however not modified - please correct me, if I'm wrong. What my questions aims at, is a bit different, namely what would happen, if we don't add the improved length-constraint and instead modify only the edge-weights of the problem instance. $\\endgroup$ Manfred Weis –  Manfred Weis 2018-01-04 17:52:03 +00:00 Commented Jan 4, 2018 at 17:52 $\\begingroup$ I'm not sure I fully understand your question, but the one-tree relaxation definitely involves iteratively changing the edge weights. $\\endgroup$ John Gunnar Carlsson –  John Gunnar Carlsson 2018-01-04 18:02:32 +00:00 Commented Jan 4, 2018 at 18:02 $\\begingroup$ So the answer to my question would be \"yes\" in the sense, that adding/subtracting vertex weights influences the execution of polyhedral TSP algorithms, even if the restriction on optimal tour length isn't tightened? $\\endgroup$ Manfred Weis –  Manfred Weis 2018-01-04 19:17:49 +00:00 Commented Jan 4, 2018 at 19:17 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions convex-polytopes combinatorial-optimization See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 0 Relation of 1-trees to optimal tours 8 Joining the $2^k$ points of $\\{0,1\\}^k$ with the shortest tree $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 289904, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "convex-polytopes,combinatorial-optimization,convex-polytopes,combinatorial-optimization",
  "scraped_at": "2026-01-14T04:16:03.925953",
  "answer": ""
}