{
  "id": "q_284846",
  "mathoverflow_id": 284846,
  "url": "https://mathoverflow.net/questions/284846/chains-of-right-annihilators-in-group-rings",
  "title": "ra.rings and algebras - Chains of right annihilators in group rings",
  "body": "See the update below This problem emanates from a question on not-so-simple random walks on finitely generated groups. But to explain the connections would require an extremely long essay. Let $G$ be a finitely generated group. If $S$ is a finite subset of $G$ , call $S$ admissible if $1 \\in S$ and $S$ generates $G$ as a semigroup, that is, $\\cup_{n=1}^{\\infty} S^n = G$ , where $S^n$ is the set of products of $n$ elements of $G$ . If $f$ is in the real group algebra ${\\mathbf R}G$ , call $f$ admissible if all of its coefficients are nonnegative, and the support of $f$ is admissible. Finally, if $x$ is an element of a ring $R$ (which will be a group ring over the reals), we denote the right annihilator of $x$ (the set of $y \\in R$ such that $xy =0$ ) by $\\rho (x)$ . I was looking for classes of examples of (finitely generated) groups $G$ , such that for all admissible $f$ , there exists $n$ such that $\\rho(f^n) = \\rho(f^{n+1})$ . [The $n$ need not be uniformly bounded as $f$ varies, but that would also be an interesting property.] For some choices of admissible $f$ , this is automatic; for example if $f = f^*$ ( $^*$ is the involution induced by $g \\mapsto g^{-1}$ ), or more generally, if $ff^* = f^*f$ ( $f$ is normal), because the involution is definite, and in this case $n\\leq 1$ . Or if by chance ${\\mathbf R} G$ is a Goldie ring (sufficient conditions are known for this, see Passman's book), then every chain of annihilators is eventually stationary. Of course, if ${\\mathbf R} G$ has no zero divisors, the condition is automatic (with $n=0$ ). But then it occurred to me that I didn't know of any examples of admissible $f$ where the condition failed, or even any examples with $n =2$ —that is, $f$ is admissible and $\\rho(f^3)= \\rho(f^2)$ and strictly contains $\\rho (f)$ ! This leads naturally to the following question for finite groups. For each $n$ , does there exist a finite group $G_n$ , together with an admissible $f$ in ${\\mathbf R} G_n$ for which the minimal $k$ such that $\\rho(f^k) = \\rho(f^{k+1})$ is $n$ ? It is obvious that if $|G| =m$ , then $m-1$ is an upper bound. The Perron theorem applies: left multiplication by $f$ on ${\\mathbf R} G$ , when written with respect to the obvious basis, is a primitive matrix, but this estimate is in all likelihood much too large. A slight refinement probably gives $m-$ (the number of linear characters) and sometimes $+1$ . Actually, the computations are so annoying that for now, I'd like to see an example (with a finite group) with $n = 2$ . This corresponds to the matrix for $f$ having a Jordan block for the eigenvalue zero of size two. When $G$ is abelian, every element of the group ring is normal, so $n \\leq 1$ ; and we can exclude symmetric $f$ for arbitrary $G$ because they are normal. The condition on admissibility reduces, in the finite group case, to simply having $1$ in the support, since we can reduce to the group generated by the support. Update (The next day) After sober reflection, it turns out there is an easy way to generate admissible $f$ with the desired index $n$ (the smallest integer such that $\\rho(f^n) = \\rho(f^{n+1})$ ). Let $G$ be any finite group, say with order $m$ , and set $z = \\sum_{g \\in G} g$ . This is in the centre of the group ring, and vanishes at every complex irreducible representation of $G$ , except the trivial one. The restrictions of the complex irreducibles to ${\\mathbf R} G$ are of three types, real, quaternionic, or a direct sum of two real; so the image of $z$ vanishes at every real irreducible that is more than one-dimensional. In the decomposition of the real group algebra as a direct sum of real, complex, and quaternionic matrix rings, find the one with the largest index of nilpotence (the largest matrix size), call it $k$ , and pick $a$ in the group ring, whose image is of maximal index of nilpotence there, and nilpotent (or zero) at every other matrix algebra. Let $\\pi$ be the quotient map to the matrix algebra. Then $\\pi(z) = 0$ , and we can find sufficiently large integer $N$ such that $f:= Nz + a$ has strictly positive coefficients at all group elements. Then $\\pi(f) = \\pi (a)$ , and thus $\\pi(f^{k-1}) \\neq 0$ , but $\\pi(f^k) = 0$ . If $e $ is the central idempotent corresponding to the matrix ring direct summand, we see that $f^{k-1}e \\neq 0$ , but $f^k e = 0$ . This says that the index of $f $ is at least $k$ , but it is easy to see that it cannot be any larger. So the largest index for an admissible element is exactly the largest index of nilpotence, rather depressingly. For infinite groups, this construction is unavailable, and perhaps the question should have been in that direction. ra.rings-and-algebras finite-groups geometric-group-theory random-walks group-rings Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Oct 31, 2017 at 2:04 David Handelman 4,799 2 2 gold badges 24 24 silver badges 37 37 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ra.rings-and-algebras finite-groups geometric-group-theory random-walks group-rings See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 0 Annihilators in artinian ring 1 Annihilators in finite rings 9 Annihilators in Matrix Rings 4 Right reversibility of submonoids of nilpotent groups 3 Looking for example of quotient of group algebra by ideal of group ring which fails to be injective 14 Group rings such that every (countably generated) module has a maximal submodule 9 Units of group algebra of dihedral group 5 Local vs global nilpotence class (Lazard correspondence) $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 284846, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ra.rings-and-algebras,finite-groups,geometric-group-theory,random-walks,group-rings,ra.rings-and-algebras,finite-groups,geometric-group-theory,random-walks,group-rings",
  "scraped_at": "2026-01-14T04:15:47.297281",
  "answer": ""
}