{
  "id": "q_288785",
  "mathoverflow_id": 288785,
  "url": "https://mathoverflow.net/questions/288785/ultraconsistency-truth",
  "title": "lo.logic - Ultraconsistency &amp; Truth",
  "body": "Let $D$ be an effectively generated set of recursive ordinals that contains $0$ and that is closed under an effectively defined ordinal successor function \" $+1$ \" and that have a well defined relation of ordinal strict smaller than relation $<$ on it, such that no two distinct elements of $D$ have the same order type. We'll simply label such a set as an \"effective set of recursive ordinals\" Define recursively $T_0 = T$ , $T_{i+1} = T_i + \\operatorname{Con}(T_i)$ for every $i \\in D$ , $T_j = \\bigcup\\{T_i\\mid i<j\\}$ for every limit ordinal $j \\in D $ . Where $T$ is an extension of $PA$ . Say that $T$ is $D$ _ ultraconsistent iff $\\forall i \\in D \\ ( \\operatorname{Con}(T_i)) $ Say that $T$ is ultraconsistent iff $\\forall D (D$ is an effective set of recursive ordinals $ \\implies T $ is $D$ _ ultraconsistent $)$ Do the following statements follow? If $T,H$ are ultraconsistent then $T \\cup H$ is ultraconsistent. If $T$ is ultraconsistent and $G$ is a fragment of $T$ then $G$ is ultraconsistent. Can we have a theory $T$ that is ultraconsistent and yet $FALSE$ ? Of relevance to the last question is the following quote: \"Feferman's starting point was the 1939 paper of Turing (\"On Systems of Logic Based on Ordinal\"). Turing also considered such paths through Kleene's O, but could just prove a theorem for Π1 sentences, (using simpler \"Consistency\" statements\"). Feferman shows that if one takes \"n-Reflection\" statements for every n each time one extends the theory then there are paths along which every true statement of arithmetic is proven\". (emphasis added) From the following page of Mathoverflow: Pi1-sentence independent of ZF, ZF+Con(ZF), ZF+Con(ZF)+Con(ZF+Con(ZF)), etc.? Now this points to completeness of such paths for theories formulated in classical logic, and so ultra-consistency seems to parallel truth here, since no ultra-consistent theory can be false since it would be disproved along the hierarchy of theories on top of it proving its negation. I'm not really sure of this, that's why I'm asking, if such a quote goes in favor with what I'm at here. Note: This post modified the earlier approach before the [HOLD] which was erroneous in using indefinable ordinal indices, here this is fixed to index the theories after an ordinal notation that is effectively recursively generated. lo.logic Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Dec 18, 2017 at 19:14 Zuhair Al-Johar 13.3k 1 1 gold badge 16 16 silver badges 56 56 bronze badges $\\endgroup$ 13 2 $\\begingroup$ What a horror... $\\endgroup$ Andrés E. Caicedo –  Andrés E. Caicedo 2017-12-18 19:28:41 +00:00 Commented Dec 18, 2017 at 19:28 15 $\\begingroup$ This is something of a FAQ (and pretty much everyone makes this mistake at some point): $\\mathrm{Con}(T)$ does not depend merely on the set of axioms of $T$ but on the way they are enumerated . So $T_i$ is not well-defined, unless you let $i$ be a recursive ordinal notation and not merely a recursive ordinal (but then you run into other problems). $\\endgroup$ Gro-Tsen –  Gro-Tsen 2017-12-18 20:18:23 +00:00 Commented Dec 18, 2017 at 20:18 4 $\\begingroup$ (@Zuhair More likely, I think you did not understand the problem Gro-Tsen mentioned.) $\\endgroup$ Andrés E. Caicedo –  Andrés E. Caicedo 2017-12-18 20:34:35 +00:00 Commented Dec 18, 2017 at 20:34 5 $\\begingroup$ Now that you've edited the question to iterate along a recursive notation system, it makes sense, so I nominated for reopening. But it would have been better if you had made it clear in your edit that your original question was wrong and that you fixed it, so people can see it and vote for reopening. $\\endgroup$ Gro-Tsen –  Gro-Tsen 2017-12-20 14:38:02 +00:00 Commented Dec 20, 2017 at 14:38 3 $\\begingroup$ Any $\\Sigma_1$-sound theory is ultraconsistent. (This is likely if and only if.) Thus, 1. there are ultraconsistent theories T, H whose union is (plain) inconsistent, and 3. there is an ultraconsistent theory that's not even $\\Sigma_2$-sound. 2. is likely easily shown true if you fix issues with the formalization mentioned in Gro-Tsen's comment. $\\endgroup$ Emil Jeřábek –  Emil Jeřábek 2017-12-23 16:08:02 +00:00 Commented Dec 23, 2017 at 16:08  |  Show 8 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions lo.logic See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 21 Pi1-sentence independent of ZF, ZF+Con(ZF), ZF+Con(ZF)+Con(ZF+Con(ZF)), etc.? Related 16 Sneaky Recursive Non-Well-Orders 40 Is there a computable ordinal encoding the proof strength of ZF? Is it knowable? 6 When do we get $CON(ZF)$ in transfinite progressions of consistency statements? 11 $Π^0_1$ Proof Ordinals 11 Is every true statement independent of $PA$ equivalent to some consistency statement? 12 Infinite descending consistency chains 8 Iterated Gentzen: or, a Sith objection to the proof of consistency of PA 2 A question about computability and Turing machines $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 288785, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "lo.logic,lo.logic",
  "scraped_at": "2026-01-14T04:16:33.825450",
  "answer": ""
}