{
  "id": "q_288942",
  "mathoverflow_id": 288942,
  "url": "https://mathoverflow.net/questions/288942/empirical-approaches-to-validate-observational-bounds-on-minimum-gap-between-lea",
  "title": "linear algebra - Empirical approaches to validate observational bounds on minimum gap between least eigenvalues of $n \\times n$ correlation matrix and its submatrices",
  "body": "Let $\\Sigma$ be an $n \\times n$ correlation matrix whose least eigenvalue is denoted by $\\lambda$ . $\\Sigma_i'$ be an $(n-1) \\times (n-1)$ submatrix of $\\Sigma$ obtained by eliminating the $i$ -th row and $i$ -th column and whose least eigenvalue is denoted by $\\lambda_i'$ . Find an upper bound on the gap $$\\Delta := \\min_{i \\in \\{1,\\dots,n\\}}(\\lambda_i' - \\lambda)$$ Empirical Observations: Empirically, I am making some observations about $\\Delta$ : $\\Delta \\leq $ the mean of the absolute values of all off-diagonal entries of $\\Sigma$ . $\\Delta \\leq \\frac{||C_{j}||}{n-1} \\leq \\frac{||C_{j}||_1}{n-1}$ for all $j \\in \\{1\\dots,n\\}$ , where $C_j$ denotes a column vector of $\\Sigma$ including all off-diagonal entries. $\\Delta \\leq \\frac{1}{n-1}$ , for any $n \\times n$ correlation matrix, and the maxima is achieved when all the off-diagonal entries are equal to $\\frac{-1}{n-1}$ . I am unable to prove them theoretically yet (More details on theoretical results are discussed on this link ). Hence, I am resorting to empirical approaches that can be convincing enough to validate these observations. A trivial approach could be to check the observations on a large population (say 10^6) of randomly generated correlation matrices. However, such a number doesn't seem to be large enough for bigger matrices. I am wondering if someone can suggest smarter methods that could be useful in this setting? linear-algebra matrices random-matrices eigenvalues numerical-linear-algebra Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Dec 20, 2017 at 21:12 Saurabh Agrawal 141 7 7 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions linear-algebra matrices random-matrices eigenvalues numerical-linear-algebra See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 7 Bound on gap between least eigenvalues of $n \\times n$ correlation matrix and of its $(n -1) \\times (n-1)$ submatrices Related 0 Are these particular kinds of matrices well known? 1 Connection between weights in the last eigenvector (corresponding to least eigenvalue) and the corresponding column of a correlation matrix 1 Is there any relation between weights in the eigenvector (corresponding to least eigenvalue) and the columns of a correlation matrix? 2 Symmetric orthogonal matrices with constant diagonal entries 4 Shifted eigenvalues and Gershgorin theorem 3 Power of a matrix, largest eigenvalue in absolute value, and convergence acceleration 1 The eigenvalue/singular values of (large) square random matrices 6 Numerical tests show the smallest eigenvalue of a certain matrix remains invariant when some parameters vary – any proof ideas? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 288942, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "linear-algebra,matrices,random-matrices,eigenvalues,numerical-linear-algebra,linear-algebra,matrices,random-matrices,eigenvalues,numerical-linear-algebra",
  "scraped_at": "2026-01-14T04:15:59.112496",
  "answer": ""
}