{
  "id": "q_282378",
  "mathoverflow_id": 282378,
  "url": "https://mathoverflow.net/questions/282378/eisenbud-goto-conjecture-in-positive-characteristic",
  "title": "ag.algebraic geometry - Eisenbud-Goto conjecture in Positive Characteristic",
  "body": "Eisenbud-Goto conjecture predicted that the Castelnuovo-Mumford regularity ${\\rm reg}(X)$ of a non-degenerate projective variety $X\\subset \\mathbb{P}^N$ is bounded by the $\\deg(X)-{\\rm codim}(X,\\mathbb{P}^N)+1$, where $\\deg(X)$ stands for the degree of $X$. This conjecture was stated by Eisenbud and Goto over an algebraically closed field $k$. Eisenbud-Goto conjecture is known to hold for arithmetically Cohen-Macaulay algebraic varieties in arbitrary dimension and arbitrary field $k$ by Eisenbud and Goto. It is proved for complex smooth curves by Gruson-Lazarsfeld-Peskine, and later on this result was generalized for connected curves in an arbitrary algebraically close field. It is also known for smooth complex surfaces by Lazarsfeld and Pinkham, for some singular complex surfaces by Niu and for most smooth $3$-folds by Ran and Kwak. Roughly speaking, the main trick to tackle this conjecture was introduced by Greenberg and it consist in studying the length of the special fibers certain finite map. The same procedure seems not to work in positive characteristic. The conjecture was proved to be false by Peeva and McCullough, in any characteristic and dimension sufficiently large. However, it seems that there is no smooth (or with \"reasonable\" singularities) counter-example to the conjecture yet. I wanted to ask you the following about positive characteristic: If EG conjecture holds for $X$ over the complex numbers, does it follows trivially that EG conjecture holds for the reduction mod $p$ of $X$? What about for $p$ large enough? If yes, what is a good reference to read about this in the literature? ag.algebraic-geometry positive-characteristic castelnuovo-mumford-regularity Share Cite Improve this question Follow edited Jan 14, 2019 at 1:59 S. Carnahan ♦ 46.8k 7 7 gold badges 120 120 silver badges 228 228 bronze badges asked Sep 30, 2017 at 6:56 Joaquín Moraga 1,593 1 1 gold badge 13 13 silver badges 18 18 bronze badges $\\endgroup$ 2 1 $\\begingroup$ For an integral Noetherian ring $A$, for a closed subscheme $X_A=\\text{Zero}(\\mathcal{I})$ of projective space $\\mathbb{P}^n_A$, for a morphism from a field $\\text{Spec}\\ k\\to \\text{Spec}\\ A$, the Castelnuovo-Mumford regularity of $X_k$ is less than or equal to $r$ precisely if the cohomology group $H^q_k:=H^q(\\mathbb{P}^n_k,\\mathcal{I}_k(r-q))$ vanishes for $q=1,\\dots,n$. By cohomology and base change, for each $q$ there exists a dense Zariski open subset $U_q$ of $\\text{Spec}\\ A$ such that for points of $U_q$, the rank of $H^q_k$ is independent of $k$ . . . $\\endgroup$ Jason Starr –  Jason Starr 2017-09-30 11:28:00 +00:00 Commented Sep 30, 2017 at 11:28 1 $\\begingroup$ . . . Thus, for the dense open $U=U_1\\cap \\dots \\cap U_k$, for every point $\\text{Spec}\\ k \\to U$, the fiber $X_k$ has Castelnuovo-Mumford regularity $\\leq r$ if and only if the generic fiber has Castelnuovo-Mumford regularity $\\leq r.$ So the answer to your second question is positive by cohomology and base change. There are many examples where the Castelnuovo-Mumford regularity jumps up in families, e.g., a quartic rational normal curve has regularity $1,$, but it specializes to a linearly degenerate smooth quartic rational curve with regularity $2.$ $\\endgroup$ Jason Starr –  Jason Starr 2017-09-30 11:33:06 +00:00 Commented Sep 30, 2017 at 11:33 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry positive-characteristic castelnuovo-mumford-regularity See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 15 Characterizations of Abelian varieties (3-folds) in positive characteristic 1 Sommese's theorem (generalized Weak Lefschetz) in arbitrary characteristic? 6 Nagata's conjecture in positive characteristic 2 Lifting to char 0, references and questions 3 Enriques classification of algebraic surfaces in characteristic zero 11 Non-algebraic K3 surfaces in characteristic $p$ $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 282378, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,positive-characteristic,castelnuovo-mumford-regularity,ag.algebraic-geometry,positive-characteristic,castelnuovo-mumford-regularity",
  "scraped_at": "2026-01-14T04:15:45.047849",
  "answer": ""
}