{
  "id": "q_288875",
  "mathoverflow_id": 288875,
  "url": "https://mathoverflow.net/questions/288875/volumes-of-hecke-operators",
  "title": "nt.number theory - Volumes of Hecke operators",
  "body": "Let $G=GL(2, F)$ and $K$ a maximal compact subgroup. Unramified Hecke operators are defined by the action of the double cosets $$T(n) = \\bigcup_{\\substack{ad=n, a>0 \\\\ a|d}} K \\left( \\begin{array}{cc} a & \\\\ & d \\end{array} \\right) K$$ There is a decomposition in right cosets $$\\bigcup_{\\substack{ad=n, a>0}} \\bigcup_{b \\mod d}K \\left( \\begin{array}{cc} a & b \\\\ & d \\end{array} \\right)$$ I would like to know the volumes of $T(n)$ . So here are my questions: is there a similar standard decomposition in left cosets? can we directly compute the measure (for a fixed left Haar measure on $G$ ) of the right cosets? nt.number-theory modular-forms automorphic-forms haar-measure hecke-operators Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Dec 19, 2017 at 21:36 Wolker 551 2 2 silver badges 10 10 bronze badges $\\endgroup$ 2 7 $\\begingroup$ For 1, the first definition is manifestly invariant under transpose (if $K$ is the standard maximal compact subgroup) so you can just take the transpose of the second definition, which gives a right coset description. For 2, for $GL_2$, left and right Haar measure are the same so all cosets should have the same measure. $\\endgroup$ Will Sawin –  Will Sawin 2017-12-19 21:42:47 +00:00 Commented Dec 19, 2017 at 21:42 $\\begingroup$ What is $F$? (And then some more characters.) $\\endgroup$ LSpice –  LSpice 2017-12-20 02:29:01 +00:00 Commented Dec 20, 2017 at 2:29 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions nt.number-theory modular-forms automorphic-forms haar-measure hecke-operators See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 23 Relation between Hecke Operator and Hecke Algebra 27 Are there any Hecke operators acting on an elliptic curve with additive reduction that I don't know about? 4 Definition of Hecke operators 5 Relation between Hecke operators and coefficient of L-functions 8 Origin of definitions of ramified Hecke operators 9 The correct determinant exponent of the weight $k$-operator for defining Hecke operators/adelizing modular forms 6 Cusp forms have an orthonormal basis of eigenfunctions for all Hecke operators 3 Hecke operators on universal elliptic curves $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 288875, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "nt.number-theory,modular-forms,automorphic-forms,haar-measure,hecke-operators,nt.number-theory,modular-forms,automorphic-forms,haar-measure,hecke-operators",
  "scraped_at": "2026-01-14T04:16:36.072286",
  "answer": ""
}