{
  "id": "q_280536",
  "mathoverflow_id": 280536,
  "url": "https://mathoverflow.net/questions/280536/unboundedness-of-number-of-solutions-of-intersection-of-bivariate-polynomial-wit",
  "title": "real algebraic geometry - Unboundedness of number of solutions of intersection of bivariate polynomial with graph of function from an o-minimal structure",
  "body": "I am trying to understand a construction sketched in the paper by Gwozdziewicz, Kurdyka and Parusinski in the Proceedings of the AMS 1999 (paper here ) and I'd like to request some help. The construction begins at the end of penultimate page of the text of the paper and goes on till the very end. As can be inferred from the title, the paper is about the number of solutions of a bi-variate non-zero polynomial $P(x, y)$ of degree $d$ on the graph of $y = e^x + \\sin{x}$ . They prove that this is not greater than $2(d + 2)^{12}$ . They then discuss a consequence of this result to o-minimal structures. In the discussion, they prove the following result. For analytic $f: (a, \\infty) \\to \\mathbb{R}$ , let $A(d)$ denote the number of isolated solutions to the system $P(x, y) = 0, y = f(x), x > a.$ If we are given a sequence $\\mathbb{N} \\ni d \\to a(d) \\in \\mathbb{N}$ , then there exists an analytic function $f : (a, \\infty) \\to \\mathbb{R}$ , subanalytic at infinity, and an increasing sequence $k \\to d_k$ of integers such that $$a(d_k) \\le A(d_k),$$ for all $k \\in \\mathbb{N}$ . They sketch the idea of the construction in the paper, and it is not clear to me. I will type their construction almost verbatim here in the question, and then ask specific questions. One can easily construct by induction: a sequence $b_k \\in \\mathbb{N}$ , two sequences $\\epsilon_k > 0$ , $\\eta_k > 0$ , and a sequence of Polynomials $P_k = c_{1 + b_k}t^{1 + b_k} + \\ldots + c_{b_{k+1}}t^{b_{k+1}}$ such that $\\|P_k\\| \\le \\epsilon_k$ , if $r: (0, 1) \\to \\mathbb{R}$ is continuous, $\\sup_{t \\in (0, 1)} |r(t)| \\le \\eta_k$ , then $$\\#\\{t \\in (0, 1): P_k(t) + r(t) = 0\\} \\ge a(4b_k)$$ , $\\sum_{k > n} \\epsilon_k < \\eta_n$ , for all $n \\in \\mathbb{N}$ , where $\\|\\cdot\\|$ is the sum of absolute value of coefficients. Now let $$g(t) = \\sum_{k=1}^{\\infty} P_k(t).$$ We can take $P_k$ so small that the radius of convergence of the series is $> 1$ . Finally put $f(x) = g\\left(\\frac{x}{\\sqrt{x^2 + 1}}\\right), x > 0$ . Let $$q_k(t, y) = y - \\sum_{n=1}^{k-1} P_n(t), \\qquad k > 2.$$ Clearly $q_k$ is of degree $\\le b_k$ and it has at least $a(4b_k)$ zeros on the graph of g(t), for $t \\in [0, 1)$ . It is easy to find a polynomial $Q_k(x, y)$ of degree $\\le d_k = 4b_k$ which vanishes on the zeros of $q_k\\left(\\frac{x}{\\sqrt{x^2 + 1}, y}\\right)$ . Since $Q_k$ has at least $a(d_k)$ zeros on the graph of $f$ , it follows that $a(d_k) \\le A(d_k)$ , as desired. My questions Any insight on this construction would be very welcome. My current understanding is akin to hanging on to a cliff edge by my fingernails, so I'll be grateful for absolutely anything! Point 2 of the construction, i.e. $r(t)$ is the most unclear to me. My understanding is that they are saying that for any $r: (0, 1) \\to \\mathbb{R}$ that is continuous, we have that $\\#\\{t \\in (0, 1): P_k(t) + r(t) = 0\\} \\ge a(4b_k)$ . I am not sure how we can construct sequences that satisfy this. Absolutely no clue. $\\|P_k\\|$ is bounded from above by $\\epsilon_k$ , whereas $\\eta_k$ is a bound on $\\epsilon_{k+1} + \\epsilon_{k+2} + \\epsilon_{k+3} + \\ldots$ according to point 3 of the construction. So when we are looking at $P_k(t) + r(t)$ , $|r(t)| \\le \\eta_k$ , and $\\|P_k\\| \\le \\epsilon_k$ . I don't understand how these two interplay. Apologies if my questions are unclear. The fact that my questions are unclear itself is evidence that my understanding of this is nebulous. I will be grateful for any help whatsoever. Thank you very much in advance. polynomials real-algebraic-geometry analytic-geometry o-minimal fewnomial Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Sep 6, 2017 at 20:56 Abhiram Natarajan 121 4 4 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions polynomials real-algebraic-geometry analytic-geometry o-minimal fewnomial See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 3 Every positive polynomial with rational coefficients is above a completely Q-factorized nonnegative polynomial ? 23 Hilbert's Theorem on $L_2$ norm of polynomials in $\\mathbb{Z}[X]$ - Explicit construction and a converse? 4 counting complex roots which are root of unity times a real number 8 On entire functions with real and simple zeros 21 Do these polynomials have alternating coefficients? 3 Intersection of quadratic equations with planted solutions? 2 Is $(f(x)+1)(g(x)+1)-1$ a probabilistic polynomial, if $f(x)$ and $g(x)$ are? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 280536, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "polynomials,real-algebraic-geometry,analytic-geometry,o-minimal,fewnomial,polynomials,real-algebraic-geometry,analytic-geometry,o-minimal,fewnomial",
  "scraped_at": "2026-01-14T04:15:40.554312",
  "answer": ""
}