{
  "id": "q_289562",
  "mathoverflow_id": 289562,
  "url": "https://mathoverflow.net/questions/289562/global-dimension-of-noetherian-rings",
  "title": "ra.rings and algebras - Global dimension of noetherian rings",
  "body": "In the book \"An introduction to noncommutative Noetherian rings\" by Goodearl and Warfield from 2004 one can find the following two open problem: Is the Krull dimension less than or equal to the global dimension of a noetherian ring? Is the global dimension of a noetherian ring equal to the supremum of the projective dimensions of the simple modules? What is the status of those problems in 2017? ra.rings-and-algebras homological-algebra Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Dec 30, 2017 at 10:23 Mare 28.3k 7 7 gold badges 26 26 silver badges 117 117 bronze badges $\\endgroup$ 2 $\\begingroup$ Rather than posting here, it would have been simpler to ask Ken Goodearl. $\\endgroup$ David Handelman –  David Handelman 2017-12-30 13:45:29 +00:00 Commented Dec 30, 2017 at 13:45 $\\begingroup$ Re 1: any counterexample cannot have an Auslander dualising complex. $\\endgroup$ user91132 –  user91132 2018-01-02 15:49:05 +00:00 Commented Jan 2, 2018 at 15:49 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ra.rings-and-algebras homological-algebra See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 5 An example where finitistic dimension does not equal right global dimension? 9 Global dimensions of non-commutative rings 1 Reference for a result of Auslander about the global dimension 4 question about infinite global dimension 3 $\\Omega$ for noetherian semiperfect rings 8 Are commutative rings of finite global dimension reduced? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 289562, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ra.rings-and-algebras,homological-algebra,ra.rings-and-algebras,homological-algebra",
  "scraped_at": "2026-01-14T04:16:01.623437",
  "answer": ""
}