{
  "id": "q_295163",
  "mathoverflow_id": 295163,
  "url": "https://mathoverflow.net/questions/295163/closed-and-bounded-intervals-of-definably-complete-ordered-groups",
  "title": "gr.group theory - Closed and bounded intervals of definably complete ordered groups",
  "body": "True or false? All closed and bounded intervals of definably complete ordered groups are definably compact. Let $G$ be an ordered abelian group. Then, a definable subset $D ⊆ G$ is said to be definably compact if for every definable open cover $\\{ϕ(a, G)\\}_{a∈G}$ of $D$ , there exists a pseudo-finite sub-cover $\\{ϕ(a, G)\\}_{a∈P}$ for some pseudo-finite set $P = ψ(t_0, G)$ . gr.group-theory model-theory topological-groups definability ordered-groups Share Cite Improve this question Follow edited Feb 1, 2020 at 0:15 YCor 67.5k 5 5 gold badges 203 203 silver badges 301 301 bronze badges asked Mar 14, 2018 at 2:42 Ma Joad 1,795 8 8 silver badges 17 17 bronze badges $\\endgroup$ 1 $\\begingroup$ I think it’d be clearer to say: “...there exists a sub-cover $\\{\\phi(a,G)\\}_{a\\in P}$ indexed by a definable closed bounded and discrete set $P$”. (Alternatively, if I’m not understanding pseudo-finiteness correctly, that’s worth clarifying in the question!) $\\endgroup$ user44143 –  user44143 2018-03-14 03:37:50 +00:00 Commented Mar 14, 2018 at 3:37 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions gr.group-theory model-theory topological-groups definability ordered-groups See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 2 Example involving partially ordered Abelian groups 19 Is Thompson's group definably orderable? 8 Topological groups in which all subgroups are closed 3 Definable closure in class-sized expansions of o-minimal groups 0 Is every subgroup closed in this complete, nondiscrete topological group? 3 Does definable compactness imply that a definable open cover parameterized by a definable set has a finite subcover? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 295163, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "gr.group-theory,model-theory,topological-groups,definability,ordered-groups,gr.group-theory,model-theory,topological-groups,definability,ordered-groups",
  "scraped_at": "2026-01-14T04:16:22.534362",
  "answer": ""
}