{
  "id": "q_291265",
  "mathoverflow_id": 291265,
  "url": "https://mathoverflow.net/questions/291265/largest-eigenvalue-of-two-types-of-slightly-different-random-matrices",
  "title": "pr.probability - Largest eigenvalue of two types of slightly different random matrices",
  "body": "Consider two types of slightly different $n \\times n$ symmetric random matrices $X$ . The diagonal elements of $X$ are fixed as $1$ . Suppose $\\frac{k}{n} \\to \\alpha$ for some constant $\\alpha\\in(0,1)$ . Type I : Randomly sample $k$ distinct numbers $i_1,...,i_k$ from $1,...,n$ . Let $X(i,j)=X(j,i) = 1$ . All other elements above the diagonal are i.i.d. uniform random variables, and the elements in the lower triangle are set accordingly. Type II : Randomly sample $k^2 - k$ distinct cell above the diagonal and set them as $1$ , then all other elements above the diagonal are i.i.d. uniform random variables. The elements in the lower triangle are set accordingly. Type II is more random than type I and every element above the diagonal can still be viewed as i.i.d. with mean $0.5+0.5\\alpha^2$ . The answer of Bound for largest eigenvalue of symmetric matrices of uniform random variables over $[0,1]$ and fixed $1$s along diagonal and scattered $1$s has explained the largest eigenvalue of the Type II will concentrate around $(0.5n+0.5\\alpha^2n+O(\\sqrt n))$ . The question is, In Type I, the elements above the diagonal seems not i.i.d., will Type I still has a similar result for the largest eigenvalue? I also guess the largest eigenvalue of the first type is larger than the second type with high probability when $n$ is large. Any explanation or reference is very much appreciated! pr.probability matrices random-matrices random-graphs Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jan 22, 2018 at 19:01 Tony 272 2 2 silver badges 11 11 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions pr.probability matrices random-matrices random-graphs See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 7 Bound for largest eigenvalue of symmetric matrices of uniform random variables over $[0,1]$ and fixed $1$s along diagonal and scattered $1$s Related 1 Eigenvalue density of some random matrices? 3 Eigenvalue distribution of the sum of two random matrices 7 Bound for largest eigenvalue of symmetric matrices of uniform random variables over $[0,1]$ and fixed $1$s along diagonal and scattered $1$s 3 Largest eigenvalue of the adjacency matrix of weighted random graph 10 Largest eigenvalue of finite band random matrices 3 Top singular value of large random matrices: concentration results $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 291265, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "pr.probability,matrices,random-matrices,random-graphs,pr.probability,matrices,random-matrices,random-graphs",
  "scraped_at": "2026-01-14T04:16:10.748777",
  "answer": ""
}