{
  "id": "q_297001",
  "mathoverflow_id": 297001,
  "url": "https://mathoverflow.net/questions/297001/does-anybody-know-how-to-prove-or-disprove-the-following-guess-about-edge-colori",
  "title": "graph theory - Does anybody know how to prove or disprove the following guess about edge coloring of Hypergraphs?",
  "body": "Definition. Suppose $H=(V,E)$ is a hypergraph. Call a hyperedge $e=\\{v_1,v_2,\\dotsc,v_k\\}$ a $k$ -star if in the 1-skeleton of $H$ there is a copy of $K^{1,k-1}$ whose union equals $e$ . (Obviously in the case $k=2$ , $e$ is an usual edge.) EDITED: Consider the following two properties: (a) For every hyperedge $e$ of $H$ there exists $k\\in\\mathbb{N}$ such that $e$ is $k$ -star. (b) If two hyperedges $e_i$ and $e_j$ which share at least one vertices ( $|e_i\\cap e_j|\\geq1$ ) then there is an usual edge that connect internal nodes of this two hyperedges. Question: Does anybody know how to prove or disprove the following guess about edge coloring of Hypergraphs? Let $\\Delta(H)$ denote the maximum of vertex-degrees of a finite hypergraph $H$ . Guess. Let $H$ be a simple hypergraph satisfying (a) and (c). Then there exists an $(\\Delta+1)$ -edge-coloring so that any two edges which share one vertices have distinct colors. graph-theory graph-colorings hypergraph Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Apr 4, 2018 at 16:12 C.F.G 4,205 6 6 gold badges 36 36 silver badges 67 67 bronze badges $\\endgroup$ 5 $\\begingroup$ Dear @C.F.G.: I did a more-or-less complete re-write of your question, because I found it unclear in places. Needless to say, you can re-edit. I don't understand condition (c), and I didn't touch it. Would you please clarify what (c) means? $\\endgroup$ Peter Heinig –  Peter Heinig 2018-04-05 07:30:16 +00:00 Commented Apr 5, 2018 at 7:30 $\\begingroup$ Dear @PeterHeinig, you know that each hyperedge in this question has one central node ( internal node). the means of condition (c) is that internal nodes of hyperedges are not connected to any leaves of hyperedges and not connected to another internal nodes. $\\endgroup$ C.F.G –  C.F.G 2018-04-05 07:51:34 +00:00 Commented Apr 5, 2018 at 7:51 $\\begingroup$ thanks for clarifying; however, it is still not clear: the way you defined '$k$-star' and condition (a), the 'internal node' of a hyperedge need not be unique , so (c) is simply undefined . Would you please think about what you are asking and then formulate the question unambiguously? $\\endgroup$ Peter Heinig –  Peter Heinig 2018-04-05 11:32:22 +00:00 Commented Apr 5, 2018 at 11:32 $\\begingroup$ I have deleted the condition (c) but this is not my wanted. I want an extra condition that says: no central node of a hyperedge coincide with leave node of another hyperedge. $\\endgroup$ C.F.G –  C.F.G 2018-04-06 07:21:04 +00:00 Commented Apr 6, 2018 at 7:21 1 $\\begingroup$ .: re \"I want an extra condition that says: no central node of a hyperedge coincide with leave node of another hyperedge.\": this is good to know; I was about to point out that your conditions so far seem to make coloring more difficult, and in particular, for any hypergraph $H$ once can easily 'saturate' $H$ with enough 2-element hyperedges to make (a) and (b) while not lowering the chromatic number. The condition you now mentioned makes more sense, since it seems to edge-coloring easier. By the way, do you allow multiple edges' in your 'hypergraphs\"? (some peapole do, some don't.) $\\endgroup$ Peter Heinig –  Peter Heinig 2018-04-06 07:33:19 +00:00 Commented Apr 6, 2018 at 7:33 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions graph-theory graph-colorings hypergraph See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 13 Is there a version of König's theorem for tripartite 3-graphs? 5 Hypergraph Chromatic Number vs Degree, Clique-Size 4 2-Coloring a planar hypergraph 6 Bipartiteness criterion 3 An edge coloring problem for class two graphs $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 297001, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "graph-theory,graph-colorings,hypergraph,graph-theory,graph-colorings,hypergraph",
  "scraped_at": "2026-01-14T04:16:27.066199",
  "answer": ""
}