{
  "id": "q_296712",
  "mathoverflow_id": 296712,
  "url": "https://mathoverflow.net/questions/296712/points-on-sphere-whose-image-under-symmetric-positive-definite-matrix-is-conta",
  "title": "linear algebra - Points on Sphere whose image, under symmetric positive definite matrix, is contained in cube",
  "body": "Let $\\Sigma \\in \\mathbb{R}^{n \\times n}$ be a symmetric, positive definite matrix and let $\\mu_r$ denote surface measure on the sphere in $\\mathbb{R}^n$ with radius $r$. Let $$ R = \\{x \\in \\mathbb{R}^n : |x_i| \\leq a_i, \\ i = 1, \\dots, n\\} $$ denote an $n$-dimensional rectangle that centers the origin. Many geometric properties are known when considering $\\Sigma$ as a linear map from $\\mathbb{R}^n$ to itself, in particular the map will transform a sphere to an ellipse, rotate the standard basis and scale them proportional to the eigenvalues, etc. As such there are many reformulations of my question, which is the following: Ideally, I would like $\\mu_r(\\Sigma^{-1}R)$ as explicitly as possible given in terms of $r$ and the elements of $\\Sigma$ and the $a_i.$ Geometrically, this is the surface area of the points on the sphere with corresponding points on the ellipsoid (under $\\Sigma$) contained in $R.$ Other comments or answers to related problems are welcome! linear-algebra matrices geometric-measure-theory multilinear-algebra Share Cite Improve this question Follow edited May 3, 2018 at 18:43 Mahdi - Free Palestine 2,011 2 2 gold badges 17 17 silver badges 32 32 bronze badges asked Mar 31, 2018 at 20:42 user253775 153 5 5 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions linear-algebra matrices geometric-measure-theory multilinear-algebra See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 2 Estimating the Hausdorff measure of a subset of the sphere 5 Finding an axis-aligned ellipsoid of minimal volume which contains a given ellipsoid 3 Algorithmic Version of John's Decomposition of Convex Body 12 Eigenvectors of a symmetric positive definite Toeplitz matrix 0 Positive definite - Inverse of sparse symmetric matrix 2 Real matrices with complex eigenvalues of bounded modulus 5 Estimating a symmetric positive-definite matrix from list of matrix vector products 0 Symmetric positive definite matrix - submatrices 3 How to check that the surface measure is the weak limit of $\\delta^{-1}\\mathcal{L}^n|_{B(0,1+\\delta)\\setminus B(0,1)}$? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 296712, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "linear-algebra,matrices,geometric-measure-theory,multilinear-algebra,linear-algebra,matrices,geometric-measure-theory,multilinear-algebra",
  "scraped_at": "2026-01-14T04:16:24.766895",
  "answer": ""
}