{
  "id": "q_291402",
  "mathoverflow_id": 291402,
  "url": "https://mathoverflow.net/questions/291402/not-exactly-directed-percolation",
  "title": "reference request - Not exactly directed percolation",
  "body": "Is the following problem known/well-studies? I'm looking for references or a name that I can look up. I start with $N$ cell, each one divides into two cells, each one of the new cells either dies with probability $p$ or divides into two cells, and so on. What is the probability distribution of the number of cells after $n$ generations? What can be said about the critical $p$ below which the population goes extinct? Are there Universal scaling laws for this extinction transition? At first, I thought it was directed percolation problem , but the exponential growth in the possible number of cells is not consistent with DP. reference-request pr.probability random-graphs statistical-physics percolation Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jan 25, 2018 at 1:45 stochastic 371 1 1 silver badge 11 11 bronze badges $\\endgroup$ 2 6 $\\begingroup$ I would say that this is $N$ independent Galton–Watson processes, where the distribution of the r.v. are concentrated on 0 and 2. $\\endgroup$ Leandro –  Leandro 2018-01-25 02:25:03 +00:00 Commented Jan 25, 2018 at 2:25 $\\begingroup$ @Leandro Thank you, that is exactly what I needed to know $\\endgroup$ stochastic –  stochastic 2018-01-25 06:23:23 +00:00 Commented Jan 25, 2018 at 6:23 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request pr.probability random-graphs statistical-physics percolation See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 49 Conway's game of life for random initial position 4 Dynamic site percolation of independent random walkers on 2-dimensional square lattice 3 Understanding Finite Size Scaling in Percolation Theory 2 Which infinite random graphs with percolation threshold $p_c=0$ are transient? 6 Infinite clusters for loopless percolation $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 291402, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,pr.probability,random-graphs,statistical-physics,percolation,reference-request,pr.probability,random-graphs,statistical-physics,percolation",
  "scraped_at": "2026-01-14T04:16:13.017878",
  "answer": ""
}