{
  "id": "q_291947",
  "mathoverflow_id": 291947,
  "url": "https://mathoverflow.net/questions/291947/what-can-be-said-about-the-topological-k-theory-of-non-singular-varieties-of-sma",
  "title": "ag.algebraic geometry - What can be said about the topological K-theory of non-singular varieties of small codimension in projective space?",
  "body": "Working over $\\mathbb{C}$, the Barth-Larsen results tell us a lot about the ordinary cohomology of non-singular varieties of small codimension in projective space. For example if $X \\subseteq \\mathbb{P^n}$ has codimension $l$ then the restriction map: $$ H^i(\\mathbb{P^n}, \\mathbb{Z}) \\to H^i(X, \\mathbb{Z}) $$ is an isomporphism for $i \\le n-2l$. My question is What can be said about the topological $K$-theory of such an $X$? Of course the $K$-theory and ordinary cohomology of $X$ are closely related: if $X$ is torsion-free then they are rationally isomorphic. Better still, if $$K(X) = K_{(0)}(X) \\supseteq K_{(1)}(X) \\supseteq K_{(2)}(X) \\supseteq \\cdots $$ is the topological filtration of $K(X)$, then the associated graded ring of this filtration is the even part of the integral ordinary cohomology. So technically, we can use this to translate the Barth-Larsen result above into a statement in the language of $K$-theory, but I was hoping for a statement a bit more \"native\" to $K$-theory. Is anyone aware of such a statement? My motivation for this question relates to Hartshorne's complete intersection conjecture, stated in his influential 1974 paper [1]. Much of Hartshorne's motivation for this conjecture stems from the fact that the topology of non-singular varieties of small codimension is identical to that of complete intersections, at least as measured by the fundamental group and ordinary cohomology. So it seems natural to wonder about what $K$-theory has to say about this (partly as I have some vague reasons for suspecting it might have something to say). [1] Robin Hartshorne, Varieties of small codimension in projective space. Bull. Amer. Math. Soc., 80:1017—1032, 1974. ag.algebraic-geometry at.algebraic-topology cohomology kt.k-theory-and-homology projective-varieties Share Cite Improve this question Follow edited Aug 13, 2019 at 15:12 YCor 67.5k 5 5 gold badges 203 203 silver badges 301 301 bronze badges asked Feb 1, 2018 at 22:17 Oliver Nash 1,556 1 1 gold badge 12 12 silver badges 26 26 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry at.algebraic-topology cohomology kt.k-theory-and-homology projective-varieties See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 12 Lefschetz hyper-plane theorem for singular projective varieties? 11 Torsion in cohomology of smooth manifolds 5 What is the ring structure of the complex topological K-theory of a non-singular complex quadric? 5 What tools can I use to compute the cohomology of the fibers of a Lefschetz Pencil? 24 To what extent can we characterise the image of the topological Chern character? 4 Singular cohomology of fields 4 Singular cohomology of varieties over function fields $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 291947, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,at.algebraic-topology,cohomology,kt.k-theory-and-homology,projective-varieties,ag.algebraic-geometry,at.algebraic-topology,cohomology,kt.k-theory-and-homology,projective-varieties",
  "scraped_at": "2026-01-14T04:16:15.285996",
  "answer": ""
}