{
  "id": "q_290595",
  "mathoverflow_id": 290595,
  "url": "https://mathoverflow.net/questions/290595/on-representable-abelian-sheaves-vs-abelian-sheaves",
  "title": "ag.algebraic geometry - On representable abelian sheaves vs abelian sheaves",
  "body": "Let $S$ be a scheme, $(\\text{Sch}/S)_{\\rm Ét}$ a big étale site, and $A$ a representable (either in schemes or algebraic spaces over $S$ ) abelian sheaf on $(\\text{Sch}/S)_{\\rm Ét}$ . Suppose there is a short exact sequence of abelian sheaves on $(\\text{Sch}/S)_{Ét}$ : $$0\\to A_1\\to A\\to A_2\\to 0.$$ Are $A_1$ and $A_2$ representable? are the maps $A_1\\to A$ and $A\\to A_1$ representable, the former by a closed immersion? If both maps are representable, then $A_1$ is representable if and only if $A_2$ is. Conversely: if $A_1$ and $A_2$ are representable, is $A$ too? In other words, is the full subcategory of the category of abelian sheaves on $(\\text{Sch}/S)_{Ét}$ given by representable abelian sheaves and morphisms/representable morphisms of abelian sheaves, a weak Serre subcategory? ag.algebraic-geometry arithmetic-geometry schemes abelian-categories abelian-schemes Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jan 13, 2018 at 9:06 user92332 $\\endgroup$ 1 2 $\\begingroup$ I don't see your \"clearly one is representable if and only if...\" If by representable you mean representable by a group object in the category of scheme/S then any discrete group is representable, and I can look at thing very far from geometry like the quotient of $GL_n$ by the discrete group of points $GL_n(S)$. $\\endgroup$ Simon Henry –  Simon Henry 2018-01-13 10:45:53 +00:00 Commented Jan 13, 2018 at 10:45 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 42 Commutative rings to algebraic spaces in one jump? 5 When is a sheaf on a scheme extendable to a representable functor? 4 Representability of Hom-sheaves of various moduli spaces 3 Néron models vs integral models 1 Approximation of constructible abelian étale sheaves 2 Extending the domain of the yoneda embedding map from étale schemes to the small étale topos so that it is still fully faithful $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 290595, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,arithmetic-geometry,schemes,abelian-categories,abelian-schemes",
  "scraped_at": "2026-01-14T04:16:06.172341",
  "answer": ""
}