{
  "id": "q_297359",
  "mathoverflow_id": 297359,
  "url": "https://mathoverflow.net/questions/297359/trivializations-of-gerbes-as-generalisation-of-trivializations-of-line-bundles",
  "title": "dg.differential geometry - Trivializations of gerbes as generalisation of trivializations of line bundles",
  "body": "I understood gerbes as generalization of line bundle here. In this, I am trying to understand how to generalize notion of trivialization of line bundle to the notion of trivialization of gerbes. I am following this notes of Hitchin for this. It says that We can’t point to a gerbe as a space in the same way that we can for a line bundle, but there is a fundamental notion which helps to understand them – a trivialization of a gerbe. Further, it says, Recall that for line bundles, trivialization is a non-vanishing section $s$ of $L$ . A unitary trivialization $s/||s||$ is also a section of the principal $S^1$ bundle. In terms of transition functions, this is a collection of functions $f_\\alpha:U_\\alpha\\rightarrow S^1$ such that on $U_\\alpha\\cap U_\\beta$ we have $f_\\alpha=g_{\\alpha\\beta}f_\\beta$ . Given another trivialization $f_\\alpha':U_\\alpha\\rightarrow S^1$ we have $f_\\alpha'=g_{\\alpha\\beta}f_\\beta'$ and so we see that $$\\frac{f_\\alpha'}{f_\\alpha}=\\frac{f_\\beta'}{f_\\beta}.$$ Thus, $f_\\alpha'/f_\\alpha$ is restriction of a global function to $U_\\alpha$ and we see that the difference of two local trivializations of a line bundle is the global function $X\\rightarrow S^1$ . Here, $L$ is a unitary line bundle or its principal $S^1$ bundle of unitary frames. I do not know what is a unitary bundle. I assume that $L$ is just a line bundle $\\pi:L\\rightarrow X$ . I understand that for line bundles, trivialization is same as giving a non vanishing section of line bundle. He generalises notion of trivialization to that of gerbes. In case of line bundles, this is collection of maps $f_\\alpha:U_\\alpha\\rightarrow S^1$ . In case of gerbes it has to be on $1$ fold intersection extra i.e., $f_{\\alpha\\beta}:U_\\alpha\\cap U_\\beta\\rightarrow S^1$ . The condition $f_\\alpha=g_{\\alpha\\beta}f_\\beta$ in case of line bundles should have its similar generalization in case of gerbes. I fail to understand how this generalisation is the condition $$g_{\\alpha\\beta\\gamma}=f_{\\alpha\\beta}f_{\\beta\\gamma}f_{\\gamma\\alpha}$$ Any suggestion on understanding this better is useful. dg.differential-geometry gerbes Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Apr 9, 2018 at 6:13 Praphulla Koushik 6,223 3 3 gold badges 29 29 silver badges 74 74 bronze badges $\\endgroup$ 9 $\\begingroup$ If you’re not already familiar with it, you should look up the description of the first chern class in terms of Cech cohomology. $\\endgroup$ Aaron Bergman –  Aaron Bergman 2018-04-12 13:39:46 +00:00 Commented Apr 12, 2018 at 13:39 $\\begingroup$ @AaronBergman Can you suggest me some place to see that and tell me how does it help to understand this better. $\\endgroup$ Praphulla Koushik –  Praphulla Koushik 2018-04-12 15:11:26 +00:00 Commented Apr 12, 2018 at 15:11 $\\begingroup$ Try Section 1.1 of Griffiths and Harris $\\endgroup$ Aaron Bergman –  Aaron Bergman 2018-04-12 18:45:18 +00:00 Commented Apr 12, 2018 at 18:45 $\\begingroup$ @AaronBergman That is useful, thanks a lot. I was thinking Principal bundle comes with a local trivialization... I was thinking Giving another trivialization is like giving another principal bundle structure on same tuple $(\\pi:P\\rightarrow M)$ just like giving another smooth structure on a manifold... Isnt't it the situation? $\\endgroup$ Praphulla Koushik –  Praphulla Koushik 2018-04-13 06:52:05 +00:00 Commented Apr 13, 2018 at 6:52 $\\begingroup$ A principal bundle does not come with a local trivialization -- that's extra structure. I'd say it's like a different atlas of charts on a manifold, not like a different smooth structure. What you'll find is that changing the local trivialization doesn't change the Cech cohomology class. $\\endgroup$ Aaron Bergman –  Aaron Bergman 2018-04-13 12:59:41 +00:00 Commented Apr 13, 2018 at 12:59  |  Show 4 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions dg.differential-geometry gerbes See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 2 Confusion in definition of Gerbes in Hitchin's notes Related 10 Bundle Gerbes as Characteristic Classes 17 Are bundle gerbes bundles of algebras? 7 Connection on a Principal bundle and transition functions, as in Hitchin's notes 2 Confusion in definition of Gerbes in Hitchin's notes 3 holonomy of connection on gerbes 6 Cocycle description of gerbes 7 Understanding the definition of $G$-gerbe 9 How should one think about the band of a gerbe? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 297359, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "dg.differential-geometry,gerbes,dg.differential-geometry,gerbes",
  "scraped_at": "2026-01-14T04:16:29.316015",
  "answer": ""
}