{
  "id": "q_339560",
  "mathoverflow_id": 339560,
  "url": "https://mathoverflow.net/questions/339560/example-of-a-sequence-of-logarithmically-convex-functions-on-mathbbr-and-fo",
  "title": "real analysis - Example of a sequence of logarithmically convex functions on $\\mathbb{R}$ and for all $n\\in\\mathbb{N}$ in the spirit of one evoked in an article",
  "body": "To ask this question I was inspired in some words, if I understand well, from the authors of a preprint on arXiv in section 4.1, that I believe that is [1], to ask next question. We consider the sequence of functions defined on $\\mathbb{R}$ as $$Q_N(x)=\\frac{\\sum_{n=1}^{N+1}(a_n)^{f(x)}}{\\sum_{n=1}^{N}(a_n)^{f(x)}},\\tag{1}$$ where the terms the sequence $(a_n)_{n=1}^\\infty\\neq\\text{ a constant}$ or if you prefer work for the sequence, also under previous requirements $$\\hat{Q}_N(x)=\\frac{\\sum_{n=1}^{N+1}b_n\\cdot(a_n)^{f(x)}}{\\sum_{n=1}^{N}b_n\\cdot(a_n)^{f(x)}},\\tag{2}$$ for an available sequence $(b_n)_{n=1}^\\infty$ used in the purpose to define our sequence $\\hat{Q}_N(x)$ . Question. Can you show an example or set a conjecture of a sequence $Q_N(x)$ , or if your choice is $\\hat{Q}_N(x)$ , such that $\\forall N\\geq 1$ our functions $Q_N(x)$ , or $\\hat{Q}_N(x)$ if you prefer, is log-convex (in $x$ ) on $\\mathbb{R}$ ? Many thanks. Also you can take the function $f(x)$ as you need it. I am looking an example different than was conjectured/evoked by the authors of [1]. If these examples that I evoke are in the literature, refere it and I try to search and read those statements from the literature. I am asking about sequences with good mathematical content and and not trivial from the choice of sequences $(a_n)_{n=1}^{\\infty}$ or $(b_n)_{n=1}^\\infty$ , of the function $f(x)$ . Thus a remarkable example or conjecture in the spirit that show the authors of [1]. I know the definition of what is a log-convex, and equivalent conditions, for example from the Wikipedia Logarithmically convex function. References: [1] J. Arias de Reyna and J. van de Lune, A proof of a trigonometric inequality. A glimpse inside the mathematical kitchen , J. Math. Inequal., Vol 5(3) , 2011. real-analysis inequalities examples convexity convex-analysis Share Cite Improve this question Follow edited Jun 26, 2020 at 5:42 asked Aug 31, 2019 at 12:08 user142929 1 $\\endgroup$ 2 $\\begingroup$ The arXiv article that I've seen is arXiv:1004.0469 I don't know the genuine article from the journal, but I recommend it, of course. $\\endgroup$ user142929 –  user142929 2019-08-31 12:08:53 +00:00 Commented Aug 31, 2019 at 12:08 $\\begingroup$ I've added the tag (inequality) because I think that can be useful, any case if my post has good mathematical content and interesting for MO feel free to remove it and add a more suitable tag. $\\endgroup$ user142929 –  user142929 2019-08-31 12:10:30 +00:00 Commented Aug 31, 2019 at 12:10 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions real-analysis inequalities examples convexity convex-analysis See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 9 Specifying $L^p$ norms of derivatives 4 Extending inequality for $\\ell^p$ from integer $p$ to real $p$ 9 Sort-of converse of Kolmogorov zero-one theorem 3 Sufficient conditions for weak majorization 3 Product of sequences \"slowly\" converging to $0$ 1 Examples of Steffensen's inequality at undergraduated level studies 2 Example of evaluation of $\\int_0^1\\left(\\sum_{k=0}^n (f(x))^k\\right)^{\\alpha}dx$, for some choice of $f(x)$ satisfying certain requirements 2 Example of a conditionally convergent series $\\sum_{n=1}^\\infty b_n$ such that $n^2(b_n-b_{n+1})$ is bounded $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 339560, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "real-analysis,inequalities,examples,convexity,convex-analysis,real-analysis,inequalities,examples,convexity,convex-analysis",
  "scraped_at": "2026-01-14T04:16:45.421702",
  "answer": ""
}