{
  "id": "q_365412",
  "mathoverflow_id": 365412,
  "url": "https://mathoverflow.net/questions/365412/a-series-that-is-algebraic",
  "title": "ac.commutative algebra - A series that is algebraic?",
  "body": "This question is a follow-up of question A series that is rational? . Let $k=\\mathbb F_q(T)$ . Can one prove (or disprove) that the series $\\sum_{n\\ge0}(1-TX^{q^n})Y^{q^n}\\in k[[X,Y]]$ is algebraic over $k(X,Y)$ ? In the mentioned link it is proved that the series does not belong to $k(X,Y)$ . If the series would be $\\sum_{n\\ge0}(1-X^{q^n})Y^{q^n}$ , it is easy to prove... ac.commutative-algebra power-series Share Cite Improve this question Follow edited Jul 11, 2020 at 16:52 asked Jul 11, 2020 at 16:41 joaopa 4,358 1 1 gold badge 17 17 silver badges 24 24 bronze badges $\\endgroup$ 1 13 $\\begingroup$ The series is $f-Tg$ where $f=\\sum_{n\\geq0}Y^{q^n}$ and $g=\\sum_{n\\geq0}(XY)^{q^n}$. Both $f$ and $g$ are algebraic since $f^q-f=-Y$ and $g^q-g=-XY$. $\\endgroup$ Laurent Moret-Bailly –  Laurent Moret-Bailly 2020-07-11 16:52:47 +00:00 Commented Jul 11, 2020 at 16:52 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ac.commutative-algebra power-series See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 9 A series that is rational? Related 18 When are roots of power series algebraic? 3 Growth comparision between an entire function and a related function 11 Derivative of an algebraic power series in positive characteristic 21 Computation of fraction field of formal series over the integers 9 A series that is rational? 3 Eisenstein theorem for algebraic power series in positive characteristic 9 Algebraic power series of finite order 11 In the rational numbers, is every convergent power series a Taylor series for a rational function? 1 Completion of $\\mathbb F_q(T)$ $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365412, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ac.commutative-algebra,power-series,ac.commutative-algebra,power-series",
  "scraped_at": "2026-01-14T04:21:19.694534",
  "answer": ""
}