{
  "id": "q_363511",
  "mathoverflow_id": 363511,
  "url": "https://mathoverflow.net/questions/363511/a-strange-convergence-for-a-semigroup-of-operators",
  "title": "fa.functional analysis - A strange convergence for a semigroup of operators",
  "body": "I am reading B. Simon's \"Kato's inequality and the comparison of semigroups\" , and I am having troubles understanding a part of the proof of Theorem 1 therein, that goes as follows: Let $A,B$ be semibounded self-adjoint operators on some $L^2(M, \\mu)$ , such that $\\mathrm e ^{-t A} f \\ge 0$ for all $f \\ge 0$ . Denote by $D(A)$ the domain of $A$ , and by $Q(A)$ the domain of the quadratic form associated to $A$ . If $| \\mathrm e ^{-t B} u | \\le \\mathrm e ^{-t A} |u|$ for all $u$ , then $u \\in D(B)$ implies $|u| \\in Q(A)$ . The proof should be elementary and straightforward, but I am having difficulties with a certain passing to the limit. Specifically, if $u \\in D(B)$ , then it is clear from the general theory of $1$ -parameter semigroups that $$\\lim _{t \\to 0} \\ \\left( u, \\frac {1 - \\mathrm e ^{-t B}} t u \\right) = (u, Bu) \\ .$$ (Parantheses denote scalar product.) What is not clear to me, though, is why $$\\lim _{t \\to 0} \\ \\left( |u|, \\frac {1 - \\mathrm e ^{-t A}} t |u| \\right) = (|u|, A |u|) \\ .$$ More specifically, why does the limit even exist? And why does $|u| \\in D(A)$ , in order to be able to write $A |u|$ ? Or am I misreading Simon's ideas? fa.functional-analysis operator-theory hilbert-spaces semigroups-of-operators functional-calculus Share Cite Improve this question Follow asked Jun 19, 2020 at 10:12 Alex M. 5,517 11 11 gold badges 39 39 silver badges 56 56 bronze badges $\\endgroup$ 2 5 $\\begingroup$ Simon has the unfortunate habit of sometimes writing something like $(u,A u)$, when he means $q_A(u,u)$, where $q_A$ is the quadratic form associated with $A$. In any case, Ouhabaz' article \"Invariance of Closed Convex Sets and Domination Criteria for Semigroups\" seems to be the better source for domination of semigroups - for example, he gives characterization purely in terms of the quadratic forms where Simon has form and operator domains. $\\endgroup$ MaoWao –  MaoWao 2020-06-19 12:57:12 +00:00 Commented Jun 19, 2020 at 12:57 $\\begingroup$ Simon refers to this explicitly in \" An abstract Kato inequality... \", on page 1068 just after the Definition. $\\endgroup$ András Bátkai –  András Bátkai 2020-08-02 09:10:56 +00:00 Commented Aug 2, 2020 at 9:10 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions fa.functional-analysis operator-theory hilbert-spaces semigroups-of-operators functional-calculus See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 6 closed subspaces of locally convex inductive limits 3 Fractional power of operators in $C_0$-semigroup 1 Generator of an analytic semigroup of operators 21 A strange variant of the Gaussian log-Sobolev inequality 0 The derivative of a $C_0$-semigroup with respect to a perturbation parameter 4 Vague convergence: confusion about the regularity of a signed Radon measure and that of its variation 2 Complex Borel measures: does $\\mu_n \\to \\mu$ weakly imply $|\\mu|(\\Theta) \\le \\liminf_n |\\mu_n|(\\Theta)$ for every open subset $\\Theta$? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363511, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "fa.functional-analysis,operator-theory,hilbert-spaces,semigroups-of-operators,functional-calculus,fa.functional-analysis,operator-theory,hilbert-spaces,semigroups-of-operators,functional-calculus",
  "scraped_at": "2026-01-14T04:24:52.430234",
  "answer": ""
}