{
  "id": "q_364960",
  "mathoverflow_id": 364960,
  "url": "https://mathoverflow.net/questions/364960/independent-inner-functions-on-the-unit-disk",
  "title": "pr.probability - Independent inner functions on the unit disk",
  "body": "This problem cropped up in a paper that I am writing and I have thought about it for too long to no avail: let $\\mathbb{D}$ be the open unit disk in the complex plane and suppose $\\varphi:\\mathbb{D}\\to\\mathbb{D}$ is inner ( $|\\varphi(z)|=1$ a.e. for $z\\in\\partial\\mathbb{D}$ ) with $\\varphi(0)=0$ . Can there exist another inner function $\\psi:\\mathbb{D}\\to\\mathbb{D}$ such that $\\psi(0)=0$ and $\\langle \\varphi^n,\\psi^m\\rangle=0$ for all $n,m\\in\\mathbb{N}$ ? Here, $\\langle \\cdot,\\cdot\\rangle$ is the inner product on the Hardy space $H^2(\\mathbb{D})$ , $$ \\langle f,g\\rangle=\\frac 1 {2\\pi}\\sup_{0\\leq r< 1}\\int_0^{2\\pi}f(re^{i\\theta})\\overline{g(re^{i\\theta})} \\ d\\theta. $$ I am aware that independent holomorphic random variables is an area of interest, but I am nowhere near expert enough to see whether the question is a trivial corollary of some result therein. pr.probability cv.complex-variables inner-product Share Cite Improve this question Follow asked Jul 6, 2020 at 14:07 Alan Wiggins 41 1 1 bronze badge $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions pr.probability cv.complex-variables inner-product See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 5 Proper holomorphic map from unit disk to punctured unit disk 6 Coefficient problem for univalent harmonic functions on unit disk 4 Uniformly Random Independent Unit Vectors Inner Product Limit 2 Mean squared absolute value of inner product of unit vectors 1 Distribution of inner product of random unit vectors 4 Ahlfors theory and inverse branches $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364960, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "pr.probability,cv.complex-variables,inner-product,pr.probability,cv.complex-variables,inner-product",
  "scraped_at": "2026-01-14T04:20:39.248524",
  "answer": ""
}