{
  "id": "q_366208",
  "mathoverflow_id": 366208,
  "url": "https://mathoverflow.net/questions/366208/exit-time-for-brownian-motion-with-stochastic-barriers",
  "title": "pr.probability - Exit time for Brownian motion with stochastic barriers",
  "body": "I am interested in the expected exit time of a one-dimensional Brownian particle from a stochastically evolving interval as follows. Context: If $L_t$ and $R_t$ denote the distance to the left and right boundaries at time $t$ respectively, then the process $(L,R)$ has generator \\begin{multline} Af(l,r) = \\frac{1}{2} ( \\partial^2_{ll} - 2 \\partial^2_{lr} + \\partial^2_{rr})f(l,r) + \\lambda \\bigg\\{ \\int_0^l (f(u,r)-f(l,r))du + \\int_0^\\infty (f(l+s,r)-f(l,r))e^{-s} ds \\bigg\\} \\\\ + \\lambda \\bigg\\{ \\int_0^r (f(l,u)-f(l,r))du + \\int_0^\\infty (f(l,r+s)-f(l,r))e^{-s} ds \\bigg\\}. \\end{multline} for some $\\lambda > 0$ . This process has the following interpretation. If $(L_0,R_0) = (l,r)$ , then a particle, initially at the origin, diffuses until it first exits $(-l,r)$ ; instead here we are evolving the boundaries and waiting until the first time either $L_t=0$ or $R_t = 0$ ; the boundaries are allowed to jump: at rate $\\lambda l$ , the process $L$ jumps to a uniformly chosen point in $(0,l)$ ; at rate $\\lambda$ , the process $L$ jumps to $l + E$ , with $E \\sim \\mathtt{Exponential}(1)$ (independent of everything else); similarly for the right boundary $R$ . It is straightforward to check that $\\phi(l,r) = e^{-(l+r)}$ is a stationary density for the process, ie if $L_0$ and $R_0$ are independent exponential random variables with unit mean, then so are $L_t$ and $R_t$ for all $t$ . That is, \\begin{equation} \\int_0^\\infty \\int_0^\\infty Af(l,r) e^{-(l+r)} dl dr = 0. \\end{equation} Aim: I wish to compute \\begin{equation} \\mathbf{E}_\\phi \\tau = \\int_0^\\infty \\int_0^\\infty \\mathbf{E}[\\tau \\, |\\, L_0 = l, R_0 = r] e^{-l} e^{-r} dl dr, \\end{equation} where \\begin{equation} \\tau = \\inf\\{t\\geq0: L_t R_t = 0\\}, \\end{equation} that is, the expected time to hit either $L_t = 0$ or $R_t =0$ starting from the stationary distribution. Thoughts thus far: In the case that $\\lambda = 0$ , then the problem reduces to the mean first exit time of $(-l,r)$ of a one-dimensional Brownian motion. It is well known that this is given by $lr$ . Although in this setting the boundaries are jumping, since we start from the stationary (exponential distribution), then on average the boundary is a distance 1 to the left and a distance 1 to the right, leading us to guess that $\\mathbf{E}_\\phi \\tau = 1$ . A standard, maybe naive, approach would be to find a solution $g$ the boundary value problem \\begin{equation} \\begin{cases} Ag(l,r)=-1, & \\text{for all } (l,r) \\in (0,\\infty)^2, \\\\ g(0,r) = g(l,0) = 0, & l,r\\in[0,\\infty); \\end{cases} \\end{equation} given which, \\begin{equation} \\mathbf{E}_\\phi \\tau = \\int_0^\\infty \\int_0^\\infty g(l,r) e^{-(l+r)} dl dr. \\end{equation} However, it is not easy to identify a solution. Taking cues from the classical case, with $\\lambda = 0$ , it is straightforward to compute that with \\begin{align} &h(l,r) = lr,\\\\ &Ah(l,r) = -1 + \\lambda \\big\\{ -\\frac{1}{2} l^2 r + r - \\frac{1}{2} l r^2 + l \\big\\}, \\end{align} so that \\begin{equation} L_t R_t -L_0R_0 + t - \\lambda \\int_0^t \\big\\{ -\\frac{1}{2} L_s^2 R_s + R_s - \\frac{1}{2} L_s R_s^2 + L_s \\big\\} ds \\end{equation} is a martingale. Taking $t = \\tau$ and taking expectations with respect to $\\mathbf{E}_\\phi$ , a naive application of Dynkin's formula or the optional stopping theorem would then 'yield' \\begin{equation} \\mathbf{E}_\\phi \\tau = 1 + \\lambda \\mathbf{E}_\\phi \\bigg[ \\int_0^\\tau \\big\\{ -\\frac{1}{2} L_s^2 R_s + R_s - \\frac{1}{2} L_s R_s^2 + L_s \\big\\} ds \\bigg]. \\end{equation} Specific questions: Given stationarity, can I conclude that the expectation on the right hand side here is 0? This isn't trivial because I am integrating up to the stopping time, but very naively passing the expectation under the integral would give zero, as hoped. Broadly, is attempting to solve to the boundary value problem the right approach? What other methods may I try? My approach has been to decompose $A = A_1 + A_2$ , where $A_1$ corresponds to diffusion of the boundaries and $A_2$ corresponds to jumping; I have solved the boundary value problem for $A_1$ . Is there something like a Feynman--Kac correction which would then give me the solution for the whole problem? My PDE knowledge is limited so I would be grateful of even general pointers here. pr.probability ap.analysis-of-pdes stochastic-processes stochastic-differential-equations brownian-motion Share Cite Improve this question Follow asked Jul 21, 2020 at 15:41 as1 91 3 3 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions pr.probability ap.analysis-of-pdes stochastic-processes stochastic-differential-equations brownian-motion See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 2 Recursive parameter estimation for partially observed Ito SDEs 3 On a reflecting Brownian motion and its boundary local time 5 Density near at $0$ for the integral of the positive part of the Brownian motion 0 Hitting probability for mean-reverting stochastic process 4 Joint distribution for sticky Brownian motion 2 Conditional hitting time distribution for OU process between two fixed barriers $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366208, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "pr.probability,ap.analysis-of-pdes,stochastic-processes,stochastic-differential-equations,brownian-motion,pr.probability,ap.analysis-of-pdes,stochastic-processes,stochastic-differential-equations,brownian-motion",
  "scraped_at": "2026-01-14T04:23:53.562210",
  "answer": ""
}