{
  "id": "q_365113",
  "mathoverflow_id": 365113,
  "url": "https://mathoverflow.net/questions/365113/cheeger-constant-of-truncated-hypercube",
  "title": "reference request - Cheeger constant of truncated hypercube",
  "body": "Look at the $d$ -dimensional hypercube and truncate it. This means one replaces each vertex by a cycle (of length $d$ ) in such a way the the new graph is 3-regular. Question 1: What is the asymptotic as $d \\to \\infty$ of the Cheeger (or isoperimetric or conductance) constant of $TQ_d$ ? By asymptotic I mean $\\Theta$ (actually $\\Omega$ is probably enough; see below). I am using the convention: $$ h(G) = \\displaystyle \\min_{|X|\\leq |G|/2} \\frac{|\\partial X|}{|X|} $$ where $|\\partial X|$ is the set of edges between $X$ and $X^\\mathsf{c}$ . But since the graph is 3-regular, the various definitions are equivalent up to multiplicative constants (i.e. they are $\\Theta$ of each other). If you cut the hypercube along an hyperplane (parallel to the coordinate planes), then one gets that $h(TQ_d) \\leq \\frac{1}{d}$ . And I am relatively sure there should be a lower bound (i.e. $h(TQ_d)= \\Omega(\\frac{1}{d})$ but could not find it in the literature. Also, there is a lower bound on $h$ using the spectral gap $\\lambda$ ( $h \\geq K\\lambda$ for some $K$ ). But $\\lambda$ is $O(\\frac{1}{d^2})$ . Note that the upper bound $h \\leq K' \\sqrt{\\lambda}$ implies $h = O(\\frac{1}{d})$ and is coherent with the above. Question 2: does it matter what kind graph one uses to replace the vertices (instead of a cycle)? There are two extreme cases (where the replacement graph has either the best or the worst Cheeger constant): one could either replace a vertex in $Q_d$ by a sequence of expanders $X_d$ (with $|X_d| = d$ and degree bounded by, say, 10) one could replace a vertex by a line (remove one edge from each cycle) In the expander case, it's (hopefully) easy to see that the best \"cuts\" are those from the hypercube. reference-request co.combinatorics graph-theory spectral-graph-theory isoperimetric-problems Share Cite Improve this question Follow asked Jul 8, 2020 at 11:35 ARG 4,736 1 1 gold badge 27 27 silver badges 47 47 bronze badges $\\endgroup$ 1 $\\begingroup$ As an addendum: I did manage to get a lower bound $\\Omega(\\tfrac{1}{d})$ for question 1 and question 2 (in the case of the line). The proof is very clumsy, so I would be thankful if someone could point me to a reference. $\\endgroup$ ARG –  ARG 2020-07-24 23:30:00 +00:00 Commented Jul 24, 2020 at 23:30 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request co.combinatorics graph-theory spectral-graph-theory isoperimetric-problems See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 8 Generalization or Improvement of Cheeger inequality on Graphs 1 Number of 2-connected subsets in the hypercube 12 How to find or constrain \"particularly good\" (two-sided) spectral expanders? 3 Cheeger inequality for the maximal eigenvalue 2 Graphs with edges corresponding to powers of 2 3 Counting cycle vertex covers on hypercube 1 Mapping of subcubes of a $(d+k)$-hypercube onto subcubes of a $d$-hypercube 3 Some questions about induced subgraphs of the directed hypercube graph $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365113, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,co.combinatorics,graph-theory,spectral-graph-theory,isoperimetric-problems,reference-request,co.combinatorics,graph-theory,spectral-graph-theory,isoperimetric-problems",
  "scraped_at": "2026-01-14T04:22:00.064223",
  "answer": ""
}