{
  "id": "q_366972",
  "mathoverflow_id": 366972,
  "url": "https://mathoverflow.net/questions/366972/l-functions-of-symmetric-power-of-elliptic-curves",
  "title": "modular forms - L functions of Symmetric power of elliptic curves",
  "body": "Let $E$ be an elliptic curve over the raional field with conductor $N$ , which corresponds to the eigenform $f(z)=\\sum a_nq^n$ . Let $L(Sym^2E,s)$ be the L function of the symmetric power of $E$ .I am trying to understand a formula in Zagier's paper \"Classical and elliptic polylogarithms and special values of L series\" on Page 36 which can be used to compute $L(Sym^2E,3)$ . Let $L_2(f,s):=\\zeta(s-1)L(Sym^2E,s)=\\sum_{n}b_n/n^s$ . By Rankin's method we have the functional equation $L^{*}_2(f,s)=L^{*}_2(f,3-s)$ , where $L^{*}(f,s)=(2\\pi)^{-2s}N^s\\Gamma(s)\\Gamma(s-1)L_2(f,s)$ . The Gamma factor $\\Gamma(s)\\Gamma(s-1)$ has a relation with the Bessel function: $\\int_{0}^{\\infty}K_v(y)y^s\\frac{dy}{y}=2^{s-2}\\Gamma(\\frac{s+v}{2})\\Gamma(\\frac{s-v}{2})$ See page 106 of Bump's book Automorphic forms and representations. Then Zagier gives the following formula $$L_2(f,3)=C(A-\\frac{A^2}{2})+\\frac{1}{16}\\sum_{n=1}^{\\infty}\\frac{b_n}{n^3}G_1(4\\pi\\sqrt{\\frac{nA}{N}})+\\frac{2^8\\pi^6}{N^3}\\sum_{n=1}^{\\infty}b_nG_2(4\\pi\\sqrt{\\frac{n}{NA}}),$$ Where $$C=2\\pi^2N^{-1}L(Sym^2E,2)$$ and $$G_1(x):=\\int_x^{\\infty}t^4K_1(t)dt$$ and $$G_2(x):=\\int_x^{\\infty}t^{-2}K_1(t)dt$$ Zagier mentioned that the formula $L_2(f,3)$ is obtained by splitting up the integral of the Mellin transform of the K-Bessel function into two pieces in the usual way. I would like to know how this can be done by choosing some $A$ in the formula of $L_2(f,s)$ elliptic-curves modular-forms special-functions l-functions bessel-functions Share Cite Improve this question Follow asked Jul 30, 2020 at 17:29 Dianbin Bao 609 4 4 silver badges 12 12 bronze badges $\\endgroup$ 3 2 $\\begingroup$ The method for passing from a functional equation to computing (approximating) values is due to Lavrik. See Appendix B of Henri Cohen's second book (Advanced topics in computational number theory). Also useful is Buhler, Schoen, and Top (Cycles, L-functions and triple products of elliptic curves) who do the symmetric cube, and 4.4 of Martin and Watkins (Symmetric powers of elliptic curve L-functions). $\\endgroup$ OmniaOperator –  OmniaOperator 2020-07-30 18:40:14 +00:00 Commented Jul 30, 2020 at 18:40 $\\begingroup$ @OmniaOperator, 4.4 of Martin and Watkins use Cauchy residue theorem to shift contour of integration and it turns out to converge really slow as it is the case of Dirichlet series. The method in Zagier's paper use K-bessel function, which speed up the convergence to exponential decay. $\\endgroup$ Dianbin Bao –  Dianbin Bao 2020-07-31 14:22:00 +00:00 Commented Jul 31, 2020 at 14:22 $\\begingroup$ I think the convergence is essentially the same, taking about $N$ terms. My reading of the M-W result is the Mellin transform dies like $O(\\exp(-x^{2/3}))$ and Zagier's dies like $O(\\exp(-\\sqrt x))$ (he uses a degree 4 product, rather than the direct degree 3 symmetric square, so his convergence is marginally slower). Here $x=n/N$. $\\endgroup$ OmniaOperator –  OmniaOperator 2020-07-31 21:37:33 +00:00 Commented Jul 31, 2020 at 21:37 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions elliptic-curves modular-forms special-functions l-functions bessel-functions See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 42 How should an analytic number theorist look at Bessel functions? 2 Expression for infinite sum of two Bessel functions and a power 2 Reference request: the dual Coleman family 3 Complex L-functions for Hermitian modular forms? 6 A Ramanujan style identity involving Bessel sum? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366972, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "elliptic-curves,modular-forms,special-functions,l-functions,bessel-functions,elliptic-curves,modular-forms,special-functions,l-functions,bessel-functions",
  "scraped_at": "2026-01-14T04:26:18.120374",
  "answer": ""
}