{
  "id": "q_365403",
  "mathoverflow_id": 365403,
  "url": "https://mathoverflow.net/questions/365403/lorentzian-cobordism-through-the-dominant-energy-condition",
  "title": "dg.differential geometry - Lorentzian cobordism through the dominant energy condition",
  "body": "Is the answer to the following problem, or some close variant thereof, known? Briefly: Given two initial data sets $I_1=(M,g_1,k_1)$ and $I_2=(M,g_2,k_2)$ , is there a time-oriented spacetime satisfying the dominant energy condition which has both $I_1$ and $I_2$ as Cauchy surfaces? i.e. can two initial data sets be filled in by the dominant energy condition? In more detail: Let $M$ be a smooth manifold, $g_1$ and $g_2$ two Riemannian metrics and $k_1$ and $k_2$ two symmetric 2-tensors. Does there necessarily exist a time-oriented Lorentzian manifold $(N,g')$ satisfying the dominant energy condition into which there are hypersurface embeddings $f_1$ and $f_2$ of $M$ such that: $f_1^\\ast g'=g_1$ and $f_2^\\ast g'=g_2$ $k_1$ and $k_2$ are the second fundamental forms (relative to the time-oriented unit normal) of $f_1$ and $f_2$ every maximally extended timelike geodesic of $(N,g')$ intersects both $f_1(M)$ and $f_2(M)$ exactly once? This seems to be somewhat analogous to a question studied in the Riemannian setting, see e.g. the article of Xue Hu and Yuguang Shi here https://www.emis.de/journals/SIGMA/Gromov.html dg.differential-geometry riemannian-geometry general-relativity Share Cite Improve this question Follow edited Jul 11, 2020 at 13:41 asked Jul 11, 2020 at 13:16 Quarto Bendir 2,297 11 11 silver badges 22 22 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions dg.differential-geometry riemannian-geometry general-relativity See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 1 Extension of groups in Bieberbach's theorem 0 discrete subgroups of the isometries of a product 3 length comparison on negatively curved surfaces 11 Curvature of maximum of two riemannian metrics 2 Equivalence of Sobolev spaces for different metrics 2 stability of two-sided sectional curvature bounds in Lorentzian geometry $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365403, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "dg.differential-geometry,riemannian-geometry,general-relativity,dg.differential-geometry,riemannian-geometry,general-relativity",
  "scraped_at": "2026-01-14T04:21:15.225530",
  "answer": ""
}