{
  "id": "q_366874",
  "mathoverflow_id": 366874,
  "url": "https://mathoverflow.net/questions/366874/decompose-a-power-of-the-radius-as-a-sum-of-squares-of-forms",
  "title": "polynomials - Decompose a power of the radius as a sum of squares of forms",
  "body": "I am interested in a decomposition $$(x_1^2+...+ x_n^2)^d=\\sum_{i=1}^m (P_i(x_1,\\dots,x_n))^2$$ where $d>1$ is odd, $m\\leq n$ , $P_i$ are forms of degree $d$ . Of course, the greatest common divisor for all $P_i$ is 1, to prevent the trivial decomposition with $P_i=x_i(x_1^2+...+ x_n^2)^{(d-1)/2}$ . polynomials Share Cite Improve this question Follow asked Jul 29, 2020 at 15:51 Arimakat 333 2 2 silver badges 7 7 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions polynomials See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 21 Expressing power sum symmetric polynomials in terms of lower degree power sums 4 The irreducibility of an algebraic variety 16 Can you efficiently solve a system of quadratic multivariate polynomials? 3 Moment problem for discrete distributions 2 Polynomial as a sum of powers of linear forms (with restrictions) $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366874, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "polynomials,polynomials",
  "scraped_at": "2026-01-14T04:26:00.223365",
  "answer": ""
}