{
  "id": "q_363195",
  "mathoverflow_id": 363195,
  "url": "https://mathoverflow.net/questions/363195/perturbation-of-a-spacetime-in-general-relativity",
  "title": "dg.differential geometry - Perturbation of a spacetime in general relativity",
  "body": "In general relativity one has the Schwarzchild metric for a non-rotating black hole $g_{SC} = -\\phi^2 \\: dt^2 + \\Bigg(1 + \\frac{m_0}{2r} \\Bigg)^4 \\delta $ and from this one has the spacelike Schwarzchild metric $g = \\Bigg(1 + \\frac{m_0}{2r} \\Bigg)^4 \\delta $ which corresponds to a spacelike slice of the 4D manifold with vanishing extrinsic curvature where $t$ has been set to $0$ . If one takes instead a perturbation of the 4D manifold by some metric $h_{\\alpha \\beta}$ with small components, is the perturbation of the spacelike Schwarzchild metric by the spatial components $h_{i j}$ of the above perturbation a spacelike slice of the perturbed 4D Schwarzchild spacetime and if so, what is the extrinsic curvature of the hypersurface? In the perturbed case the extrinsic curvature is zero, but in this case it must take some general form. For example, the 3D Riemann tensor on a hypersurface $\\Sigma$ can be expressed in terms of the 4D tensor evaluated on $\\Sigma$ , so I'm wondering if something similar can be stated here. dg.differential-geometry riemannian-geometry general-relativity lorentzian-geometry Share Cite Improve this question Follow edited Jun 16, 2020 at 8:44 YCor 67.5k 5 5 gold badges 203 203 silver badges 301 301 bronze badges asked Jun 16, 2020 at 4:26 Hollis Williams 5,481 3 3 gold badges 30 30 silver badges 61 61 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions dg.differential-geometry riemannian-geometry general-relativity lorentzian-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 11 Does the gluing procedure in Robert Wald’s book *General Relativity* yield a Hausdorff spacetime? 2 Induced connection on null hypersurfaces 9 Some Mathematical Questions on Gravitational Waves and Numerical Relativity 16 What's the \"actual\" shape of a black hole accretion disk? 2 stability of two-sided sectional curvature bounds in Lorentzian geometry 3 A question on light cones in Lorentzian manifolds with timelike boundary 5 The Cauchy problem in general relativity, hyperbolic PDEs, and Sobolev spaces on manifolds 3 Definitions fundamental forms and their geometric Intuition $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363195, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "dg.differential-geometry,riemannian-geometry,general-relativity,lorentzian-geometry,dg.differential-geometry,riemannian-geometry,general-relativity,lorentzian-geometry",
  "scraped_at": "2026-01-14T04:10:29.282339",
  "answer": ""
}