{
  "id": "q_363320",
  "mathoverflow_id": 363320,
  "url": "https://mathoverflow.net/questions/363320/question-about-a-paper-on-approximate-identities",
  "title": "fa.functional analysis - Question about a paper on approximate identities",
  "body": "I am currently reading this paper on approximate identities of ternary Banach algebras. Assume that $(A, [.,.,.])$ is a ternary Banach algebra. A bounded net $(e_{\\alpha}, f_{\\alpha})$ is said to be left-bounded approximate identity for $A$ if $\\lim_{\\alpha}[e_{\\alpha}, f_{\\alpha},a]=a$ for all $a \\in A$ . Can someone clarify my following questions on the same paper: What is the definition of bounded net? Also at many places in the same paper for instance in Theorem $2.2$ , the product $e_{\\alpha}f_{\\alpha}$ is used. What is the meaning of product in ternary algebra? All these terms are not explained in paper. Thank you very much in advance! P.S: Copy of the same question On MSE can be found here . fa.functional-analysis oa.operator-algebras c-star-algebras Share Cite Improve this question Follow edited Jun 18, 2020 at 10:16 asked Jun 17, 2020 at 9:56 Math Lover 1,105 6 6 silver badges 13 13 bronze badges $\\endgroup$ 3 2 $\\begingroup$ Having look briefly at the paper you link to, I also cannot make sense of it, because as you say, they repeatedly seem to use a normal \"product\" on a ternary Banach algebra, which is of course not defined. For example, I cannot find a meaning for equation (2.1) $\\endgroup$ Matthew Daws –  Matthew Daws 2020-06-17 10:51:42 +00:00 Commented Jun 17, 2020 at 10:51 $\\begingroup$ @MatthewDaws, exactly it’s not clear what they really meant. $\\endgroup$ Math Lover –  Math Lover 2020-06-17 10:53:52 +00:00 Commented Jun 17, 2020 at 10:53 $\\begingroup$ Cross-posted on Math.StackExchange and now has a very interesting answer... $\\endgroup$ Matthew Daws –  Matthew Daws 2020-06-18 08:08:13 +00:00 Commented Jun 18, 2020 at 8:08 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions fa.functional-analysis oa.operator-algebras c-star-algebras See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 3 Existence of certain bounded approximate identity 4 Finding a special Banach algebra and a net of homomorphisms 2 Trying to understand Haagerup tensor product $B(H)\\otimes_{\\rm h}B(K)$ 4 Does there exists a $C^*$-algebra corresponding to every Banach ternary algebra? 3 Trying to understand construction of $C^*$-algebra corresponding to a ternary $C^*$-ring from a paper 9 Order bounded version of monotone complete $C^*$-algebras $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363320, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "fa.functional-analysis,oa.operator-algebras,c-star-algebras,fa.functional-analysis,oa.operator-algebras,c-star-algebras",
  "scraped_at": "2026-01-14T04:10:45.030547",
  "answer": ""
}