{
  "id": "q_366889",
  "mathoverflow_id": 366889,
  "url": "https://mathoverflow.net/questions/366889/return-map-for-brownian-motion",
  "title": "pr.probability - &quot;Return map&quot; for Brownian motion",
  "body": "Consider a Brownian motion $W$ reflected at the boundary of a domain $D$ in Euclidean space. I want to look at the process obtained by \"restricting\" it to the boundary. I was thinking of taking the local time $L(t)$ at the boundary, and then defining my new process as $W(L^{-1}(t))$ . Is this the appropriate way to do it? Does it define a Markov process on the boundary? If so, what is known about this process for, say, a $d$ -dimensional round ball (eg on its regularity/ size and frequency of jumps)? pr.probability stochastic-processes brownian-motion Share Cite Improve this question Follow edited Jul 29, 2020 at 21:26 Mateusz Kwaśnicki 17.4k 1 1 gold badge 36 36 silver badges 57 57 bronze badges asked Jul 29, 2020 at 17:39 alesia 2,966 11 11 silver badges 23 23 bronze badges $\\endgroup$ 3 4 $\\begingroup$ You probably mean $W(L^{-1}(t))$ which would be a reasonable definition and would give you a Markov process on the boundary that locally looks like a Cauchy process. (In the case of $D$ a half-plane it would precisely be a Cauchy process.) $\\endgroup$ Martin Hairer –  Martin Hairer 2020-07-29 19:35:00 +00:00 Commented Jul 29, 2020 at 19:35 $\\begingroup$ Thank you, that answers it. Fixed the error you mentioned. $\\endgroup$ alesia –  alesia 2020-07-29 20:06:45 +00:00 Commented Jul 29, 2020 at 20:06 3 $\\begingroup$ This has been studied since 1960s, by Molchanov, Hsu, Kolsrud and others. If you like exact references, you may have a look at page 4 of my recent preprint at arXiv:1912.00072 . $\\endgroup$ Mateusz Kwaśnicki –  Mateusz Kwaśnicki 2020-07-29 21:26:20 +00:00 Commented Jul 29, 2020 at 21:26 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions pr.probability stochastic-processes brownian-motion See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 7 Brownian local time density 4 Examples of Lyapunov functions for Markov processes 6 When is $\\mathbf{E}^{x}[f(X_t)]$ a continuous function of $x$? 3 Itô's Formula on a bounded Domain 1 Properties of the Euler Discretization of a diffusion 7 Can all local martingales be represented using only Brownian motion and finite variation processes? 3 On a reflecting Brownian motion and its boundary local time 4 Joint distribution for sticky Brownian motion $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366889, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "pr.probability,stochastic-processes,brownian-motion,pr.probability,stochastic-processes,brownian-motion",
  "scraped_at": "2026-01-14T04:26:04.705160",
  "answer": ""
}