{
  "id": "q_363510",
  "mathoverflow_id": 363510,
  "url": "https://mathoverflow.net/questions/363510/maximum-nonintersecting-interval-pick",
  "title": "reference request - Maximum nonintersecting interval pick",
  "body": "This surely has been solved in the context of scheduling already! (Shall I ask on some computer SE instead?) Assume we have a set of closed \"intervals\" on $\\mathbb Z$ ( $\\mathbb R$ isn't different, I guess) and like to pick the maximum cardinality of nonintersecting intervals from it. I bet the obvious greedy algorithm (first throw out all intervals that completely enclose another, then pick leftmost, repeat) already gives the solution. A reference would suffice. (If the proof is trivial, please leave it to me :-) reference-request co.combinatorics algorithms Share Cite Improve this question Follow edited Jun 19, 2020 at 10:54 YCor 67.5k 5 5 gold badges 203 203 silver badges 301 301 bronze badges asked Jun 19, 2020 at 9:45 Hauke Reddmann 4,859 1 1 gold badge 20 20 silver badges 27 27 bronze badges $\\endgroup$ 2 $\\begingroup$ Is this it? en.wikipedia.org/wiki/Interval_scheduling $\\endgroup$ Ben Barber –  Ben Barber 2020-06-19 11:02:17 +00:00 Commented Jun 19, 2020 at 11:02 1 $\\begingroup$ Bingo and THX! I admit I could have found that myself if I wanted to and weren't too lazy (those summer temperatures :-). Question can be closed, I can find the original literature with a formal proof of the greedy algorithm myself. $\\endgroup$ Hauke Reddmann –  Hauke Reddmann 2020-06-19 11:48:41 +00:00 Commented Jun 19, 2020 at 11:48 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request co.combinatorics algorithms See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 14 Computing the maximum salary 7 Do successive maximum permutations pick latin squares uniformly? 70 How to be rigorous about combinatorial algorithms? 5 Greedy simplices in an ultrametric space (generalized Bhargava $p$-orderings) 2 Partitioning the set of vertices of a convex n-gon into nonintersecting polygons 8 Pick a homogeneous set of size $n$ $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363510, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,co.combinatorics,algorithms,reference-request,co.combinatorics,algorithms",
  "scraped_at": "2026-01-14T04:17:25.418015",
  "answer": ""
}