{
  "id": "q_363924",
  "mathoverflow_id": 363924,
  "url": "https://mathoverflow.net/questions/363924/harnack-inequality-for-fd2u-du-x-f",
  "title": "ap.analysis of pdes - Harnack inequality for $F(D^{2}u, Du,x)=f$",
  "body": "I would like to know if there is an harnack inequality for the viscosity solutions of the following pde in the literature: $F(D^{2}u,Du,x)=f \\in L^{\\infty}(B_{1})$ , for a function $u \\in C(B_{1})$ , and $F$ is uniformly elliptic in matricial entrie. If so, where could you find it? ap.analysis-of-pdes elliptic-pde Share Cite Improve this question Follow asked Jun 23, 2020 at 13:59 Cesare Kalb. 493 2 2 silver badges 10 10 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ap.analysis-of-pdes elliptic-pde See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 Elliptic Harnack inequality for 1D Schrodinger operator? 3 Harnack Inequality 0 Harnack inequaliity for the fractional Laplacian 4 Scaled Harnack inequality $\\sup_{B_r} v \\le c\\,(1-r)^{-p}\\, \\inf_{B_r} v$ 5 Bernstein's corollary for the case of half space 1 Harnack inequality for the minimal surface equation $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363924, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ap.analysis-of-pdes,elliptic-pde,ap.analysis-of-pdes,elliptic-pde",
  "scraped_at": "2026-01-14T04:18:03.907379",
  "answer": ""
}