{
  "id": "q_366566",
  "mathoverflow_id": 366566,
  "url": "https://mathoverflow.net/questions/366566/the-return-of-graham-arithmetics-adding-induction-up-to-g-64",
  "title": "lo.logic - The Return of Graham Arithmetics: adding induction up to $g_{64}$",
  "body": "In my previous question The inconsistency of Graham Arithmetics plus $ \\forall n, n < g_{64}$ , I introduced an extension of Robinson Arithmetics with the recursive definition of Tetraction, a small fragment of arithmetics which I have christened Graham (if someone comes up with a better name, please enter it in comments). I have also added an axiom which makes it (in the conventional sense) inconsistent, by stipulating that Graham number is inaccessible. Thanks to the magnificient answers of Emil Jerabek and Fedor Pakhomov I have a better idea on how much it takes to prove efficiently its inconsistency, and how. Here, let us remove the inaccessibility of Graham number, and add instead a limited induction . Not in the ordinary sense of fragments of arithmetic, which entails restricting the type of formulae for which induction is acceptable. Rather, I want induction UP TO $g_{64}$ :given a formula $A(x)$ $ A(0)\\land (A(x) \\rightarrow \\ A(Sx) \\rightarrow \\ \\forall x (x<g_{64} \\rightarrow \\ A(x))$ So, here Graham number is inaccessible in the sense that induction (without any restriction on A(x)) is limited to all terms which are below it. Now my question: Clearly Graham plus limited induction proves things which are provable in PA (it is a \"straightjacketed\" version of PA, if I may say so). But what else can PA prove about the finite initial segment of numbers below $g_{64}$ beyond what the theory above already knows? Or, assuming that PA proves something about the finite initial segment below Graham's number which is also known by Graham plus limited induction, can PA prove it more efficiently by benefiting from unbridled induction? lo.logic proof-theory peano-arithmetic ultrafinitism Share Cite Improve this question Follow edited Jul 25, 2020 at 20:51 asked Jul 25, 2020 at 19:23 Mirco A. Mannucci 8,048 4 4 gold badges 39 39 silver badges 71 71 bronze badges $\\endgroup$ 6 $\\begingroup$ Let's try Graham Number Arithmetic, or GNumber Arithmetic for short. Gerhard \"I Pronounce It Guhnum Buhr\" Paseman, 2020.07.25. $\\endgroup$ Gerhard Paseman –  Gerhard Paseman 2020-07-25 19:29:51 +00:00 Commented Jul 25, 2020 at 19:29 $\\begingroup$ how about GI2, short for \"Graham Is Inaccessible\"? $\\endgroup$ Mirco A. Mannucci –  Mirco A. Mannucci 2020-07-25 19:32:52 +00:00 Commented Jul 25, 2020 at 19:32 $\\begingroup$ The numeral two makes it confusing. If you must, go for GII. Gerhard \"Yes, Verbs Are Words Too\" Paseman, 2020.07.25. $\\endgroup$ Gerhard Paseman –  Gerhard Paseman 2020-07-25 19:35:24 +00:00 Commented Jul 25, 2020 at 19:35 2 $\\begingroup$ Induction up to $g_{64}$ is already provable in Graham, thus the only effect of postulating it as an axiom schema is to shorten existing proofs. $\\endgroup$ Emil Jeřábek –  Emil Jeřábek 2020-07-25 21:24:09 +00:00 Commented Jul 25, 2020 at 21:24 1 $\\begingroup$ Ok Emil, you are simply too smart for my little game. Yes, of course, for each single term below g(64) I can compute directly what I get from my short induction. But, let us make it worthy of someone like you: can you give a precise sense of the impact of short induction? For instance, suppose I quickly establish A(0) and A(x) implies A(Sx), to leverage my induction schema for a given term t I still have to prove that t is below gl(64), so I have to do some extra work, right? Now, the question for you is, how much I get in making proofs shorter? $\\endgroup$ Mirco A. Mannucci –  Mirco A. Mannucci 2020-07-25 21:29:45 +00:00 Commented Jul 25, 2020 at 21:29  |  Show 1 more comment 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions lo.logic proof-theory peano-arithmetic ultrafinitism See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 14 The inconsistency of Graham Arithmetics plus $ \\forall n, n < g_{64}$ Related 8 Nelson natural number objects in a topos (say) 7 Ultrainfinitism, or a step beyond the transfinite 20 Can FPA really prove its consistency? 12 Is an ultrafinitist Hilbert's program doomed? 1 Does mathematical induction presuppose the existence of a completed infinity? 5 Can a universal induction rule be formulated? 12 When we count the same set, must the number always be the same? 14 The inconsistency of Graham Arithmetics plus $ \\forall n, n < g_{64}$ 5 What oracles make finding isomorphism (of finite structures) easy? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366566, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "lo.logic,proof-theory,peano-arithmetic,ultrafinitism,lo.logic,proof-theory,peano-arithmetic,ultrafinitism",
  "scraped_at": "2026-01-14T04:25:21.517386",
  "answer": ""
}