{
  "id": "q_366046",
  "mathoverflow_id": 366046,
  "url": "https://mathoverflow.net/questions/366046/arithmetic-del-pezzo-surfaces-in-comparison-with-del-pezzo-surfaces-over-a-field",
  "title": "reference request - arithmetic del Pezzo surfaces in comparison with del Pezzo surfaces over a field",
  "body": "A del Pezzo surface is a smooth, 2-dimensional projective variety $X$ with ample anticanonical divisor, i.e. a 2-dimensional Fano variety. I am interested in the arithmetic analogue, a 2-dimensional projective scheme $X$ with a relative 1-dimensional morphism to a Dedekind scheme $X \\to S$ , such that the anticanonical divisor is ample. It would be sensible to require $X$ to be a regular scheme, but I would prefer not to require the structure morphism to $S$ to be smooth, as I would like to coexist peacefully with fibers of bad reduction. I am typically thinking of $S = \\mathrm{Spec}(\\mathbb{Z}), \\mathrm{Spec}(\\mathbb{Z}_p), \\mathrm{Spec}(\\mathbb{F}_q[t]), \\mathbb{P}^1_{\\mathbb{F}_q}$ , or finite extensions. Question : In what way are such objects analogous (or not) to del Pezzo surfaces over a field? By this I mean in terms of their intrinsic properties, and in how they may be distinguished from other surfaces in their respective area. Classical del Pezzo surfaces are quite special. Is there a specific name for such schemes? Some good references to read about them? I hoped to find something in Qing Liu's nice book, but have not found anything yet. reference-request arithmetic-geometry schemes algebraic-surfaces fano-varieties Share Cite Improve this question Follow edited Jul 19, 2020 at 20:30 asked Jul 19, 2020 at 19:43 PrimeRibeyeDeal 1,358 1 1 gold badge 12 12 silver badges 17 17 bronze badges $\\endgroup$ 4 3 $\\begingroup$ Since $X \\to S$ is of relative dimension $1$, a smooth fibre must be a $\\mathbf P^1$ if the relative anticanonical is ample. So this is more analogous to a ruled surface than a del Pezzo... $\\endgroup$ R. van Dobben de Bruyn –  R. van Dobben de Bruyn 2020-07-19 19:48:54 +00:00 Commented Jul 19, 2020 at 19:48 1 $\\begingroup$ @R.vanDobbendeBruyn Thanks. How does one prove this? I suspected the fibers would generally be simple, and perhaps you're right that a ruled surface is the better analogy. However I am particularly interested in the del Pezzo/Fano condition on the anticanonical bundle, as well as in the nonsmooth fibers, where the bulk of the action lies. $\\endgroup$ PrimeRibeyeDeal –  PrimeRibeyeDeal 2020-07-19 20:28:17 +00:00 Commented Jul 19, 2020 at 20:28 1 $\\begingroup$ Do you know Alessio Corti's paper \"Del Pezzo surfaces over Dedekind schemes\"? arxiv.org/pdf/alg-geom/9505036.pdf $\\endgroup$ Francesco Polizzi –  Francesco Polizzi 2020-07-19 22:22:05 +00:00 Commented Jul 19, 2020 at 22:22 $\\begingroup$ @FrancescoPolizzi No, I don't. Thank you, it does look interesting, but it appears to me to be one dimension too large for me. Is there a straightforward relationship? Of note is that the special fiber, an arithmetic surface, will never be mixed characteristic, which excludes the cases of most interest to me. $\\endgroup$ PrimeRibeyeDeal –  PrimeRibeyeDeal 2020-07-19 22:31:58 +00:00 Commented Jul 19, 2020 at 22:31 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request arithmetic-geometry schemes algebraic-surfaces fano-varieties See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 24 Hyperbolic Coxeter polytopes and Del-Pezzo surfaces 6 Del pezzo surfaces in positive characteristic 23 Del Pezzo surfaces and homotopy groups of spheres 6 Del Pezzo surfaces of degree $2$ 8 Why only some del Pezzo are toric? 1 Projection from point on line on quintic del Pezzo surface $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366046, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,arithmetic-geometry,schemes,algebraic-surfaces,fano-varieties,reference-request,arithmetic-geometry,schemes,algebraic-surfaces,fano-varieties",
  "scraped_at": "2026-01-14T04:23:33.392467",
  "answer": ""
}