{
  "id": "q_366614",
  "mathoverflow_id": 366614,
  "url": "https://mathoverflow.net/questions/366614/holomorphic-maps-on-moduli-space-and-deformation-theory",
  "title": "dg.differential geometry - Holomorphic maps on moduli space and Deformation theory",
  "body": "Let $\\mathcal{M},\\mathcal{F}$ be the classifiying spaces (i.e. complex manifolds) of two (possibly) different moduli problem. To give a map $$f:\\mathcal{M}\\rightarrow \\mathcal{F}$$ means that for each object classified by $\\mathcal{M}$ , we must associate an object classified by $\\mathcal{F}$ . Now if I want to show that this map is holomorphic, then the way I've seen this often done is that you need to use some explicit local parametrization of both $\\mathcal{M}$ and $\\mathcal{F}$ . However, I wonder if this can not be done in a deformation theoretic way. Intuitively, infinitesimal deformations of an object $m\\in\\mathcal{M}$ corresponds to the tangent space of our manifold, and if we assume that our moduli space is smooth, it would thus also correspond to a \"small\" neighborhood of $m$ . Since we only need to show that in sufficienttly small neighborhoods of point, the map is a power series, I feel like that the stalk $\\mathcal{O}_{\\mathcal{M},m}$ should \"see\" the holomorphicity. As a concrete example, consider the moduli space of surfaces $\\mathcal{M}_{g,n}$ and the flag variety $\\mathcal{Fl}$ . To each $[X,x_1,\\ldots,x_n]\\in \\mathcal{M}_{g,n}$ we can associate the flag $F^p(H^k(X,\\mathbb{C}))$ . It is known by the work of Griffiths that this map is holomorphic. Can this be proven by studying how the period map behaves at the Teichmüller space $\\mathcal{T}_g$ ? dg.differential-geometry complex-geometry moduli-spaces deformation-theory teichmuller-theory Share Cite Improve this question Follow asked Jul 26, 2020 at 14:06 curious math guy 4,438 10 10 silver badges 36 36 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions dg.differential-geometry complex-geometry moduli-spaces deformation-theory teichmuller-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 8 Moduli 'space' of stacks? 3 Moduli, Teichmüller spaces and mapping class group of a sphere with four punctures 8 Explicit example de Rham moduli space of connections $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366614, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "dg.differential-geometry,complex-geometry,moduli-spaces,deformation-theory,teichmuller-theory,dg.differential-geometry,complex-geometry,moduli-spaces,deformation-theory,teichmuller-theory",
  "scraped_at": "2026-01-14T04:25:26.336670",
  "answer": ""
}