{
  "id": "q_365394",
  "mathoverflow_id": 365394,
  "url": "https://mathoverflow.net/questions/365394/are-category-of-perfect-groups-and-acyclic-space-equivalent",
  "title": "at.algebraic topology - Are category of perfect groups and acyclic space equivalent?",
  "body": "Here is my approach to relate two subcategories of $\\textbf{hTop}$ and $\\textbf{Gp}$ respectively: Let $\\mathcal{C}$ denote the full subcategory of $\\textbf{hToP}$ consisting of acyclic( i.e. reduced homology in all degree is zero ) CW complex and $\\mathcal{D}$ denote the category of perfect groups (i.e. commutator is itself). There is functor $\\mathcal{F} = \\pi_{1} : \\mathcal{C} \\rightarrow \\mathcal{D}$ takes space $X$ to its fundamental group $\\pi_{1}(X)$ . We have also another functor $\\mathcal{G} : \\mathcal{D} \\rightarrow \\mathcal{C}$ given as if $P$ is any perfect group then define $\\mathcal{G}$ (P) to be the homotopy fiber of the plus construction map $ BP \\rightarrow BP^{+}$ . The above two functors seems too natural to me. So mine natural questions are the following: Are $\\mathcal{C}$ and $\\mathcal{D}$ equivalent categories? Is $\\mathcal{F}$ related to $\\mathcal{G}$ (I mean whether they are in adjunction, equivalence pair etc.)? I computed the composition $\\mathcal{FoG}$ : Let $P$ be a perfect group and $F(f)$ denote the homotopy fiber of $ BP \\rightarrow BP^{+}$ . Then $\\mathcal{FoG}(P) = \\pi_{1}(F(f))$ and the counit map $\\mathcal{FoG}(P) = \\pi_{1}(F(f)) \\rightarrow P $ is the universal central extension map which in particular says that if we again repeat the same process turns out to be identity. So this is in a way saying that $\\mathcal{FoG}$ may not be identity but its square is identity. I don't know what it means. Any help would be appreciated. at.algebraic-topology homotopy-theory Share Cite Improve this question Follow edited Jul 11, 2020 at 14:31 Tom Goodwillie 57.8k 8 8 gold badges 155 155 silver badges 247 247 bronze badges asked Jul 11, 2020 at 11:22 Sunny 629 4 4 silver badges 10 10 bronze badges $\\endgroup$ 3 2 $\\begingroup$ I think you can deduce that the answer to 1 is negative by using [Dror, Emmanuel. “Acyclic Spaces.” Topology 11, no. 4 (December 1, 1972): 339–48. doi.org/10.1016/0040-9383(72)90030-4.] actually, constructing a wide range of explicit examples of why this fails. IMHO your heuristics would be very similar to thinking that the homotopy category of pointed spaces (connected CW-complexes) were equivalent to the category of groups via the fundamental group. $\\endgroup$ Fernando Muro –  Fernando Muro 2020-07-12 01:13:47 +00:00 Commented Jul 12, 2020 at 1:13 1 $\\begingroup$ A suitable localization of the category of groups gives an equivalence between the category of perfect groups and the homotopy category of simply connected spaces. The equivalence is given by the quillen plus construction $\\endgroup$ GSM –  GSM 2020-07-12 15:34:07 +00:00 Commented Jul 12, 2020 at 15:34 $\\begingroup$ For more details, take a look to Kan-Thurston article and Baumslag article. $\\endgroup$ GSM –  GSM 2020-07-12 15:46:30 +00:00 Commented Jul 12, 2020 at 15:46 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions at.algebraic-topology homotopy-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 7 The geometric meaning of the higher quotient by the commutant ideal 7 On the natural (bigraded) homotopy groups of a simplicial object in a model category 0 The First Homology Group of Configuration Space and Knot Theory 6 What is the homotopy fiber of the map from a space to its James construction? 5 $E_n$-space and n-connected pointed space 17 Example of an unstable map between finite complexes which is the identity on homotopy but not homotopic to the identity? 1 Relation between transport functor of a fibration and a Hurewicz connection on it 6 Definition of geometric monodromy 9 The center of $\\mathbf{hTop}$ 3 Connective covers of based spaces $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365394, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "at.algebraic-topology,homotopy-theory,at.algebraic-topology,homotopy-theory",
  "scraped_at": "2026-01-14T04:21:10.753453",
  "answer": ""
}