{
  "id": "q_363573",
  "mathoverflow_id": 363573,
  "url": "https://mathoverflow.net/questions/363573/is-there-a-name-for-and-or-reasonably-nice-characterisation-of-mixingly-physica",
  "title": "reference request - Is there a name for and/or reasonably nice characterisation of &quot;mixingly physical&quot; measures?",
  "body": "Let $M$ be a Riemannian manifold with volume measure $\\lambda$ , let $f \\colon M \\to M$ be a diffeomorphism, and let $\\mu$ be a probability measure on $M$ with compact support. As stated in the question Is there a name for a \"stable\" physical measure? , there are several different definitions of what it means for $\\mu$ to be a \"physical\" measure. One possible defintion is as follows: Definition. The measure $\\mu$ is a physical measure of $f$ is there exists a neighbourhood $U$ of $\\mathrm{supp}\\,\\mu$ such that for every probability measure $\\nu$ with $\\nu(U)=1$ that is absolutely continuous with respect to $\\lambda$ , we have $$ \\frac{1}{n} \\sum_{i=0}^{n-1} f^i_\\ast\\nu \\ \\overset{\\text{weakly}}{\\to} \\ \\mu \\quad \\text{as } n \\to \\infty.$$ A simple example is when $f$ has a stable fixed point or stable periodic orbit $A$ , and $\\mu$ is the equal-weight distribution on $A$ . However, I now want the convergence to hold without the Cesàro averaging; so, for example, this would exclude the case of a non-trivial periodic orbit. Definition. The measure $\\mu$ is a mixingly physical measure of $f$ is there exists a neighbourhood $U$ of $\\mathrm{supp}\\,\\mu$ such that for every probability measure $\\nu$ with $\\nu(U)=1$ that is absolutely continuous with respect to $\\lambda$ , we have $$ f^n_\\ast\\nu \\ \\overset{\\text{weakly}}{\\to} \\ \\mu \\quad \\text{as } n \\to \\infty.$$ For example, in the notes of Marcelo Viana at http://w3.impa.br/~viana/out/sdds.pdf in Section 4 (starting at p79), the SRB measure on a uniformly hyperbolic attractor is a \"mixingly physical measure\". (Proposition 4.9 on p97 gives this fact with a description of the rate of the mixing behaviour.) My question: Is there a name for what I have called a \"mixingly physical measure\"? And/or is there any simple characterisation of mixingly physical measures? (E.g. \" $\\mu$ is mixingly physical if and only if $\\mu$ is both mixing and physical\", or \" $\\mu$ is mixingly physical if and only if $\\mu$ is physical and $f$ is a mixing nonsingular transformation of $(M,\\mathcal{B}(M),\\lambda(\\,\\cdot\\,\\cap U))$ \"?) reference-request ds.dynamical-systems ergodic-theory terminology Share Cite Improve this question Follow edited Jun 22, 2020 at 23:58 RobPratt 5,784 1 1 gold badge 16 16 silver badges 27 27 bronze badges asked Jun 19, 2020 at 21:16 Julian Newman 848 8 8 silver badges 31 31 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request ds.dynamical-systems ergodic-theory terminology See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 5 Is there a name for a \"stable\" physical measure? Related 7 Quantitative approximation of invariant measures by periodic ones 4 When entropy SRB measure is zero 5 Is there a name for a \"stable\" physical measure? 1 Is a “uniformly minimal” dynamical system ergodic? 5 Ergodic measures for the logistic map 5 An example of an SRB measure which is not a physical measure 1 Does the \"random Krylov-Bogolyubov theorem\" hold in a non-skew-product setting? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363573, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,ds.dynamical-systems,ergodic-theory,terminology,reference-request,ds.dynamical-systems,ergodic-theory,terminology",
  "scraped_at": "2026-01-14T04:19:26.440383",
  "answer": ""
}