{
  "id": "q_363470",
  "mathoverflow_id": 363470,
  "url": "https://mathoverflow.net/questions/363470/reference-for-the-algorithm-to-find-the-intersection-between-a-subspace-and-posi",
  "title": "linear algebra - Reference for the algorithm to find the intersection between a subspace and positive orthant",
  "body": "I came across this algorithm, in this question Algorithm for the intersection of a vector subspace with a cone of non-negative vectors ; Is there any reference for the algorithm described in the question? linear-algebra algorithms linear-programming Share Cite Improve this question Follow asked Jun 18, 2020 at 18:30 Marcelo Pedro 53 4 4 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions linear-algebra algorithms linear-programming See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 5 Algorithm for the intersection of a vector subspace with a cone of non-negative vectors Related 5 Algorithm for the intersection of a vector subspace with a cone of non-negative vectors 0 Need help to find an efficient algorithm for the following problem! 0 Intersection between a line and an n-dimensional parallelotope 1 Algorithm for checking positive definite matrix over a subspace 2 Intersection of a vector subspace with a cone 1 Intersection of a closed convex cone with the non-negative orthant $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363470, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "linear-algebra,algorithms,linear-programming,linear-algebra,algorithms,linear-programming",
  "scraped_at": "2026-01-14T04:17:13.029142",
  "answer": ""
}