{
  "id": "q_365106",
  "mathoverflow_id": 365106,
  "url": "https://mathoverflow.net/questions/365106/which-posets-can-occur-from-commutative-frobenius-algebras",
  "title": "rt.representation theory - Which posets can occur from commutative Frobenius algebras?",
  "body": "Let $A$ be a commutative Frobenius algebra. We can assume that $A$ is local and $A=K[x_i]/(I)$ for some variables $x_1,...,x_n$ and an admissible ideal. Then the non-zero monomials $u_i$ (including 1) form a basis of $A$ and we can look at the poset of submodules of the form $X_i=u_i A$ . (in case this is needed, assume $I$ only contains field elements 0,-1 and 1. Im not sure whether it might cause problems with regard to uniqueness when other field elements might be allowed). This poset is bounded. For example when $A=K[x_1,...,x_n]/(x_i^2)$ then the poset is the Boolean lattice, but not every bounded poset can occur, for example when the top of the poset covers a unique elements then the poset must be a chain (and $A=K[x]/(x^n)$ ). Question: Is there a (homological) characterisation which posets can occur from commutative Frobenius algebras? rt.representation-theory homological-algebra posets Share Cite Improve this question Follow edited Jul 8, 2020 at 9:55 asked Jul 8, 2020 at 9:47 Mare 28.3k 7 7 gold badges 26 26 silver badges 117 117 bronze badges $\\endgroup$ 2 1 $\\begingroup$ Can you please clarify what you mean by \"$I$ only contains field elements $0$, $-1$, and $1$\" ? $\\endgroup$ Zach Teitler –  Zach Teitler 2020-07-08 10:05:18 +00:00 Commented Jul 8, 2020 at 10:05 1 $\\begingroup$ @ZachTeitler $I$ is generated by elements $r_i$ and in these relations you can only find field elements 0,1,-1. So for example $r_i=xyx$ is ok but $r_i=xyx-3*yxy$ not. But Im not sure whether this matters, probably not. $\\endgroup$ Mare –  Mare 2020-07-08 11:57:39 +00:00 Commented Jul 8, 2020 at 11:57 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions rt.representation-theory homological-algebra posets See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 5 Frobenius algebras from symmetric polynomials 9 Ext for commutative Gorenstein algebras $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365106, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "rt.representation-theory,homological-algebra,posets,rt.representation-theory,homological-algebra,posets",
  "scraped_at": "2026-01-14T04:20:55.013649",
  "answer": ""
}