{
  "id": "q_366970",
  "mathoverflow_id": 366970,
  "url": "https://mathoverflow.net/questions/366970/potential-p-norm-on-tuples-of-positive-operators",
  "title": "fa.functional analysis - Potential p-norm on tuples of positive operators",
  "body": "This is a follow-up to this question on p-norms of tuples of operators. Consider $\\left[\\begin{matrix} A \\\\ B \\end{matrix}\\right] \\in B(H)^2_+$ , meaning $A,B\\geq 0$ , and define $$ \\left\\|\\left[\\begin{matrix} A \\\\ B \\end{matrix}\\right]\\right\\|_p = \\|(A)^p + (B)^p\\|^{1/p}. $$ The previous question's answer conclusively showed that the generalization of the above is a norm only when $p=2$ . However, the proof does not immediately transfer to this more limited situation (at least I can't see how to do it). In this new case, it is obvious that this satisfies the triangle inequality on the positive cone for $p=1$ and $p=2$ . Q: For which $p$ does $\\|\\cdot\\|_p$ satisfy the triangle inequality on $B(H)^2_+$ ? If the answer is \"no\" for some $p$ then I would be very interested in a specific example as well as a more general result. Edit: If this is established for any given p then one can create a norm via Haagerup's decomposition ideas. fa.functional-analysis linear-algebra matrices oa.operator-algebras Share Cite Improve this question Follow edited Aug 4, 2020 at 22:02 asked Jul 30, 2020 at 17:23 Chris Ramsey 3,964 3 3 gold badges 20 20 silver badges 43 43 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions fa.functional-analysis linear-algebra matrices oa.operator-algebras See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 6 Potential p-norm on tuples of operators Related 9 2-norm of the upper triangular \"all-ones\" matrix 3 norm of the matrix series 10 Partial inverse of a matrix - or does it have its own name? 15 Bounding the matrix norm of a commutator $[A,B]$ in terms of the norms of $A$ and $B$ 1 Norm numerical range 9 An inequality related to Riesz–Thorin theorem, determinants and $L_p$ norm 2 A norm inequality for operators 6 Potential p-norm on tuples of operators $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366970, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "fa.functional-analysis,linear-algebra,matrices,oa.operator-algebras,fa.functional-analysis,linear-algebra,matrices,oa.operator-algebras",
  "scraped_at": "2026-01-14T04:27:47.259959",
  "answer": ""
}