{
  "id": "q_363963",
  "mathoverflow_id": 363963,
  "url": "https://mathoverflow.net/questions/363963/convolution-integral-equation-on-a-compact-subset-of-the-real-line",
  "title": "Convolution Integral Equation on a compact subset of the real line",
  "body": "I am dealing with the following equation: $$ f(x) = g(x) + \\intop_{X} dt K(x-t)f(t) \\;,\\qquad \\left\\lbrace \\begin{array}{c}f(x)>0\\;,\\;x\\in X \\\\ f(x)<0\\;,\\;x\\notin X \\end{array}\\right.$$ where $X$ is a compact, not necessarily connected, subset of $\\mathbb R$ and $$ g(x) = -\\cosh x \\;,$$ and $K(x)$ is a function in $L^2(\\mathbb R)$ . The subset $X$ is to be treated as an unknown, to be determined self-consistently by the requirements on the positivity of the function $f(x)$ . Hence, by solution to the above equation I mean a function $f(x)$ together with a subset $X$ . A specific case is $X = [-A,A]$ and $$ K(x) = \\frac{1}{2\\pi}\\sum_{\\sigma,\\sigma'=\\pm1}\\frac{1}{\\cosh\\left(x+\\sigma\\theta+i\\sigma'\\gamma\\right)}\\;,$$ but I would like to keep things more general. My question consists of two parts: there exist known results on existence and uniqueness of solutions? is there a known procedure to solve this equation for $f(x)$ and $X$ ? I tried to extend the method of Wiener and Hopf, but I do not seem to be getting anywhere useful. Thanks, Stefano integral-operators convolution Share Cite Improve this question Follow asked Jun 23, 2020 at 22:03 Stefano 105 6 6 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions integral-operators convolution See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 2 solution uniqueness of non-linear Fredholm equations 5 Variance of convolution between filter $A$ and Ornstein-Uhlenbeck process $x_t$ 2 Delta-distribution composed with a function from the Fourier representation 4 Nonlinear system of integral equations 1 Existence of solutions to a series of integral equations 3 Where to find or how to establish a general formula for the improper integral $\\int_{0}^{\\infty}\\frac{\\sin t}{t}(\\ln t)^k\\operatorname{d\\!} t$? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363963, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "integral-operators,convolution,integral-operators,convolution",
  "scraped_at": "2026-01-14T04:18:12.909432",
  "answer": ""
}