{
  "id": "q_365748",
  "mathoverflow_id": 365748,
  "url": "https://mathoverflow.net/questions/365748/projecting-a-vector-onto-a-random-subspace",
  "title": "pr.probability - Projecting a vector onto a random subspace",
  "body": "Let $A\\in\\mathbb{R}^{k\\times d}$ be matrix with i.i.d. $\\mathcal{N}(0,1/k)$ entries with $k<d$ , and let $B=A^{\\top}A$ . I would like to compute the distribution of $Bx$ where $x\\in\\mathbb{R}^{d}$ is a fixed vector. The matrix $B$ essentially projects onto a $k$ -dimensional subspace of $\\mathbb{R}^{d}$ (it has rank $k$ almost surely). However, computing the distribution explicitly using the expression for entries of $Bx$ is tricky since the entries are dependent. Any hints on how to proceed? pr.probability random-matrices gaussian geometric-probability Share Cite Improve this question Follow asked Jul 16, 2020 at 4:23 nemo 119 3 3 bronze badges $\\endgroup$ 8 $\\begingroup$ Seems like it would depend a lot on what $x$ exactly is. Consider the case that $k=1$. Then if $x = e_1$ then $Bx$ will depend a lot on just one random gaussian versus the case where $x$ is the all ones vector. $\\endgroup$ Sandeep Silwal –  Sandeep Silwal 2020-07-16 14:02:23 +00:00 Commented Jul 16, 2020 at 14:02 $\\begingroup$ @SandeepSilwal Yes, the distribution of $Bx$ will be parameterized by $x$. The mean $\\mathbb{E}[Bx]$ is clearly $x$, but it is not clear what the distribution is. $\\endgroup$ nemo –  nemo 2020-07-17 06:54:20 +00:00 Commented Jul 17, 2020 at 6:54 1 $\\begingroup$ Just for fun, I made a few simulations for different x's. The first indications are that the solution seems far from easy to obtain. Some marginals of the vector obtained look Gaussian, some other absolutely don't and I did not even start digging into dependence patterns. Is there any setting in which you naturally encounter this question ? $\\endgroup$ Gilles Mordant –  Gilles Mordant 2020-07-18 10:42:38 +00:00 Commented Jul 18, 2020 at 10:42 $\\begingroup$ @GillesMordant Thanks for taking the effort to perform a simulation! I was studying random projections and this came to mind. Usually, one would map $x\\in\\mathbb{R}^d$ to a smaller vector $Ax\\in\\mathbb{R}^{k}$. But $A^{\\top}Ax$ also ``effectively'' does the same thing: its range is a $k$-dimensional subspace of $\\mathbb{R}^{d}$. I was curious to see what the points in the range would be distributed like. $\\endgroup$ nemo –  nemo 2020-07-18 11:06:22 +00:00 Commented Jul 18, 2020 at 11:06 1 $\\begingroup$ It could also be possible that your question can be rewritten as a function of an order two non-decoupled Gaussian chaos, which has been studied in the literature. I however never came across distributional results. I hope this is not a misleading track... $\\endgroup$ Gilles Mordant –  Gilles Mordant 2020-07-18 11:35:00 +00:00 Commented Jul 18, 2020 at 11:35  |  Show 3 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions pr.probability random-matrices gaussian geometric-probability See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 12 Expected values of traces of products of random matrices 0 distinguishing random orthogonal matrix from Gaussian random matrix 4 Rank of a fat random matrix 2 Independent Decomposition of a Random Vector 2 Variance of projection of vectors onto random subspace 1 Interpretation of Bai-Yin theorem and a question about (Hastie, Montanari, Rosset & Tibshirani) 3 Orthogonal projection $X X^+$ from random Gaussian matrix $X$ 5 Minimal assumptions on distribution for computing expected Kronecker product $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365748, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "pr.probability,random-matrices,gaussian,geometric-probability,pr.probability,random-matrices,gaussian,geometric-probability",
  "scraped_at": "2026-01-14T04:25:05.840874",
  "answer": ""
}