{
  "id": "q_364724",
  "mathoverflow_id": 364724,
  "url": "https://mathoverflow.net/questions/364724/antipodal-vertices-in-spectral-graph-embeddings",
  "title": "co.combinatorics - Antipodal vertices in spectral graph embeddings",
  "body": "Suppose your are given an antipodal graph $G=(V,E)$ , that is, for every vertex $v\\in V$ there is a unique maximally distant vertex $v'\\in V$ . Under which condistions does the following hold: If $\\theta_2$ denotes the second-largest eigenvalue of $G$ (i.e., of its adjacency matrix), then for every $\\theta_2$ -eigenvector $u\\in\\Bbb R^V$ we have $u_v=-u_{v'}$ for all $v\\in V$ . For example, is this true if $G$ is walk-regular , (resp. vertex-transitive) is 1-walk-regular (resp. vertex- and edge-transitive, or arc-transitive), is distance-regular (resp. distance-transitive), or has a symmetry $\\phi\\in\\mathrm{Aut}(G)$ mapping $v\\mapsto v'$ for all $v\\in V$ . Especially in the last case I can imagine that we have $u_v = \\pm u_{v'}$ for all $v\\in V$ and eigenvectors $u\\in \\smash{\\Bbb R^V}$ of $G$ (not necessarily to $\\theta_2$ ). But I am specifically interested in the case $\\theta_2$ and whether we then always have the negative sign. co.combinatorics graph-theory eigenvalues spectral-graph-theory graph-distance Share Cite Improve this question Follow edited Jul 3, 2020 at 8:37 asked Jul 3, 2020 at 8:26 M. Winter 14.7k 3 3 gold badges 31 31 silver badges 83 83 bronze badges $\\endgroup$ 3 $\\begingroup$ Do you have any evidence/heuristics for why this should hold in some cases? Also what is special about $\\theta_2$? $\\endgroup$ Antoine Labelle –  Antoine Labelle 2020-07-18 01:50:27 +00:00 Commented Jul 18, 2020 at 1:50 $\\begingroup$ @AntoineLabelle My intuition comes from spectral embeddings of $G$, where you assign points in Euclidean space to the vertices of $G$, and you do this by somehow using the eigenvectors of $G$ to some eigenvalue. It seems to be common intuition, that the $\\theta_2$-embedding is \"as expanded as possible\" (imagine the vertices as repelling each other, but the edges keeping them together, and then the $\\theta_2$-embedding is an equilibrium configuration under these condition). And to be as expanded as possible, it is plausible that antipodal vertices are embedded opposite to each other. $\\endgroup$ M. Winter –  M. Winter 2020-07-18 08:48:15 +00:00 Commented Jul 18, 2020 at 8:48 $\\begingroup$ @AntoineLabelle My evidence is that it holds for all the graphs I have checken (e.g. the skeletons of regular polytopes, but also many others). $\\endgroup$ M. Winter –  M. Winter 2020-07-18 08:52:09 +00:00 Commented Jul 18, 2020 at 8:52 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions co.combinatorics graph-theory eigenvalues spectral-graph-theory graph-distance See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 6 An eigenvalue upper bound for 1-walk-regular graphs Related 3 Spectral gap for random bipartite regular graphs 5 Second eigenvalue of suspension of a graph 1 Symmetry preserving graph products 8 Does the clique-coclique bound hold for all walk-regular graphs? 3 Local-Global Principle in Graph Spectrum 11 Representations of the automorphism group of graphs via spectral graphs theory 6 An eigenvalue upper bound for 1-walk-regular graphs 3 Spectral properties of half-transitive graphs 0 If there are eigenvectors with largest components $i$ resp. $j$, then is there an eigenvector with two largest components $i$ and $j$? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364724, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "co.combinatorics,graph-theory,eigenvalues,spectral-graph-theory,graph-distance,co.combinatorics,graph-theory,eigenvalues,spectral-graph-theory,graph-distance",
  "scraped_at": "2026-01-14T04:21:55.578461",
  "answer": ""
}