{
  "id": "q_368654",
  "mathoverflow_id": 368654,
  "url": "https://mathoverflow.net/questions/368654/constructing-representations-of-a-topological-group-from-characteristic-polynomi",
  "title": "gr.group theory - Constructing representations of a topological group from characteristic polynomials of a generating set",
  "body": "Given a topological group $G$ and a subset $S$ of $G$ that topologically generates it, what are the conditions under which an $n$ -dimensional continuous linear representation of $G$ over an algebraically closed topological field $k$ can be constructed once we have specified a collection of degree $n$ polynomials with coefficients in $k$ as the characteristic polynomials of the images of elements of $S$ ? In other words, when can a continuous homomorphism $\\rho: G \\rightarrow GL_n(k)$ be constructed from the data $\\{c(\\rho (s)) \\in k[x]: s \\in S\\}$ where $c(a)$ is the characteristic polynomial of $a$ ? Under which further conditions if any is such a representation uniquely determined? Is there an algorithm for constructing it from the collection of characteristic polynomials? Finally what if we don't require that $k$ be algebraically closed? Assuming that $k$ is a field of characteristic 0 would be fine, although I am also interested in the characteristic $p$ case. gr.group-theory rt.representation-theory linear-algebra topological-groups Share Cite Improve this question Follow edited Aug 8, 2020 at 21:42 YCor 67.5k 5 5 gold badges 203 203 silver badges 301 301 bronze badges asked Aug 8, 2020 at 16:52 SHS 21 2 2 bronze badges $\\endgroup$ 2 $\\begingroup$ What does it mean to \"specif[y] a degree $n$ characteristic polynomial … for each element of $S$\"? (EDIT: Oh, you mean a polynomial that must be satisfied by the image of that element?) In addition to the algebraic closure, it might matter whether or not $k$ has characteristic $0$, so you may want to specify that. $\\endgroup$ LSpice –  LSpice 2020-08-08 17:49:39 +00:00 Commented Aug 8, 2020 at 17:49 1 $\\begingroup$ @LSpice, thanks for asking for clarification! I've edited the question to take your comment into account as well as added the continuity condition on the representation which seems natural and necessary. $\\endgroup$ SHS –  SHS 2020-08-08 18:06:57 +00:00 Commented Aug 8, 2020 at 18:06 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions gr.group-theory rt.representation-theory linear-algebra topological-groups See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 7 Invariant quadratic forms of irreducible representations 12 Are representations of a linearly reductive group discretely parameterized? 6 Absolutely irreducible representations of affine group schemes of finite type over a field 9 Reference request for indecomposable representations of $\\mathfrak{sl}(2)$ over an algebraically closed field of characteristic $p > 0$ 1 Dimension of $\\mathrm{Hom}_G(V, W)$ in terms of characteristic polynomial 1 Galois representations with semisimple residue representation 1 Irreducible representations over a ring of $A \\rtimes H$, for $A$ abelian locally compact and $H$ finite 11 Does every central extension by $\\mathbb{G}_m$ arise from a projective representation? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368654, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "gr.group-theory,rt.representation-theory,linear-algebra,topological-groups,gr.group-theory,rt.representation-theory,linear-algebra,topological-groups",
  "scraped_at": "2026-01-14T04:27:35.984178",
  "answer": ""
}