{
  "id": "q_363491",
  "mathoverflow_id": 363491,
  "url": "https://mathoverflow.net/questions/363491/genus-of-the-graph-complement",
  "title": "Genus of the graph complement",
  "body": "Suppose a simple undirected graph $G$ with $n$ vertices has (minimum) genus $g$ . What is the genus of its complement ? My intuitive guess is that the answer is something like $$\\text{genus of }K_n - g$$ but I wasn't able to find any information on this topic online. Is there a known solution to this problem? This is my first time on MathOverflow, so I apologize if my question is missing something -- thanks for the help :) graph-theory topological-graph-theory Share Cite Improve this question Follow edited Jun 22, 2020 at 15:52 asked Jun 19, 2020 at 4:26 ndurvasula 41 2 2 bronze badges $\\endgroup$ 6 $\\begingroup$ Can you add the definition of genus of a graph (or a link)? $\\endgroup$ M. Winter –  M. Winter 2020-06-19 06:25:28 +00:00 Commented Jun 19, 2020 at 6:25 2 $\\begingroup$ If $G$ is any graph on five vertices, other than $K_5$ or its complement, then both $G$ and its complement are planar, while $K_5$ isn't. $\\endgroup$ Gerry Myerson –  Gerry Myerson 2020-06-19 07:20:51 +00:00 Commented Jun 19, 2020 at 7:20 2 $\\begingroup$ @M.Winter I take it to be the minimum $g$ such that the graph has a 2-cell embedding into a surface of genus $g$. $\\endgroup$ Gerry Myerson –  Gerry Myerson 2020-06-19 07:22:31 +00:00 Commented Jun 19, 2020 at 7:22 1 $\\begingroup$ Your intuitive guess can be off by something linear in $n$: clearly $K_{n-2,2}$ is planar, its complement $K_{n-2}$ (plus an isolated edge) has genus $(n-5)(n-6)/12$, which is $\\approx n/3$ less than the genus of $K_n$. $\\endgroup$ Florian Lehner –  Florian Lehner 2020-06-19 09:17:42 +00:00 Commented Jun 19, 2020 at 9:17 $\\begingroup$ To get a feeling and some (counter-)examples one could play around with known coloring results and the coloring-genus-connection given by the Hadwiger conjecture (now a theorem). $\\endgroup$ M. Winter –  M. Winter 2020-06-19 09:25:14 +00:00 Commented Jun 19, 2020 at 9:25  |  Show 1 more comment 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions graph-theory topological-graph-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 0 Resticted number of edges, optimal connected graph 4 genus of a finite simple undirected graph 12 Probability of a graph procedure 6 Graph of graph homomorphisms 2 Average degree of neighbors in a simple graph (-> Friendship paradox) 2 In what types of graphs can the maximum independent set be found in polynomial time? 12 A different avatar of the complexity of a graph 11 Terminology for expressing a graph as a sum of cliques (mod 2) 0 Graph vertices selection for paths sum minimalization $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363491, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "graph-theory,topological-graph-theory,graph-theory,topological-graph-theory",
  "scraped_at": "2026-01-14T04:17:19.796343",
  "answer": ""
}