{
  "id": "q_364094",
  "mathoverflow_id": 364094,
  "url": "https://mathoverflow.net/questions/364094/detect-cycle-in-graph-in-logspace-and-linear-time",
  "title": "algorithms - Detect cycle in graph in logspace and linear time?",
  "body": "Let's consider graphs of bounded degree. I know that it's possible to detect cycles in a graph in linear time -- essentially do a depth-first search, depositing a trail along the path you're currently exploring and checking if there's an edge back to the trail. I also know that it's possible to detect cycles in log-space: think of the edges at each vertex as being cyclically ordered, so there is a “successor edge” function (defined on directed edges corresponding to the undirected edges of the original graph) which maps $(u,v)$ to $(v,u')$ , where $u'$ is next after $u$ among the neighbours of $v$ ; then loop over all directed edges $e$ , and check if the first edge in the sequence $e$ , $\\mathrm{succ}(e)$ , $\\mathrm{succ}^2(e)$ , ... whose target is the source of $e$ is different from the opposite of $e$ . Note that this may require at least quadratic time, e.g. if the graph is a cycle of length $n$ with spikes added at each vertex and you're unlucky enough to start your exploration at the spikes. Now my question: is it possible to detect cycles both in logspace and linear time? In fact, I would even be happy if there were an algorithm using sublinear space, say $O(\\sqrt n)$ . I know probabilistic algorithms achieving runtime $O(\\sqrt n)$ , but no deterministic one. graph-theory algorithms Share Cite Improve this question Follow edited Jun 26, 2020 at 9:28 Emil Jeřábek 51.2k 4 4 gold badges 164 164 silver badges 227 227 bronze badges asked Jun 25, 2020 at 9:13 grok 2,569 17 17 silver badges 21 21 bronze badges $\\endgroup$ 2 $\\begingroup$ @MaxAlekseyev Sorry I wasn't being very precise. Let's assume the graphs have bounded degree, for simplicity. See e.g. geeksforgeeks.org/detect-cycle-undirected-graph for details. $\\endgroup$ grok –  grok 2020-06-25 12:39:21 +00:00 Commented Jun 25, 2020 at 12:39 1 $\\begingroup$ This question might be more appropriate for cs.stackexchange or cstheory.stackexchange $\\endgroup$ smapers –  smapers 2020-06-26 12:56:10 +00:00 Commented Jun 26, 2020 at 12:56 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions graph-theory algorithms See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 8 Maximal number of directed edges in suitable simple graphs on $n$ vertices without directed triangles. 2 expected number of cycles in a \"random\" bipartite directed graph 3 Directed Minimal Cuts in a DAG 5 Removing cycles in a directed graph by swapping edges orientation 2 How to find a random cycle in a large graph? 1 Reference request for \"locally\" directed graph $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364094, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "graph-theory,algorithms,graph-theory,algorithms",
  "scraped_at": "2026-01-14T04:18:26.700143",
  "answer": ""
}