{
  "id": "q_364681",
  "mathoverflow_id": 364681,
  "url": "https://mathoverflow.net/questions/364681/laplacian-on-a-manifold-with-two-boundary-components",
  "title": "ap.analysis of pdes - Laplacian on a manifold with two boundary components",
  "body": "I am interested in the Laplace equation on knot complements. The full complement of a knot $K$ is in $S^3$ , but for compactness, we delete an open tubular neighborhood around $K$ . The Laplace PDE on $S^3 - K$ with Dirichlet conditions on the boundary torus has only trivial constant solutions. However, I want to model electrostatic charge of a knot in $\\mathbb{R}^3$ , and since the potential goes to zero at infinity, we can delete an open ball around the point at infinity. Thus our boundary domain has two boundary components: a torus and an $S^2$ . Close to the knot, the potential is large, and far away, the potential is small. So we have the PDE $\\Delta \\Phi =0$ and the boundary conditions that $\\Phi$ is a positive constant $c_1$ on the boundary torus and another positive constant $c_2$ on the boundary sphere with $c_1 > c_2$ . Are there any references for solving PDEs of this form, where the boundary is broken into two disjoint components and the conditions are that the solution must take differing constants on them? ap.analysis-of-pdes elliptic-pde 3-manifolds linear-pde laplacian Share Cite Improve this question Follow edited Jul 4, 2020 at 4:21 YCor 67.5k 5 5 gold badges 203 203 silver badges 301 301 bronze badges asked Jul 2, 2020 at 17:15 maxematician 237 1 1 silver badge 12 12 bronze badges $\\endgroup$ 5 $\\begingroup$ What is it that you wish to know? That a solution exists, is unique, and has certain regularity? Or something else? $\\endgroup$ Joshua Mundinger –  Joshua Mundinger 2020-07-02 17:48:01 +00:00 Commented Jul 2, 2020 at 17:48 $\\begingroup$ I already have existence, but I want to know about uniqueness and about the critical sets of the solutions. $\\endgroup$ maxematician –  maxematician 2020-07-02 18:57:08 +00:00 Commented Jul 2, 2020 at 18:57 $\\begingroup$ Uniqueness follows immediately from the maximum principle, no? $\\endgroup$ Neal –  Neal 2020-07-02 21:32:23 +00:00 Commented Jul 2, 2020 at 21:32 $\\begingroup$ How so? But I need to know more than just existence and uniqueness. $\\endgroup$ maxematician –  maxematician 2020-07-02 22:25:40 +00:00 Commented Jul 2, 2020 at 22:25 1 $\\begingroup$ Uniqueness holds as long as you know the value on all boundary components. This is typically explained in electrodynamics books (such as Griffiths') which is what your question is about. $\\endgroup$ Chris Gerig –  Chris Gerig 2020-07-02 23:18:01 +00:00 Commented Jul 2, 2020 at 23:18 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ap.analysis-of-pdes elliptic-pde 3-manifolds linear-pde laplacian See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 17 Can the \"physical argument\" for the existence of a solution to Dirichlet's problem be made into an actual proof? 31 Classification of PDE 2 IBVP with transformed boundary conditions 7 Harmonic functions on knot complements 3 Neumann/Robin Laplacian semigroup well-known estimate 4 Elliptic equations in asymptotically hyperbolic manifolds $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364681, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ap.analysis-of-pdes,elliptic-pde,3-manifolds,linear-pde,laplacian,ap.analysis-of-pdes,elliptic-pde,3-manifolds,linear-pde,laplacian",
  "scraped_at": "2026-01-14T04:19:55.519353",
  "answer": ""
}