{
  "id": "q_365809",
  "mathoverflow_id": 365809,
  "url": "https://mathoverflow.net/questions/365809/polynomial-objects-in-any-concrete-category",
  "title": "ct.category theory - Polynomial objects in any concrete category",
  "body": "EDIT: The original question had a trivial answer: it's just a coproduct. New question below New Question: As shown below, in the category of commutative unital rings, the coproduct of a ring $R$ with $\\mathbb Z\\left[x\\right]$ (which represents the forgetful functor to sets) is the polynomial ring $R\\left[x\\right]$ . In what other concrete categories does the coproduct of an object $A$ with the object $Z$ ( $Z$ is the object that represents the forgetful functor) give a useful construction. Reformulating the question: When does the free object on the point in the co-slice category of maps $A\\to B$ give a useful construction? (from giuseppe 's comment below this question) Given a ring (commutative, unital) $R$ , the polynomial ring $R\\left[x\\right]$ is the initial pointed $R$ -algebra, in the sense that given any other $R$ -algebra $R\\to A$ and a point $a\\in A$ we have a unique $R$ -algebra homomorphism $p\\colon R\\left[x\\right]\\to A$ such that $p\\left(x\\right)=a$ . Since the forgetful functor $\\mathrm{CRing}\\to\\mathrm{Sets}$ is $\\mathrm{Hom_{CRing}}\\left(\\mathbb Z\\left[x\\right],-\\right)$ we can equivalenty think of $R\\left[x\\right]$ to be initial ring that is both an $R$ -algebra and a $\\mathbb Z\\left[x\\right]$ -algebra. In diagrammatic form, we could say $\\require{AMScd}$ \\begin{CD} R @>\\iota>>R\\left[x\\right] @<x\\mapsto x<<\\mathbb Z\\left[x\\right]\\\\ @V \\mathrm{id}_RVV @VV\\exists! V @VV\\mathrm{id}_{\\mathbb Z\\left[x\\right]}V\\\\ R @>>\\phi> A@<<a<\\mathbb Z\\left[x\\right] \\end{CD} I was thinking of this definition in any concrete category. So if I have a category $\\mathcal C$ with a faithful functor $U\\colon\\mathcal C\\to\\mathrm{Sets}$ which is representable, that is $U\\simeq\\mathrm{Hom}_\\mathcal C\\left(Z,-\\right)$ for some object $Z$ in $\\mathcal C$ . Then for any object $A$ , we define the polynomial object $P$ over $A$ to be universal in the same sense as above, i.e., \\begin{CD} A @>\\iota>>P_A @<f<<Z\\\\ @V \\mathrm{id}_AVV @VV\\exists! V @VV\\mathrm{id}_ZV\\\\ A @>>\\phi> Q@<<g<Z \\end{CD} EDIT: This is obviously a coproduct. Ignore the questions below. I was wondering what this would correspond to in other concrete categories with representable forgetful functors. I also wanted to know some example of this construction in other categories. Are these 'polynomial objects' things that already have names in other specific categories? ct.category-theory ac.commutative-algebra ra.rings-and-algebras universal-algebra abstract-nonsense Share Cite Improve this question Follow edited Jul 17, 2020 at 14:29 asked Jul 16, 2020 at 19:50 Chetan Vuppulury 438 4 4 silver badges 18 18 bronze badges $\\endgroup$ 10 2 $\\begingroup$ I don't quite understand your diagram but wouldn't it just be the coproduct of Z with A (assuming co products exist). $\\endgroup$ Asvin –  Asvin 2020-07-16 20:15:03 +00:00 Commented Jul 16, 2020 at 20:15 1 $\\begingroup$ Someone should write a CW answer and Chetan can accept it, to keep this Q off the 'unanswered' list. $\\endgroup$ David Roberts –  David Roberts ♦ 2020-07-16 23:20:34 +00:00 Commented Jul 16, 2020 at 23:20 2 $\\begingroup$ @DavidRoberts I have edited the question and replaced it by a new question that came up. $\\endgroup$ Chetan Vuppulury –  Chetan Vuppulury 2020-07-16 23:36:40 +00:00 Commented Jul 16, 2020 at 23:36 3 $\\begingroup$ If $U$ is representable then it has a left adjont $F,$ since the representing object of $U$ has the universal property of the free object on the point and then for every other set $A$ you build $F(A)$ as $\\sqcup_{A}F(*)$ $\\endgroup$ display llvll –  display llvll 2020-07-17 14:05:59 +00:00 Commented Jul 17, 2020 at 14:05 2 $\\begingroup$ I think your question is too broad to have an answer. You are just taking the composition of two left adjoints; you have the left adjoint to your functor $U$ and then you compose it with the left adjoint to the forgetful functor $(A \\to B ) \\mapsto B$, which is just given by taking the coproduct with $A$. So, a stupid answer would be that this is useful whenever the category of maps $A \\to B$ is interesting. $\\endgroup$ display llvll –  display llvll 2020-07-18 03:31:14 +00:00 Commented Jul 18, 2020 at 3:31  |  Show 5 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ct.category-theory ac.commutative-algebra ra.rings-and-algebras universal-algebra abstract-nonsense See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 9 Compact Hausdorff and C^*-algebra \"objects\" in a category. 3 Indeterminates and forgetful functors 27 Topos associated to a category 19 Free symmetric monoidal category on a monoidal category 6 Is there a general notion of a subobject generated by a subset in any concrete category? 4 Categorical Kähler differentials and the Leibniz rule 10 Isbell Duality and Dualizing Scheme Objects 4 Cocompletion without cocontinuous functors $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365809, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ct.category-theory,ac.commutative-algebra,ra.rings-and-algebras,universal-algebra,abstract-nonsense,ct.category-theory,ac.commutative-algebra,ra.rings-and-algebras,universal-algebra,abstract-nonsense",
  "scraped_at": "2026-01-14T04:23:05.615670",
  "answer": ""
}