{
  "id": "q_362194",
  "mathoverflow_id": 362194,
  "url": "https://mathoverflow.net/questions/362194/enlarging-a-compact-set-in-order-to-improve-its-shape",
  "title": "at.algebraic topology - Enlarging a compact set in order to improve its shape",
  "body": "In my previous question it was established that if $X$ is a metrizable, connected, locally path connected space and $K\\subset X$ is compact, then there is a Peano continuum $L\\subset X$ such that $K\\subset L$ . This motivated the following questions. Let $X$ be as above and $\\pi_k(X)$ is trivial, for $k=0,...,n$ (resp $X$ is contractible). If $K\\subset X$ is a Peano continuum, can we find a compact $L\\subset X$ such that $K\\subset L$ and $\\pi_k(L)$ is trivial, for $k=0,...,n$ (resp $L$ is contractible)? Regarding the \"contractible version\", here is an idea that does not work: let $F:X\\times[0,1] \\to X$ be a homotopy from the identity to a constant. It is tempting to try to show that $F(K\\times [0,1])$ is the set that we are looking for. However, if we started with $K$ a singleton, the obtained set can be any Peano continuum, and so not necessarily contractible. Edit: There is a good candidate for a counterexample suggested by HJRW. Let $X$ be the Whitehead manifold , which is a contractible $3$ -dimensional manifold, not homeomorphic to $\\mathbb{R}^3$ . It is proven in the paper Brick & Mihalik - The QSF property for groups and spaces , that $X$ fails the so called QSF property. This amounts to existence of subcomplex $A$ of $X$ such that there is no celluar map $f:K\\to X$ of a finite simply connected complex such that $f|_{f^{-1}(A)}\\to A$ is a homeomorphism. In particular, there is no finite simply connected subcomplex $L\\supset A$ . Hence, we are almost done: there is a compact set (in a contractible manifold) that cannot be included into a simply-connected subcomplex . The missing ingredient therefore is: Can every simply connected $M\\subset X$ be included in a simply connected finite subcomplex of $X$ ? Interestingly, in Definition 1.5 this article , the QSF property is defined with no reference to complexes, and in fact is exactly what i need. However, that's the only place i saw this definition, so it's not 100% clear it is equivalent to the more common one. at.algebraic-topology gn.general-topology gt.geometric-topology Share Cite Improve this question Follow edited Jun 29, 2020 at 15:29 asked Jun 4, 2020 at 15:45 erz 5,693 1 1 gold badge 20 20 silver badges 27 27 bronze badges $\\endgroup$ 10 $\\begingroup$ Maybe the technique of \"engulfing\" is helpful, e.g. Chapter 3 of Daverman-Venema, Embeddings in manifolds. $\\endgroup$ skupers –  skupers 2020-06-06 03:00:53 +00:00 Commented Jun 6, 2020 at 3:00 $\\begingroup$ Regarding the contractible version, you might like to think a bit about the Whitehead manifold: en.wikipedia.org/wiki/Whitehead_manifold . It's a contractible 3-manifold, but I believe that it cannot be filtered by compact, simply connected subsets. $\\endgroup$ HJRW –  HJRW 2020-06-27 12:35:43 +00:00 Commented Jun 27, 2020 at 12:35 $\\begingroup$ @HJRW what does \"filtered by compact, simply connected subsets\" mean? sorry if this is a stupid question $\\endgroup$ erz –  erz 2020-06-27 13:31:39 +00:00 Commented Jun 27, 2020 at 13:31 $\\begingroup$ I’d call a manifold $M$ “filtered by compact, simply connected subsets” if it can be written as an ascending union $\\bigcup_{n\\geq 0} K_n$, where each $K_n$ is compact and simply connected. $\\endgroup$ HJRW –  HJRW 2020-06-27 20:11:00 +00:00 Commented Jun 27, 2020 at 20:11 $\\begingroup$ @HJRW that would completely answer my question (even more). Do you know a reference for that claim? $\\endgroup$ erz –  erz 2020-06-28 15:10:45 +00:00 Commented Jun 28, 2020 at 15:10  |  Show 5 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions at.algebraic-topology gn.general-topology gt.geometric-topology See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 6 Is it possible to connect every compact set? Related 13 Simply connected simplicial complexes 12 Inserting an open and simply-connected set between a compact set and an open set 31 Does there exist any non-contractible manifold with fixed point property? 7 Can a hyperbolic manifold be a product? 1 Topology of length spaces 6 Is it possible to connect every compact set? 8 Contractible set in a manifold 8 Contractible subcomplex containing 1-skeleton? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 362194, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "at.algebraic-topology,gn.general-topology,gt.geometric-topology,at.algebraic-topology,gn.general-topology,gt.geometric-topology",
  "scraped_at": "2026-01-14T04:19:17.276684",
  "answer": ""
}