{
  "id": "q_368046",
  "mathoverflow_id": 368046,
  "url": "https://mathoverflow.net/questions/368046/given-multiple-posets-what-is-the-probability-that-a-randomly-selected-uniform",
  "title": "pr.probability - Given multiple posets, what is the probability that a randomly selected (uniform dist) subposet of their product has a max under the product order?",
  "body": "Given multiple totally ordered posets, how do I find the probability that a randomly selected (with uniform distribution) subposet of their product has a maximum under the product order? I have some vague intuition about the shape of subsets of powers of the unit interval that suggests that it is a relatively small probability, but nothing concrete. I have no real idea on how to approach the problem after taking the power set of the product. I don't know a general way to separate members of the power set that have maximums under the product ordering fro. Those that don't without manually checking. Suggestions for relevant texts are appreciated as well. pr.probability posets products Share Cite Improve this question Follow asked Jul 31, 2020 at 17:52 Nicholas McNeely 1 $\\endgroup$ 8 $\\begingroup$ I take it these are finite posets? So you’re asking what is the probability that a uniformly random subposet of a product of chains (say of sizes $n_1,\\ldots,n_k$) has a maximum? Reasonable question, but you might want to edit the post and especially the title (which vaguely says “multiple posets”) to reflect this. $\\endgroup$ Sam Hopkins –  Sam Hopkins ♦ 2020-07-31 18:25:04 +00:00 Commented Jul 31, 2020 at 18:25 $\\begingroup$ I don't see why they should be finite. You can have maximums in posets of infinite cardinality. $\\endgroup$ Nicholas McNeely –  Nicholas McNeely 2020-07-31 18:36:01 +00:00 Commented Jul 31, 2020 at 18:36 $\\begingroup$ But how do you define a uniform distribution on subposets otherwise? $\\endgroup$ Sam Hopkins –  Sam Hopkins ♦ 2020-07-31 19:11:55 +00:00 Commented Jul 31, 2020 at 19:11 $\\begingroup$ I have no idea. If that assumption is necessary, then so be it. But I'd prefer not to make that assumption if possible. The example in my head is [0,1]×[0,1]. Can we not define a uniform distribution for picking out subsets of [0,1]×[0,1] with a given property? $\\endgroup$ Nicholas McNeely –  Nicholas McNeely 2020-07-31 19:27:31 +00:00 Commented Jul 31, 2020 at 19:27 $\\begingroup$ There is no “uniform” distribution on any infinite sets. $\\endgroup$ Sam Hopkins –  Sam Hopkins ♦ 2020-07-31 19:54:15 +00:00 Commented Jul 31, 2020 at 19:54  |  Show 3 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions pr.probability posets products See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 9 Ordered sum of posets 8 Sections measure zero imply set is measure zero? 15 Generating Random Young Tableaux: A peculiar probability identity 1 Finding the probability that $n$ points which are randomly selected from $d-1$ dimensional spherical surface are 'semi-spherical' 15 Unified framework for posets with order polynomial product formulas 12 Order polynomial of shifted double staircase $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368046, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "pr.probability,posets,products,pr.probability,posets,products",
  "scraped_at": "2026-01-14T04:26:32.618686",
  "answer": ""
}