{
  "id": "q_366980",
  "mathoverflow_id": 366980,
  "url": "https://mathoverflow.net/questions/366980/an-explicit-maybe-algebraic-isometric-embedding-of-the-double-torus-with-const",
  "title": "riemannian geometry - An explicit (maybe algebraic) isometric embedding of the double torus with constant curvature K = -1",
  "body": "The following question is related to this previous question, Canonical immersion of the double torus : Is there any known explicit (maybe algebraic) isometric embedding of a genus 2 surface endowed with a metric of constant curvature K = -1 into a Hilbert space of finite dimension? riemannian-geometry hyperbolic-geometry metric-embeddings Share Cite Improve this question Follow edited Jul 31, 2020 at 2:28 asked Jul 30, 2020 at 20:40 Mauro Patrão 31 3 3 bronze badges $\\endgroup$ 5 $\\begingroup$ Isometric embedding into where? $\\endgroup$ Deane Yang –  Deane Yang 2020-07-30 23:23:13 +00:00 Commented Jul 30, 2020 at 23:23 $\\begingroup$ Into a Hilbert space of finite dimension. $\\endgroup$ Mauro Patrão –  Mauro Patrão 2020-07-31 02:27:31 +00:00 Commented Jul 31, 2020 at 2:27 $\\begingroup$ Or, to be more concrete, into $\\mathbb{R}^n$ for some $n > 0$? $\\endgroup$ Deane Yang –  Deane Yang 2020-07-31 02:51:01 +00:00 Commented Jul 31, 2020 at 2:51 $\\begingroup$ Into an R^n with a fixed inner product. $\\endgroup$ Mauro Patrão –  Mauro Patrão 2020-07-31 19:12:00 +00:00 Commented Jul 31, 2020 at 19:12 $\\begingroup$ I’m pretty sure none is known, and it’s an open question whether any such “explicit” embedding or evening just immersion exists. $\\endgroup$ Deane Yang –  Deane Yang 2020-07-31 22:11:35 +00:00 Commented Jul 31, 2020 at 22:11 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions riemannian-geometry hyperbolic-geometry metric-embeddings See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 21 Canonical immersion of the double torus Related 29 Does a Riemannian manifold with bounded geometry admit an isometric proper embedding into Euclidean space with uniformly thick tubular neighborhood? 10 Examples of non isometric surfaces having the same curvature function 21 Canonical immersion of the double torus 6 Quantitative upper bound on mean curvature of an isometric embedding 4 Embedding a countably infinite metric space in $\\ell^2(\\mathbb Z_+)$ 2 Smooth isometric immersions of the a hemisphere in $\\mathbb R^3$ $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366980, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "riemannian-geometry,hyperbolic-geometry,metric-embeddings,riemannian-geometry,hyperbolic-geometry,metric-embeddings",
  "scraped_at": "2026-01-14T04:26:20.349023",
  "answer": ""
}