{
  "id": "q_363928",
  "mathoverflow_id": 363928,
  "url": "https://mathoverflow.net/questions/363928/modelling-fluid-flows-with-mean-curvature-flow",
  "title": "ap.analysis of pdes - Modelling fluid flows with mean curvature flow",
  "body": "A while ago I was wondering if the displacement of fluid described in this blog post could be modelled with mean curvature flow or some other flow, but when I asked someone in Engineering they replied that industry is generally not interested in simple mathematical models. However, I noticed in this article that they do actually model bouncing of droplets and the associated coalescence phenomenon using mean curvature flow and get quite good agreement with experiment and numerical simulations. Are there are any other possibilities for modelling fluid flows with mean curvature flow? I am thinking along the lines of contracting bubbles and things like that. ap.analysis-of-pdes na.numerical-analysis geometric-analysis fluid-dynamics Share Cite Improve this question Follow edited Jun 23, 2020 at 14:49 YCor 67.5k 5 5 gold badges 203 203 silver badges 301 301 bronze badges asked Jun 23, 2020 at 14:42 Hollis Williams 5,481 3 3 gold badges 30 30 silver badges 61 61 bronze badges $\\endgroup$ 1 2 $\\begingroup$ I don't think the \"correct\" description is a simple mean curvature flow. Things like contracting bubbles you have really a two-phase fluid with a free boundary interface. The standard model for surface tension is given by the mean curvature. The motion of the free boundary then is by pressure difference between the two phases minus the mean curvature (or something like that). Mean curvature flow by itself is probably too naive. $\\endgroup$ Willie Wong –  Willie Wong 2020-06-23 15:53:17 +00:00 Commented Jun 23, 2020 at 15:53 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ap.analysis-of-pdes na.numerical-analysis geometric-analysis fluid-dynamics See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 2 Existence of PDE system (mean curvature flow coupled with surface PDE) 1 Steady Euler flows with compact support? 1 Distance function to mean curvature flow 2 Fluid dynamics textbook discussing Hele-Shaw flow 3 Singularities of hypersurfaces with bounded mean curvature? 13 Volume-preserving fluid flows are incompressible. What about surface-area preserving flows? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363928, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ap.analysis-of-pdes,na.numerical-analysis,geometric-analysis,fluid-dynamics,ap.analysis-of-pdes,na.numerical-analysis,geometric-analysis,fluid-dynamics",
  "scraped_at": "2026-01-14T04:18:06.152642",
  "answer": ""
}