{
  "id": "q_365592",
  "mathoverflow_id": 365592,
  "url": "https://mathoverflow.net/questions/365592/proof-in-the-realm-of-infty-categories",
  "title": "ct.category theory - Proof in the realm of $\\infty$ categories",
  "body": "I have recently started learning the language of $\\infty$ -categories. My approach is more to their use, rather than for their own sake. For this reason, as I feel I reached a good understanding of the basic notions (the definition, functors, adjoints, stable categories, etc.), I have now turned my attention to some papers which work in the framework of stable $\\infty$ -categories to solve the functoriality issues we encounter when we work with triangulated categories. However, I am having problems understanding what can be proved and what can't using techniques similar to the triangulated world. For example, I am reading Noncommutative homological projective duality by Alexander Perry ( arXiv:1804.00132 ), and in the first part some results about $S$ -linear categories (where $S$ is a scheme satisfying some assumptions) are proved. The formal definition is that the categories of $S$ -linear categories is the categories of module objects $\\text{Mod}_{\\mathfrak{Perf}(S)}(\\text{Cat}_{\\text{st}})$ , where $\\text{Cat}_{\\text{st}}$ is the $\\infty$ -category of stable, idempotent complete $\\infty$ -categories with exact functors. The author then wants to prove that if we have an $S$ -linear functor $\\phi : \\mathcal{C} \\rightarrow \\mathcal{D}$ between $S$ -linear categories which has a left adjoint when considered as a plain functor of $\\infty$ -categories, then $\\phi^{L}$ is automatically an $S$ -linear functor. The proof which is given in the paper uses the internal hom for $S$ -linear categories, and the adjunction properties $$ \\mathcal{H}om_{S}(\\phi^L(C \\otimes F), D) \\simeq \\mathcal{H}om_{S}(C \\otimes F, \\phi(D)) \\simeq \\mathcal{H}om_S(C, \\phi(D) \\otimes F^{\\vee}) \\simeq \\dots \\mathcal{H}om_S(\\phi^{L}(C) \\otimes F,D) $$ where $C \\in \\mathcal{C}, D \\in \\mathcal{D}, F \\in \\mathfrak{Perf}(S)$ , and $\\otimes$ denotes the module structure. Then the proof is concluded using the Yoneda lemma. This is the proof I would write if I were working in the triangulated setting, and I don't understand why one is allowed to use it in the $\\infty$ -categorical framework as well. Adjunction in this case as far more tricky (even if they imply the obvious isomorphism on mapping spaces), and the structure of $S$ -linear functor implies $\\phi^L(C \\otimes F) \\simeq \\phi^L(C) \\otimes F$ up to contractible choices, but it is not equivalent to this isomorphism, is it? It would be very helpful is some could help me understanding to which point one can transport proofs from the triangulated world to the stable $\\infty$ -categorical framework. Thanks. ct.category-theory infinity-categories triangulated-categories Share Cite Improve this question Follow edited Jul 14, 2020 at 11:32 David Roberts ♦ 37k 13 13 gold badges 143 143 silver badges 388 388 bronze badges asked Jul 14, 2020 at 9:11 Federico Barbacovi 1,345 8 8 silver badges 13 13 bronze badges $\\endgroup$ 14 6 $\\begingroup$ That proof doesn't give the full details, but it doesn't do so in the 1-categorical world either: being S-linear is additional structure on a functor, not just a property. However, for the left adjoint of an S-linear functor you have canonical oplax structure maps $\\phi^L(C \\otimes F) \\rightarrow \\phi^L(C) \\otimes F$ (adjoint to the map $C \\otimes F \\rightarrow \\phi\\phi^L(C) \\otimes F \\simeq \\phi(\\phi^L(C) \\otimes F)$ defined by the unit of the adjunction and the linearity of $\\phi$). So what you're really showing is that this particular map is an equivalence. $\\endgroup$ Rune Haugseng –  Rune Haugseng 2020-07-14 09:28:59 +00:00 Commented Jul 14, 2020 at 9:28 4 $\\begingroup$ The same is true in the $\\infty$-categorical setting, it's just a bit trickier to set up the oplax structure maps in a coherent way. In this particular case (and many others) this is best dealt with using cocartesian fibrations (for the details see Corollary 7.3.2.12 in Higher Algebra). $\\endgroup$ Rune Haugseng –  Rune Haugseng 2020-07-14 09:37:35 +00:00 Commented Jul 14, 2020 at 9:37 7 $\\begingroup$ This illustrates a common feature of working with $\\infty$-categories: if you're checking a property you can often reason just as in the 1-categorical setting, but to obtain structures you usually have to figure out a canonical reason why they exist (though this can often give cleaner proofs for 1-categories too than you get by writing them out explicitly). $\\endgroup$ Rune Haugseng –  Rune Haugseng 2020-07-14 09:41:20 +00:00 Commented Jul 14, 2020 at 9:41 4 $\\begingroup$ @Federico I would say the thing that is generally swept under the rug is why two maps are the same. i.e. you claim that a map is an isomorphism because its a map between isomorphic objects. This problem clearly appears in the proof you presented, and it is the same to infinity categories as to 1-categories. It is just culturally excepted to ignore it in 1-categorical settings for basically no good reason. Once you note it, the difference between the theories become much smaller in practice I believe. $\\endgroup$ S. carmeli –  S. carmeli 2020-07-14 14:04:41 +00:00 Commented Jul 14, 2020 at 14:04 4 $\\begingroup$ As illustrated in this discussion, the details are often clear to experts. But as $\\infty$-categorical methods are (for good reason) adopted by a greater number of non-experts, I (as a novice) worry when these issues are brushed under the rug. $\\endgroup$ Phil Tosteson –  Phil Tosteson 2020-07-14 14:52:44 +00:00 Commented Jul 14, 2020 at 14:52  |  Show 9 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ct.category-theory infinity-categories triangulated-categories See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 18 Proof that the homotopy category of a stable $\\infty$-category is triangulated 7 Which free strict $\\omega$-categories are also free as weak $(\\infty,\\infty)$-categories? 1 Morphisms on fibre products 12 Recasting straightening/unstraightening equivalence as $(\\infty, 2)$-adjunction 8 Criterion for the Lurie tensor product of $\\infty$-categories to commute with infinite products 6 Equivalence of Functor Categories holding for $\\infty$-Categories but failing in Homotopy Categories $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365592, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ct.category-theory,infinity-categories,triangulated-categories,ct.category-theory,infinity-categories,triangulated-categories",
  "scraped_at": "2026-01-14T04:25:03.595966",
  "answer": ""
}