{
  "id": "q_365916",
  "mathoverflow_id": 365916,
  "url": "https://mathoverflow.net/questions/365916/reductions-to-the-max-3-dcc-problem",
  "title": "graph theory - Reductions to the MAX-3-DCC Problem",
  "body": "I am currently working on the Max-3-DCC problem that asks for the heaviest vertex-disjoint cycle cover of weighted directed graphs. The problem has been reduced to 3-SAT in 1979 by L. Valiant in his article on The Complexity of Calculating the Permanent . Later, around 2005 B. Manthey proved the APX-hard ness of the problem in On Approximating Restricted Cycle Covers , followed by a series of articles on related problems of calculating restricted cycle covers. I recently had new ideas for calculating Max-3-DCCs and was looking for benchmark instances similar to those for TSP, however neither a related question on cs.stackexchange https://scicomp.stackexchange.com/questions/35522/benchmark-instances-for-directed-3-cycle-cover?noredirect=1#comment67646_35522 nor extensively searching the internet brought about anything directly in that direction. I have the impression that the Max-3-DCC is the Cinderella of NP complete problems; it is almost never \"invited\" to lists of such problems and hardly the subject of interest, expressed as publications. I therefore put my hopes in getting access to benchmark instances via \"simple\" reductions from other NP complete problems: Question: which NP complete optimization problems, for which collections of freely accessible benchmark instances are available , can be transformed to Max-3-DCC and back in time linear in the size of the instance, which should be possible because most of Karp's problems are class NLIN according to this article . My most wanted are of course the problems in Karp's list of 21, most prominently TSP and vertex-cover. for clarification: instances qualify as benchmarks for me only if their optimal solution is known and if known heuristics will fail to report it. Instances with best *known* solutions are also acceptable. Apart from that the data should be freely accessible. graph-theory algorithms combinatorial-optimization Share Cite Improve this question Follow edited Jul 18, 2020 at 14:51 asked Jul 18, 2020 at 7:31 Manfred Weis 14k 4 4 gold badges 40 40 silver badges 82 82 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions graph-theory algorithms combinatorial-optimization See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 1 Gadgets that reduce NP hard problems to the MAX-3-DCC Problem Related 6 max-min optimization problem 3 Practical calculation of minimum weight vertex-disjoint cycle covers 6 How does the complexity of calculating the Permanent imply the NP completeness of directed 3-cycle cover? 0 A variant of max-flow problem $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365916, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "graph-theory,algorithms,combinatorial-optimization,graph-theory,algorithms,combinatorial-optimization",
  "scraped_at": "2026-01-14T04:23:24.383543",
  "answer": ""
}