{
  "id": "q_36461",
  "mathoverflow_id": 36461,
  "url": "https://mathoverflow.net/questions/36461/characterizing-polyhedron-from-brownian-particle-collisions-with-a-boundary",
  "title": "pr.probability - Characterizing polyhedron from Brownian particle collisions with a boundary",
  "body": "Please imagine that we have an ordinary 2-sphere, of radius $r_{sphere}$, and some three-dimensional polygon that has all of its points fixed at positions strictly internal to the sphere's surface. Also confined in the sphere is point-like particle (with diffusion constant, $D_{particle}$) undergoing Brownian motion. The surface of the 2-sphere, as well as the surface of the polygon internal to the 2-sphere, are perfect reflecting boundaries for the particle. Working in discrete time, we track the point-like particle for $N$ finite time units (we'll call them seconds), $(t_1, t_2, ..., t_k, ..., t_N) \\in T$. However, during this time the only information we are allowed to record is: If a collision between the probe and the surface of the 2-sphere occurs at a given time point, $t_k$. And if there is at least one such collision during $t_k$... The coordinates of a collision event on the surface of sphere, randomly selected from all collisions that occur during $t_k$. Beyond, perhaps, the volume of the polygon in the sphere (and I'm not entirely sure this is learnable), how (if at all possible) can we use the information specified above to characterize the polygon in some additional manner? Update - If we apply a further restriction that the polyhedron is convex, at the limit of large $N$ will there be enough information from the collisions to reconstruct the convex polyhedra? pr.probability stochastic-calculus Share Cite Improve this question Follow edited Aug 30, 2017 at 11:37 François G. Dorais 45.3k 6 6 gold badges 153 153 silver badges 238 238 bronze badges asked Aug 23, 2010 at 16:29 Rob Grey 599 1 1 gold badge 4 4 silver badges 18 18 bronze badges $\\endgroup$ 8 $\\begingroup$ Trivial observation: the symmetry group of a convex polytope about the origin (if nontrivial) will be manifested in the density function of the collisions. $\\endgroup$ Steve Huntsman –  Steve Huntsman 2010-08-23 16:35:34 +00:00 Commented Aug 23, 2010 at 16:35 $\\begingroup$ I assume by \"three-dimensional polygon\" you mean a polyhedron, a closed surface composed of flat faces? $\\endgroup$ Joseph O'Rourke –  Joseph O'Rourke 2010-08-23 17:31:58 +00:00 Commented Aug 23, 2010 at 17:31 $\\begingroup$ You might look at the MO question \"Algorithm for finding the volume of a convex polytope,\" mathoverflow.net/questions/979/… , for most algorithms use random walks inside the polyhedron to estimate the volume. $\\endgroup$ Joseph O'Rourke –  Joseph O'Rourke 2010-08-23 17:34:54 +00:00 Commented Aug 23, 2010 at 17:34 $\\begingroup$ Joseph, yes, I do mean a polyhedron, but not necessarily a convex polyhedron. $\\endgroup$ Rob Grey –  Rob Grey 2010-08-23 18:09:01 +00:00 Commented Aug 23, 2010 at 18:09 $\\begingroup$ @Rob: Ah, then the MO question on convex polytopes may not be so relevant... $\\endgroup$ Joseph O'Rourke –  Joseph O'Rourke 2010-08-23 18:14:39 +00:00 Commented Aug 23, 2010 at 18:14  |  Show 3 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions pr.probability stochastic-calculus See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 9 Surfaces that are 'everywhere accessible' to a randomly positioned Newtonian particle with an arbitrary velocity vector 4 Time-integral of a smooth, vector-valued function of a planar Brownian bridge 2 Inferring the location of a reflecting boundary in a toroidal cage with a Brownian particle 6 Brownian particle with jump boundary condition 0 Exit probability of a Brownian particle. 2 Probability a Brownian particle with an exponentially distributed lifetime hits a sphere before vanishing 1 Stokes-Einstein rotational diffusion and vector orientation time 3 Branching Brownian motion with selection. Two models, the same rightmost particle velocity? 0 Fundamental Contradiction with Brownian motion $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 36461, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "pr.probability,stochastic-calculus,pr.probability,stochastic-calculus",
  "scraped_at": "2026-01-14T04:10:09.048311",
  "answer": ""
}