{
  "id": "q_366774",
  "mathoverflow_id": 366774,
  "url": "https://mathoverflow.net/questions/366774/how-to-introduce-not-orthonormal-base-on-reproducing-kernel-hilbert-spaces",
  "title": "How to introduce not-orthonormal base on Reproducing Kernel Hilbert Spaces?",
  "body": "I read some tutorial papers and slide，and find that the bases on Reproducing Kernel Hilbert Spaces always be orthonormal. For examples，you can refer to this link for the content about Reproducing Kernel Hilbert Spaces . What if the introduced base are not orthonormal? Any papers talk about this problems? hilbert-spaces kernels Share Cite Improve this question Follow asked Jul 28, 2020 at 9:07 Max 1 $\\endgroup$ 3 1 $\\begingroup$ You need to be careful about what you mean by a \"basis\" when dealing with infinite-dimensional normed spaces: there are several different notions, and I think you should first look up which one fits your needs. Right now, since it is not clear if you know what a Schauder basis or an unconditional basis is, it is difficult to point you in an appropriate direction $\\endgroup$ Yemon Choi –  Yemon Choi 2020-07-28 13:57:08 +00:00 Commented Jul 28, 2020 at 13:57 1 $\\begingroup$ In any case, if you are relatively inexperienced in mathematics, then perhaps you would do better to ask your question on math.stackexchange.com $\\endgroup$ Yemon Choi –  Yemon Choi 2020-07-28 13:57:59 +00:00 Commented Jul 28, 2020 at 13:57 $\\begingroup$ @YemonChoi, thanks for your comments. You can check the link I refer in my questions. What makes I confuse is that if I introduce a non-orthonormal to replace the basis e_m in Eq.(1) mentioned in the link. Then, if the kernel still has the original property like: 𝑓(𝑎)=⟨𝑓,𝐾𝑎⟩ $\\endgroup$ Max –  Max 2020-07-29 08:00:51 +00:00 Commented Jul 29, 2020 at 8:00 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions hilbert-spaces kernels See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 7 Orthonormal bases on Reproducing Kernel Hilbert Spaces Related 3 A space parameterizing the choices of orthonormal bases for a Hilbert space 7 Orthonormal bases on Reproducing Kernel Hilbert Spaces 3 The multiplier algebra of a Reproducing Kernel Hilbert Space and its commutant 4 Abstract Definition of a Reproducing Kernel Hilbert Space 6 Schmidt decomposition on infinite-dimensional Hilbert spaces $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366774, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "hilbert-spaces,kernels,hilbert-spaces,kernels",
  "scraped_at": "2026-01-14T04:25:42.256251",
  "answer": ""
}