{
  "id": "q_363084",
  "mathoverflow_id": 363084,
  "url": "https://mathoverflow.net/questions/363084/what-is-the-onsager-machlup-function-for-dxt-fbt-dtdbt",
  "title": "pr.probability - What is the Onsager-Machlup function for $dX(t)=f(B(t)) dt+dB(t)$?",
  "body": "What is the Onsager-Machlup function for $dX(t)=f(B(t)) dt+dB(t)$ ? I know that the Onsager-Machlup function for $dX(t)=f(X(t))dt+dB(t)$ is $$L(x,v)=\\frac12\\left[v-f(x)\\right]^2+\\frac12f'(x)$$ But what if instead of $f(X)$ it is $f(B)$ ? I have a strong suspicion that it is $$L(x,v)=\\frac12 E[(v-f(B(t)+x))^2]$$ I have tried finding the SDE for $X(t)$ but it is quite difficult. I tried doing this through infinitesimal generator, but I can't find it. pr.probability stochastic-processes stochastic-calculus stochastic-differential-equations Share Cite Improve this question Follow edited Jun 20, 2020 at 3:31 asked Jun 14, 2020 at 23:50 user158968 93 5 5 bronze badges $\\endgroup$ 7 $\\begingroup$ Definitely not. I do not have the time right now to write a full answer, so here are hints, maybe you or someone else can complete them. You need to replace $f(B_t)$ by a functional of the solution, i.e. write $f(B_t)=g(X_0^t)$ where now $g$ is a functional. (In the classical case, $f=g$ is a pointwise function. When you now do the Girsanov, you will write $g(X_0^t)=g(\\phi_0^t+X_0^t-\\phi_0^t)$ ($\\phi$ is the function you are trying to compute the OM functional at). Expand, and you see that the term $\\int_0^T|f'(\\phi_t)|^2 $ is replaced by something else. $\\endgroup$ ofer zeitouni –  ofer zeitouni 2020-06-15 05:52:17 +00:00 Commented Jun 15, 2020 at 5:52 $\\begingroup$ The something else is simply the integral of the square of the functional derivative along the path, something like $\\int_0^T \\int_0^T ds ds' \\int_0^{s'}\\int_0^s \\partial_u g(\\phi_0^s) du \\partial_{u'} g(\\phi_0^{s'}) du'$. Writing a full proof will require a few pages... $\\endgroup$ ofer zeitouni –  ofer zeitouni 2020-06-15 05:59:14 +00:00 Commented Jun 15, 2020 at 5:59 $\\begingroup$ @oferzeitouni Would it be easier to find the Onsager-Machlup function for just $dX(t)=f(B(t))dt$? I know this is a different problem. $\\endgroup$ user158968 –  user158968 2020-06-15 06:02:30 +00:00 Commented Jun 15, 2020 at 6:02 $\\begingroup$ Sorry, too hasty. The scaling of this problem is off. Indeed, if $\\|B-\\phi\\|<\\epsilon$ you have $\\|X-\\int_0^T f(\\phi) dt\\|\\sim C\\epsilon$ with $C\\neq 1$, so I would not expect the OM functional to make sense. $\\endgroup$ ofer zeitouni –  ofer zeitouni 2020-06-15 06:42:55 +00:00 Commented Jun 15, 2020 at 6:42 $\\begingroup$ What is $\\mu_0$? and are you averaging on $B$ but not $X$? they are of course dependent, so I suspect this is not correct, but I am not sure. There should not be an expectation in the definition of $g$ $\\endgroup$ ofer zeitouni –  ofer zeitouni 2020-06-16 06:39:46 +00:00 Commented Jun 16, 2020 at 6:39  |  Show 2 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions pr.probability stochastic-processes stochastic-calculus stochastic-differential-equations See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 19 Fictitious density of paths of diffusion processes outside the Cameron--Martin space 6 Onsager-Machlup function and most probable path of a diffusion process 0 Stochastic invariant subset 3 Onsager--Machlup functional as the density across a mesh of discrete points 2 When is the mode of a stochastic process a better statistic than the mean? 7 Onsager-Machlup functional when drift is time-dependent 5 Riemannian metric induced by a stochastic differential equation $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363084, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "pr.probability,stochastic-processes,stochastic-calculus,stochastic-differential-equations,pr.probability,stochastic-processes,stochastic-calculus,stochastic-differential-equations",
  "scraped_at": "2026-01-14T04:16:56.694182",
  "answer": ""
}