{
  "id": "q_365774",
  "mathoverflow_id": 365774,
  "url": "https://mathoverflow.net/questions/365774/vertex-cover-algorithm",
  "title": "graph theory - Vertex cover algorithm",
  "body": "Given a graph $G(V, E)$ , remove the vertex (or one of the vertices) with the highest cardinality from $G$ and put it in a list $L$ . Repeat until in $G$ there are only vertices with cardinality $0$ (no edges in the graph). Now, for each vertex $v$ of $L$ , from the first to the last (first in first out), check if its edges, in the given graph, are covered by the vertices that are after $v$ in the list. If it is, remove $v$ from $L$ , otherwise leave $v$ in $L$ . At the end the vertices of $L$ are a vertex cover of the given $G(V, E)$ , but is it a minimum vertex cover? I can not find an example where the algorithm does not find a minimum vertex cover. graph-theory algorithms computer-science graph-colorings Share Cite Improve this question Follow edited Jul 16, 2020 at 12:51 Rodrigo de Azevedo 2,653 3 3 gold badges 18 18 silver badges 37 37 bronze badges asked Jul 16, 2020 at 11:25 Mario Giambarioli 123 1 1 silver badge 5 5 bronze badges $\\endgroup$ 7 1 $\\begingroup$ Why MathOverflow instead of Computer Science SE or CS Theory SE? $\\endgroup$ Rodrigo de Azevedo –  Rodrigo de Azevedo 2020-07-16 12:53:07 +00:00 Commented Jul 16, 2020 at 12:53 2 $\\begingroup$ Given that finding a minimal vertex cover is NP-hard it's unlikely that your algorithm works. Depending on how you break ties in case there is more than one vertex of maximum degree, paths are counterexamples. $\\endgroup$ Florian Lehner –  Florian Lehner 2020-07-16 13:25:51 +00:00 Commented Jul 16, 2020 at 13:25 $\\begingroup$ @FlorianLehner What do you mean with \"paths are counterexamples\"? Both in odd and even paths (i.e. paths with odd/even number of vertices) the algorithm finds a minimum vertex cover. $\\endgroup$ Mario Giambarioli –  Mario Giambarioli 2020-07-16 16:48:49 +00:00 Commented Jul 16, 2020 at 16:48 3 $\\begingroup$ @MarioGiambarioli As I wrote, it depends on how you break ties: in $P_5$ there are three vertices of degree 2, perhaps the algorithm chooses the central vertex first. After that we are left with four vertices of degree 1, the algorithm could pick the endpoints of the original path. So we end up with a cover of 3 vertices, but the unique minimum cover consists of 2 vertices. $\\endgroup$ Florian Lehner –  Florian Lehner 2020-07-16 18:10:25 +00:00 Commented Jul 16, 2020 at 18:10 2 $\\begingroup$ Just to clarify: by cardinality , you mean what's generally called degree ? and when you remove a vertex, you also remove all the edges incident to that vertex? $\\endgroup$ Gerry Myerson –  Gerry Myerson 2020-07-17 00:54:51 +00:00 Commented Jul 17, 2020 at 0:54  |  Show 2 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions graph-theory algorithms computer-science graph-colorings See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 1 Finding a subgraph of cliques with the minimum total sum weight 0 Coloring graph with maximum vertex degree $< k$ so every vertex is a starting point for a path containing each color 5 Vertex cover number vs matching number 3 Relation between vertex connectivity and independent set 3 A variant of the vertex clique cover problem $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365774, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "graph-theory,algorithms,computer-science,graph-colorings,graph-theory,algorithms,computer-science,graph-colorings",
  "scraped_at": "2026-01-14T04:23:01.086889",
  "answer": ""
}