{
  "id": "q_363142",
  "mathoverflow_id": 363142,
  "url": "https://mathoverflow.net/questions/363142/honda-tate-theorem-and-prescribing-roots-of-l-functions",
  "title": "polynomials - Honda-Tate theorem and prescribing roots of $L$-functions",
  "body": "I'm currently working with Artin $L$ -functions in function field extensions (on one variable, over finite fields). I have heard about a theorem of Honda-Tate which vaguely states that a polynomial $P \\in \\mathbb Z[T]$ satisfying certain properties (Riemann hypothesis, functional equation, etc.) is the zeta function of such a function field. I know very little about algebraic geometry, and when I look for Honda-Tate I only find texts about isogenies of abelian varieties, so it is of little use to me stated that way. Would someone be kind enough to provide a statement of Honda-Tate's theorem in the form above, or give a reference to such a statement ? My goal would be to prescribe (inverse) roots of Artin $L$ -functions of a certain shape, say $\\sqrt q$ with a given multiplicity, $\\sqrt q e^{2i\\pi/3}$ with a given multiplicty and so on. polynomials arithmetic-geometry l-functions zeta-functions function-fields Share Cite Improve this question Follow asked Jun 15, 2020 at 16:39 A. Bailleul 1,351 6 6 silver badges 19 19 bronze badges $\\endgroup$ 4 1 $\\begingroup$ For abelian varieties you can get the desired characteristic polynomial of Frobenius on the nose (this is Honda's paper ). Then use that every abelian variety is dominated by a Jacobian of a curve (e.g. take a smooth complete intersection curve inside $A$). $\\endgroup$ R. van Dobben de Bruyn –  R. van Dobben de Bruyn 2020-06-15 17:24:52 +00:00 Commented Jun 15, 2020 at 17:24 1 $\\begingroup$ This gives a curve where the characteristic polynomial of Frobenius contains the given one (as a factor), but it's a very difficult problem to determine which exact polynomials occur. For example, it is only known in characteristic $2$ that $(1-t\\sqrt{q})^{2g}$ occurs on a genus $g$ curve for every $g$ (this is due to van der Geer and van der Vlugt ). (And even then I think it's only an asymptotic result, i.e. for $q = 2^r \\to \\infty$; for smaller $q$ you'd get some roots of unity that might be hard to control.) $\\endgroup$ R. van Dobben de Bruyn –  R. van Dobben de Bruyn 2020-06-15 17:30:14 +00:00 Commented Jun 15, 2020 at 17:30 $\\begingroup$ Thank you for these references. So we cannot prescribe anything more than lower bounds on multiplicities if I understood correctly ? $\\endgroup$ A. Bailleul –  A. Bailleul 2020-06-16 08:55:20 +00:00 Commented Jun 16, 2020 at 8:55 1 $\\begingroup$ In some sense, but you cannot really fix $g$. Given a $q$-Weil polynomial of degree $2g$, it shows up in some curve of genus $g' \\gg g$. There might be an upper bound on $g'$ depending on some stuff, but I'm not entirely sure. $\\endgroup$ R. van Dobben de Bruyn –  R. van Dobben de Bruyn 2020-06-16 21:11:20 +00:00 Commented Jun 16, 2020 at 21:11 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions polynomials arithmetic-geometry l-functions zeta-functions function-fields See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 26 Universality of zeta- and L-functions 5 Why are cohomologically trivial cycles abundant? 17 PNT for general zeta functions, Applications of. 12 Periods and L-values 20 Computing (on a computer) the first few (non-trivial) zeros of the zeta function of a number field. 8 Honda-Tate in families 1 $p$-adic $L$-functions and congruence of $L$-values $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363142, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "polynomials,arithmetic-geometry,l-functions,zeta-functions,function-fields,polynomials,arithmetic-geometry,l-functions,zeta-functions,function-fields",
  "scraped_at": "2026-01-14T04:10:22.584948",
  "answer": ""
}