{
  "id": "q_363769",
  "mathoverflow_id": 363769,
  "url": "https://mathoverflow.net/questions/363769/complex-monge-ampere-equal-with-zero-right-hand-side",
  "title": "ap.analysis of pdes - Complex Monge Ampere equal with zero right hand side",
  "body": "Let $(X, \\omega)$ be a compact Kaehler manifold, with $K_{X}$ numerically effective. Suppose that $[\\zeta] = c_1(K_X)$ and $\\int_{X}\\zeta^n = 0$ . I am interested in solving \\begin{equation} (\\zeta + i \\partial \\bar \\partial f)^n = 0 \\end{equation} for some $f$ smooth. This is immediate if we assume $\\zeta \\geq 0$ . So a solution should be expected to exist by the positivity conjecture in algebraic geometry. But that is certainly a quite hard problem. I wonder whether there has been any results/progresses on solving such an equation. ap.analysis-of-pdes complex-geometry Share Cite Improve this question Follow asked Jun 22, 2020 at 3:39 nathan 31 1 1 bronze badge $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ap.analysis-of-pdes complex-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 8 Monge Ampere equations 6 Chern-Einstein metrics on complex Hermitian manifolds 2 The Monge- Ampère equation with a non positive right hand side $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363769, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ap.analysis-of-pdes,complex-geometry,ap.analysis-of-pdes,complex-geometry",
  "scraped_at": "2026-01-14T04:17:50.420764",
  "answer": ""
}