{
  "id": "q_364691",
  "mathoverflow_id": 364691,
  "url": "https://mathoverflow.net/questions/364691/structural-properties-of-polytopes-for-mainstream-integer-or-linear-programs",
  "title": "oc.optimization and control - Structural properties of polytopes for mainstream integer or linear programs",
  "body": "Are there any papers/textbooks/monographs that describe distinguishing properties of the polytopes that arise when solving the linear relaxation of well-known integer programs? For example, it is well-known that the feasible polytope for the vertex cover problem has the half-integrality property that all corners are $0$ , $1/2$ , or $1$ . Are there any surveys that describe how the polytopes for e.g. set cover, traveling salesman, facility location, Steiner tree, are different from one another? (I realize of course that there could be many different polytopes depending on what formulation one chooses, but I hope this gets my idea across) oc.optimization-and-control convex-polytopes combinatorial-optimization integer-programming Share Cite Improve this question Follow asked Jul 2, 2020 at 19:53 Tom Solberg 4,131 13 13 silver badges 27 27 bronze badges $\\endgroup$ 1 $\\begingroup$ or.stackexchange.com $\\endgroup$ Rodrigo de Azevedo –  Rodrigo de Azevedo 2020-07-03 08:35:05 +00:00 Commented Jul 3, 2020 at 8:35 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions oc.optimization-and-control convex-polytopes combinatorial-optimization integer-programming See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 What is known about worst-case point sets for the travelling salesman problem? 0 Lattice question 5 Generalizations of the \"Curious Tiger\" Polygon 10 What is the convex hull of the quaternionic symmetries of the 3 dimensional cube? 7 Lipschitz-continuity of convex polytopes under the Hausdorff metric 1 $\\mathrm{LP}$ formulation for $\\mathrm{k}$-$\\operatorname{opt}$ moves 0 Integer programming for bin covering problem $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364691, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "oc.optimization-and-control,convex-polytopes,combinatorial-optimization,integer-programming,oc.optimization-and-control,convex-polytopes,combinatorial-optimization,integer-programming",
  "scraped_at": "2026-01-14T04:19:59.988484",
  "answer": ""
}