{
  "id": "q_368498",
  "mathoverflow_id": 368498,
  "url": "https://mathoverflow.net/questions/368498/what-characterizes-the-incidence-matrix-of-a-tripartite-hypergraph",
  "title": "co.combinatorics - What characterizes the incidence matrix of a tripartite hypergraph?",
  "body": "The incidence matrix of a graph $G = (V,E)$ is a matrix with $|V|$ rows and $|E|$ columns, in which element $v,e$ is $1$ if node $v$ is incident to edge $e$ , and $0$ otherwise. In bipartite graphs, the incidence matrix has the following property (called \"total unimodularity\"): the determinant of every square submatrix is either $-1$ or $0$ or $1$ . This property is very useful, because it implies that every linear program in which the constraints are based on this matrix (for example: for finding a maximum cardinality matching, maximum weight matching or minimum vertex cover) has a solution in which all values are integers. I am now researching tripartite hypergraphs . Their incidence matrix need not be totally unimodular. For example, consider the hypergraph on the vertices $\\{1,4,2,5,3,6\\}$ with hyperedges: $\\{ \\{4,5,3\\}, \\{4,2,6\\}, \\{1,5,6\\} \\}$ . Its incidence matrix is 6 by 3: \\begin{pmatrix}0& 0& 1\\\\0 &1 &0\\\\1& 0& 0\\\\1& 1& 0\\\\1& 0& 1\\\\0& 1& 1\\end{pmatrix} The bottom submatrix is a 3-by-3 square matrix whose determinant is $-2$ . Is there another property, weaker than total unimodularity, which characterizes the incidence matrices of tripartite hypergraphs? Cross-posted from math.SE co.combinatorics graph-theory matrices hypergraph Share Cite Improve this question Follow edited Aug 8, 2020 at 18:17 R.P. 4,801 21 21 gold badges 45 45 silver badges 71 71 bronze badges asked Aug 6, 2020 at 19:29 Erel Segal-Halevi 3,579 21 21 silver badges 43 43 bronze badges $\\endgroup$ 1 3 $\\begingroup$ I believe this is more commonly referred to as an \"incidence matrix\", not that it matters hugely. $\\endgroup$ Nate –  Nate 2020-08-06 19:44:05 +00:00 Commented Aug 6, 2020 at 19:44 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions co.combinatorics graph-theory matrices hypergraph See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 6 Complexity for calculating number of Perfect Matchings in k-regular hypergraph 7 Generators for the semigroup $\\mathrm{SL}(n,\\mathbb{N})$ 2 What is a bipartite hypergraph? 4 Relationship between minimum vertex cover and matching width 7 Coarse-graining a hypergraph 2 Deciding Total Unimodularity of Circulant Matrices $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368498, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "co.combinatorics,graph-theory,matrices,hypergraph,co.combinatorics,graph-theory,matrices,hypergraph",
  "scraped_at": "2026-01-14T04:27:28.921069",
  "answer": ""
}