{
  "id": "q_363065",
  "mathoverflow_id": 363065,
  "url": "https://mathoverflow.net/questions/363065/physical-and-mathematical-significance-of-the-ns-2-brane",
  "title": "complex geometry - Physical and mathematical significance of the NS-2 brane",
  "body": "This question is about topological string theory and it was also posted in Physics Stack Exchange. The existence of a new brane called \"an NS-2 brane\" is predicted in (the second paragraph in the page 14 of) the paper N=2 strings and the twistorial Calabi-Yau and confirmed to exist in S-duality and Topological Strings . The argument that confirms the existence of such objects (last paragraph in page eight in S-duality and Topological Strings ) is based on the the fact that the A and B models are S-dual to each other over the same Calabi-Yau space. It is argued that the S-dual picture of a F1-string ending on a lagrangian submanifold in the A picture (S-)dualize to a D1-brane ending on the aforementioned NS-2 brane in the B model. My problem: Although I understand that the NS-2 brane must exists in the B-model as the S-dual of a lagrangian submanifold in the A model, I can't understand the physical and mathematical significance of such objects. Question 1 (Physical significance): My naive intuition says that because the NS-2 brane has a real three dimensional worldvolume, then it should descend from the M-theory membrane (by embedding the topological string into M-theory ). Is this true? And if the answer is positive, how can I check that that? (I'm asking for a chain of dualities that explicitly transform the M2-brane into the NS-2 brane). I'm unsure about the M2 - NS2 identification probably because I don't understand the physical origin of a lagrangian submanifold in the A-model. Strings can end on lagrangian subspaces but as far I understand, lagrangian submanifolds are also three dimensional submanifolds but not M2 branes, aren't they? Question 2 (Mathematical significance): The next cite can be read in the first paragraph in the page nine of S-duality and Topological Strings \"Their geometric meaning (talking about the NS-2 brane) is that they correspond to a source for lack of integrability of the complex structure of the Calabi-Yau in the B-model.\" Does that mean that the NS-2 brane is \"charged\" under the Nijenhuis tensor of the target space? A little bit more precisely, an NS-2 brane can be defined as any three dimensional geometric place at which the integral of the (pullback) of the Nijenhuis tensor is non-zero? Any advice/comment/reference is very welcome. complex-geometry mp.mathematical-physics topological-quantum-field-theory mirror-symmetry Share Cite Improve this question Follow edited Jun 16, 2020 at 15:38 asked Jun 14, 2020 at 19:07 Ramiro Hum-Sah 502 4 4 silver badges 12 12 bronze badges $\\endgroup$ 1 $\\begingroup$ Crossposted from physics.stackexchange.com/q/556462/2451 $\\endgroup$ Qmechanic –  Qmechanic 2020-06-16 14:56:59 +00:00 Commented Jun 16, 2020 at 14:56 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions complex-geometry mp.mathematical-physics topological-quantum-field-theory mirror-symmetry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 29 Topologically distinct Calabi-Yau threefolds 3 About topological B model 36 What are D-branes, really? 7 Mirror symmetries for generalized geometries ? 4 A question on the topological change of dualizing a SLAG fibration. 22 What are \"branes\", and why do they form a category? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363065, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "complex-geometry,mp.mathematical-physics,topological-quantum-field-theory,mirror-symmetry,complex-geometry,mp.mathematical-physics,topological-quantum-field-theory,mirror-symmetry",
  "scraped_at": "2026-01-14T04:10:15.859922",
  "answer": ""
}