{
  "id": "q_366474",
  "mathoverflow_id": 366474,
  "url": "https://mathoverflow.net/questions/366474/motives-under-de-singularization",
  "title": "ag.algebraic geometry - Motives under de-singularization",
  "body": "Let $X$ be a singular variety over a field $k$ of characteristic 0. Suppose a minimal resolution of singularities of $X$ , $f:\\tilde{X} \\rightarrow X$ , exists, i.e., $\\tilde{X}$ is a smooth projective variety, $f$ is a proper birational morphism and every resolution of singularities of $X$ factors through $f$ . What is the most one can say about the relationship between the motives and motivic cohomology of $X$ and $\\tilde{X}$ ? A simple illustrative example would be very helpful as would any references. ag.algebraic-geometry Share Cite Improve this question Follow edited Jul 24, 2020 at 16:53 asked Jul 24, 2020 at 16:45 user161697 11 2 2 bronze badges $\\endgroup$ 2 1 $\\begingroup$ There is a \"formula\" (more precisely, a distinguished triangle) for the motive of a blow-up (hence, a long exact sequence for motivic cohomology), which you can find e.g. in Voevodsky et al., Cycles, Transfers and Motivic Homology Theories , (4.1.3). $\\endgroup$ François Brunault –  François Brunault 2020-07-24 18:05:48 +00:00 Commented Jul 24, 2020 at 18:05 $\\begingroup$ @FrançoisBrunault, Thank you! $\\endgroup$ user161697 –  user161697 2020-07-24 18:14:32 +00:00 Commented Jul 24, 2020 at 18:14 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 19 Best strategy for small resolutions 11 blow-up proper varieties to projective ones 0 blow-ups and singularities 3 Is it possible to resolve singularities using only normal varieties? 3 Existence of birational sections over a center of an exceptional divisor 2 Motives of resolutions of singularities $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366474, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,ag.algebraic-geometry",
  "scraped_at": "2026-01-14T04:24:16.427403",
  "answer": ""
}