{
  "id": "q_365701",
  "mathoverflow_id": 365701,
  "url": "https://mathoverflow.net/questions/365701/big-category-o-for-rational-cherednik-algebras",
  "title": "reference request - (Big) Category O for rational Cherednik algebras",
  "body": "Let $H_{c}$ , for simplicity, be the rational Cherednik algebra with parameter $t=1$ , with triangular strucuture $\\mathbb{C}[h] \\otimes \\mathbb{C} W \\otimes \\mathbb{C}[h^*]$ , and $(W,h)$ the defining complex representation. Consider the full subcategory category $O_c$ of finitely generated $H_c$ -modules $M$ such that $h \\subset \\mathbb{C}[h^*]$ acts locally finitely on $M$ . (cf. Gordon, section 5.3 in https://arxiv.org/pdf/0712.1568.pdf ) We have $O_c$ = $\\bigoplus_{\\lambda \\in h^*/W} \\mathcal{O}_c(\\lambda)$ , where $\\mathcal{O}_c(\\lambda)$ is the full subcategory of $O_c$ , consisting of modules $M$ where each $P \\in \\mathbb{C}[h^*]^W$ is such that $P-P(\\lambda)$ acts locally nilpotently. $\\mathcal{O}_c(0)$ is the usual category $\\mathcal{O}_c$ considered by a number of people. $\\mathcal{O}_c$ is quite well understood: it is a highest weight category in the sense of Cline-Parshall-Scott; we have analogues of Verma modules of Lie theory, BGG reciprocity, KZ-functor, etc (cf. Guay Projective modules in the category O for the Cherednik algebra ; Ginzburg et al. On the category O for rational Cherednik algebras ). Question What is the current understanding of the bigger category $O_c$ ? Works that discuss this bigger category that I know of are the aforementioned work of Ginzburg et al., and also to a certain extent Ginzburg, On primitive ideals , and Bezrukavnikov and Etingof, Parabolic induction and restriction functors for rational Cherednik algebras . References or any discussion you might have on this topic would be greatly appreciated. I finish with: Small question If $\\mathcal{O}_c(0)$ is a semisimple abelian category, is also $\\mathcal{O}_c(\\lambda)$ a semisimple category for every $\\lambda$ as well? reference-request rt.representation-theory sg.symplectic-geometry Share Cite Improve this question Follow asked Jul 15, 2020 at 14:44 jg1896 3,766 12 12 silver badges 29 29 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request rt.representation-theory sg.symplectic-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 33 Why the BGG category O? 6 Translation functors for category $\\mathcal O$ 4 Serre functor of a subcategory (in particular parabolic category O) 1 Graded category O for for rational Cherednik algebras, but at t=0 3 Coinduced modules in the BGG category $\\mathcal O$ over complex semisimple Lie algebras 1 About finite direct sum of full subcategory of category $\\mathcal{O}^\\mathfrak{p}$ 2 Verma modules in category $\\mathcal{O}^\\mathfrak{p}$ 10 Is the tensor product of two infinite dimensional objects in the BGG category $\\mathcal{O}$ of a semisimple Lie algebra always not in $\\mathcal{O}$? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365701, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,rt.representation-theory,sg.symplectic-geometry,reference-request,rt.representation-theory,sg.symplectic-geometry",
  "scraped_at": "2026-01-14T04:22:44.986182",
  "answer": ""
}