{
  "id": "q_366644",
  "mathoverflow_id": 366644,
  "url": "https://mathoverflow.net/questions/366644/linearly-dependent-points-and-the-uniform-position-theorem",
  "title": "ag.algebraic geometry - Linearly dependent points and the uniform position theorem",
  "body": "One proof of the uniform position theorem (as stated in p. 109 or p. 113 in Section III.1 of \"Geometry of Algebraic Curves\") uses a monodromy argument. While this gives us something even more general than the usual statement of the uniform position theorem, it isn't something that is constructive. What is currently known about the locus of hyperplanes whose intersection with a curve gives a linearly dependent collection of points? Is there an analogue involving higher dimensional varieties? The reason I'm not sure is that uniform position in higher dimensional varieties involves intersection with generic hyperplanes ( Uniform position principle ). As a start, there is generalization of the usual statement of the uniform position theorem involving divisors containing a given hyperplane section (p. 113 in ACGH above). However, it has been difficult to find concrete examples where this non-generic situation is considered. ag.algebraic-geometry reference-request Share Cite Improve this question Follow asked Jul 26, 2020 at 20:06 modnar 521 3 3 silver badges 9 9 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry reference-request See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 2 Uniform position principle Related 16 The Sylvester Gallai Theorem and Sections of Varieties with \"Simple Topology\". 12 Lefschetz hyper-plane theorem for singular projective varieties? 0 Uniform position property and general hyperplanes 5 Number of regions of a hyperplane arrangement avoiding a generic hyperplane 8 Lefschetz on étale fundamental group for quasi-projective varieties 7 varieties with no new cohomology in hyperplane sections $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366644, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,reference-request,ag.algebraic-geometry,reference-request",
  "scraped_at": "2026-01-14T04:24:41.134046",
  "answer": ""
}