{
  "id": "q_365948",
  "mathoverflow_id": 365948,
  "url": "https://mathoverflow.net/questions/365948/equivalence-relation-induced-by-kolmogorov-quotients",
  "title": "reference request - Equivalence relation induced by Kolmogorov quotients",
  "body": "Recall: given a (possibly non- $T_0$ ) topological space $X$ , its Kolmogorov quotient $KX$ is the $T_0$ topological space formed by $X/\\sim$ where $x\\sim y$ if they are topologically indistinguishable. Denote the mapping $X\\to KX$ of $x$ to its equivalence class $\\pi$ . I have two loosely related terminology questions: Is it okay to use the word \"section\" to refer to a mapping (and/or the image of such a mapping) $\\gamma: KX \\to X$ such that $\\pi\\circ \\gamma = id$ ? (This would be the word from category theory, just wondering if there is another established terminology that is used.) Is there a word for the equivalence relationship where two topological spaces $X$ and $Y$ are said to be equivalent if their quotients $KX$ and $KY$ are homeomorphic? (I am particularly interested in the case where the non- $T_0$ topology comes from a semi-norm or a pseudo-metric; so if there is an answer to 2 when restricted to semi-normed spaces or pseudometric spaces, I'd be happy too.) reference-request gn.general-topology terminology Share Cite Improve this question Follow asked Jul 18, 2020 at 17:37 Willie Wong 42.1k 5 5 gold badges 97 97 silver badges 184 184 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request gn.general-topology terminology See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 6 Sierpinski-like spaces 18 Quotient of metric spaces 5 Space of curves 9 When $X \\times Y \\cong X \\times Z$ implies $Y \\cong Z$ (in the category of finite topological spaces) 3 Quotient of compact metrizable space in Hausdorff space 14 Are the “topologies” arising from constructive type theories with quotients actually condensed sets? 5 Quotients in categories of metric spaces 10 What is known about elementary equivalence of open set posets of topological spaces? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365948, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,gn.general-topology,terminology,reference-request,gn.general-topology,terminology",
  "scraped_at": "2026-01-14T04:23:31.127884",
  "answer": ""
}