{
  "id": "q_364490",
  "mathoverflow_id": 364490,
  "url": "https://mathoverflow.net/questions/364490/analytic-solution-of-a-compact-operator-eigenvector-integral-equation",
  "title": "Analytic solution of a compact operator eigenvector (integral equation)",
  "body": "In Sewall Wright's Evolution of Mendalian Population , the equation for the nonrecurrent mutation is $$\\frac{\\phi(x)}n = \\binom n {nx}\\int_0^1 q^{nx}(1-q)^{n(1-x)}\\phi(q)\\,dq,\\quad \\forall x\\in[0,1],$$ where $n>0$ and $\\binom a b$ is the binomial coefficient. We are to solve for a nonzero function $\\phi\\ne0$ . It is an eigenvalue problem of a compact operator (Fredholm equation of the second kind). But what is a general method for solving this integral equation? dirichlet Is there a transform, say Mellin transform, that does the trick? operator-theory fredholm-operators Share Cite Improve this question Follow asked Jun 30, 2020 at 5:34 Hans 2,363 15 15 silver badges 33 33 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions operator-theory fredholm-operators See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 0 Eigenvalues of an integral operator 2 Structure of the inverse of a Fredholm integral operator of the second kind $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364490, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "operator-theory,fredholm-operators,operator-theory,fredholm-operators",
  "scraped_at": "2026-01-14T04:19:12.509156",
  "answer": ""
}