{
  "id": "q_366633",
  "mathoverflow_id": 366633,
  "url": "https://mathoverflow.net/questions/366633/l-functions-of-elliptic-curves-over-quadratic-fields",
  "title": "L functions of elliptic curves over quadratic fields",
  "body": "Let $E$ be an ellitpic curve over a quadratic field $K/\\mathbb{Q}$ . Then the L function of $E$ is defined as $L(E_K,s)=\\prod_{\\mathfrak{p}\\nmid \\Delta}(1-a_{\\mathfrak{p}}N(\\mathfrak{p})^{-s}+N(\\mathfrak{p})^{1-2s})\\prod_{\\mathfrak{p}|\\Delta}(1-a_{\\mathfrak{p}}N(\\mathfrak{p})^{-s})$ , where $a_{\\mathfrak{p}}=N(\\mathfrak{p})+1-\\#E(\\mathcal{O}_K/\\mathfrak{p})$ . Given an elliptic curve explicitly, how to find effectively the Dirichlet series of $L(E_K,s)$ and its functional equation? elliptic-curves l-functions bessel-functions Share Cite Improve this question Follow asked Jul 26, 2020 at 18:12 Dianbin Bao 609 4 4 silver badges 12 12 bronze badges $\\endgroup$ 5 2 $\\begingroup$ One can find the conductor with Tate's algorithm. Then look for Hilbert modular forms / Bianchi modular forms of the corresponding level. Or, if the conductor is small, look it up here lmfdb.org/EllipticCurve $\\endgroup$ Will Sawin –  Will Sawin 2020-07-26 18:19:51 +00:00 Commented Jul 26, 2020 at 18:19 1 $\\begingroup$ Many computer algebra systems can do this for you. For instance in pari/gp, use nfinit (for $K$) + ellinit (for $E$) + lfuncreate (for $L$) (look up the documentation to learn how to use those). $\\endgroup$ Aurel –  Aurel 2020-07-26 19:28:07 +00:00 Commented Jul 26, 2020 at 19:28 $\\begingroup$ Can you be a little more precise about what you mean? How to find the first $n$ coefficients of the Dirichlet series from the $a_p$'s, and the analytic conductor and the root number? In what sense do you have the elliptic curve and what sense do you want the L-function? $\\endgroup$ Kimball –  Kimball 2020-07-26 23:14:36 +00:00 Commented Jul 26, 2020 at 23:14 $\\begingroup$ $a_{\\mathfrak{p}}$ can be computed by counting. To me it seems not effective to compute $a_n$ by the Euler product. I want the dirichelt series of the L function and its functional equation to compute numerically the critial values of the L functions. By the comment of Will above, it seems to corresponds to Hilbert modular forms or Bianchi modulars depending whether the quadratic field is real or complex? $\\endgroup$ Dianbin Bao –  Dianbin Bao 2020-07-27 00:31:25 +00:00 Commented Jul 27, 2020 at 0:31 $\\begingroup$ In practice, computing critical values is more or less equivalent to computing the first $O(\\sqrt N)$ L-series coefficients. I'm not sure it will ever be more efficient to compute critical values by a correspondence to a Hilbert/Bianchi form. (In the case over Q, this only occurs when there is an easy eta-product for the modular form, or possibly when there is CM (both are easy to compute in that case)). OTOH, some theoretical constructs (ie period relations) might be easier for the form rather than the curve. $\\endgroup$ OmniaOperator –  OmniaOperator 2020-07-27 02:41:34 +00:00 Commented Jul 27, 2020 at 2:41 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions elliptic-curves l-functions bessel-functions See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 0 Can we find a set of elliptic curves over rationals associated with $f$?. 3 a question on CM elliptic curves 1 Fields of definition for torsion points on elliptic curves over finite fields 6 Endomorphism rings of ordinary elliptic curves 7 Elliptic curves of high rank over quadratic extensions 4 Szpiro ratios of elliptic curves over $\\mathbb{Q}$ $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366633, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "elliptic-curves,l-functions,bessel-functions,elliptic-curves,l-functions,bessel-functions",
  "scraped_at": "2026-01-14T04:24:38.873982",
  "answer": ""
}