{
  "id": "q_364992",
  "mathoverflow_id": 364992,
  "url": "https://mathoverflow.net/questions/364992/two-closed-lagrangians-embedded-in-mathbbr2n-can-be-shifted-and-perturbe",
  "title": "sg.symplectic geometry - Two closed lagrangians embedded in $\\mathbb{R}^{2n}$ can be shifted and perturbed to intersect at two points",
  "body": "In Polterovich paper \"The surgery of Lagrange manifolds\" . It is stated in page 204 - in proof of Theorem 7a - the following, If $L_1$ and $L_2$ are two Lagrangian submaifolds of $\\mathbb{C}^{n}$ , then after suitable linear shift and small perturbation we can assume $L_1$ and $L_2$ have exactly two intersection points. I will be glad if some one help me see how such small perturbation is made so that we get exactly two points of intersections. sg.symplectic-geometry symplectic-topology Share Cite Improve this question Follow edited Jul 6, 2020 at 22:18 asked Jul 6, 2020 at 21:05 mahmoud314 41 2 2 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions sg.symplectic-geometry symplectic-topology See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 11 Index theorem interpretation of the spectral flow for a pseudo holomorphic curve 4 How much of a ball $B_R^{2n}$ can be symplectically embedded in the cylinder $B_r^2\\times\\mathbb R^{2n-2}$? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364992, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "sg.symplectic-geometry,symplectic-topology,sg.symplectic-geometry,symplectic-topology",
  "scraped_at": "2026-01-14T04:20:46.043758",
  "answer": ""
}