{
  "id": "q_363129",
  "mathoverflow_id": 363129,
  "url": "https://mathoverflow.net/questions/363129/prime-decomposition-in-even-dihedral-extensions",
  "title": "nt.number theory - prime decomposition in even dihedral extensions",
  "body": "Let $L/K$ be a finite extension of number fields of degree $n$ with $n$ an even integer such that the normal closure of $L$ has the Galois group isomorphic to $D_n$ , the dihedral group of order $2n$ . Is there any result about the decomposition form of a prime $\\mathfrak{p}$ of $K$ in $L$ ? nt.number-theory analytic-number-theory algebraic-number-theory number-fields Share Cite Improve this question Follow asked Jun 15, 2020 at 15:26 A. Maarefparvar 597 2 2 silver badges 9 9 bronze badges $\\endgroup$ 2 $\\begingroup$ Can you be a little more specific as to what you're looking for? Do you understand the general situation for relating splitting in $L/K$ to splitting in the Galois closure? If not, I'd say this is more appropriate for MathStackExchange. $\\endgroup$ Kimball –  Kimball 2020-06-15 16:15:03 +00:00 Commented Jun 15, 2020 at 16:15 $\\begingroup$ Many thanks for your response. I'm looking for an explicit decomposition form in \"even dihedral extensions L/K\" (or in the Galois closure of L over K) as in Cohen's book (Advanced Topics in Computational Number Theory, Proposition 10.1.26) the decomposition form of primes in a \"prime order\" dihedral extensions is formulated. $\\endgroup$ A. Maarefparvar –  A. Maarefparvar 2020-06-16 08:51:13 +00:00 Commented Jun 16, 2020 at 8:51 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions nt.number-theory analytic-number-theory algebraic-number-theory number-fields See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 12 Dihedral extensions and the Ankeny–Artin–Chowla conjecture 13 What are Mean Values of Ideal Densities in Galois Extensions? 1 Decomposition forms in Frobenius extensions 7 The outer automorphism of the dihedral group $D_4$ and quartic polynomials 4 Dihedral extension of $\\mathbb Q$ with small discriminant 9 Galois embedding question for dihedral groups 4 Finding field extensions in which a given prime is inert 5 Number fields with finite maximal unramified $p$-extensions 2 $f(x)\\bmod p$ and decomposition of prime ideals $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363129, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "nt.number-theory,analytic-number-theory,algebraic-number-theory,number-fields,nt.number-theory,analytic-number-theory,algebraic-number-theory,number-fields",
  "scraped_at": "2026-01-14T04:10:20.347375",
  "answer": ""
}