{
  "id": "q_363365",
  "mathoverflow_id": 363365,
  "url": "https://mathoverflow.net/questions/363365/when-linear-strongly-elliptic-operators-are-invertible",
  "title": "fa.functional analysis - When linear strongly elliptic operators are invertible?",
  "body": "I am studying Pazy's book \"Semigroups of Linear Operators and Applications to Partial Differential Equations\" and when considering an operator like: A linear differential operator, $$A : W^{2m,p}(\\Omega)\\cap W^{m,p}_0(\\Omega) \\subset L^p(\\Omega) \\to L^p(\\Omega),$$ where $\\Omega$ is a bounded open set on $\\mathbb{R}^n$ with smooth boundary, $1 < p < \\infty$ . If one assumes that $A$ is strongly elliptic, in order to show (via his argument) that $-A$ generates an analytic semigroup one must assume that $0\\in \\rho(A)$ (the resolvent set) (i.e, $A$ is invertible). So, my question is: is this operator necessarily invertible? He does not mention it anywhere. fa.functional-analysis sp.spectral-theory elliptic-pde parabolic-pde Share Cite Improve this question Follow edited Jun 17, 2020 at 20:03 leo monsaingeon 5,285 2 2 gold badges 26 26 silver badges 51 51 bronze badges asked Jun 17, 2020 at 19:16 L.F. Cavenaghi 1,824 12 12 silver badges 19 19 bronze badges $\\endgroup$ 2 1 $\\begingroup$ Well, $0\\in\\rho(A)$ means $A$ is invertible, by definition. But this condition is certainly not necessary for $A$ to generate an analytic semigroup. $\\endgroup$ Michael Renardy –  Michael Renardy 2020-06-17 19:42:15 +00:00 Commented Jun 17, 2020 at 19:42 $\\begingroup$ @MichaelRenardy, yeah, I am sorry, I think I wrote it badly, the point is, is it true that $0\\in\\rho(A)$? I didn't want to write it as a claim, this is indeed my question. I totally agree that it is not necessary to show that $A$ generates an analytic semigroup, but it is definitely necessary on his argument. $\\endgroup$ L.F. Cavenaghi –  L.F. Cavenaghi 2020-06-17 19:52:58 +00:00 Commented Jun 17, 2020 at 19:52 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions fa.functional-analysis sp.spectral-theory elliptic-pde parabolic-pde See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 3 Fractional power of operators in $C_0$-semigroup 4 Strongly continuous semigroups and symbols of pseudo differential operators 3 BVPs for elliptic PDOs: When do Green functions ($L^2$ inverses) define pseudo-differential operators in the interior? 3 Does uniform boundedness carry over from the non-negative real axis to closed sectors of $\\mathbb{C}$ for analytic semigroups? 2 Compact operators on Banach spaces and their spectra 4 Contractivity of Neumann Laplacian $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363365, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "fa.functional-analysis,sp.spectral-theory,elliptic-pde,parabolic-pde,fa.functional-analysis,sp.spectral-theory,elliptic-pde,parabolic-pde",
  "scraped_at": "2026-01-14T04:10:47.284200",
  "answer": ""
}