{
  "id": "q_363334",
  "mathoverflow_id": 363334,
  "url": "https://mathoverflow.net/questions/363334/is-a-group-determined-by-the-number-of-ways-its-elements-multiply-to-the-identit",
  "title": "co.combinatorics - Is a group determined by the number of ways its elements multiply to the identity under some ordering?",
  "body": "Let $G$ be a group, and for each ordered $n$ tuple $(g_1,...g_n)$ of elements of $G$ , consider the function $f_n$ that outputs the number of permutations $\\sigma\\in S_n$ for which $g_{\\sigma(1)}g_{\\sigma(2)}...g_{\\sigma(n)}=e$ . Is the group determined up to isomorphism by these functions $f_n$ ? More precisely, if we have a set $G$ , and two collections of functions $f^1_n,f^2_n$ on $n$ tuples of elements of $G$ , such that there exists group structures $\\mu_1,\\mu_2:G\\times G\\rightarrow G$ , $\\epsilon_1,\\epsilon_2:\\ast\\rightarrow G$ on $G$ giving rise to $f^i_n$ in the manner described above, is there a bijection $X\\rightarrow X$ which identifies the groups $(\\mu_1,\\epsilon_1)$ , and $(\\mu_2,\\epsilon_2)$ ? Note that we can recover identity from $f_1$ , inverses from $f_2$ , and by looking at $3$ tuples, we can partially deduce the group law, in that we can say when $gh=k$ or $hg=k$ holds for any $g,h,k\\in G$ . So in particular, this has an affirmative answer when $G$ is abelian. For the general case, I wasn't able to find a similarly elementary argument. co.combinatorics gr.group-theory Share Cite Improve this question Follow edited Jun 17, 2020 at 13:58 YCor 67.5k 5 5 gold badges 203 203 silver badges 301 301 bronze badges asked Jun 17, 2020 at 13:27 Chris H 1,979 10 10 silver badges 20 20 bronze badges $\\endgroup$ 6 1 $\\begingroup$ In the title \"multiset\" sounds weird, as for a multiset in a non-abelian group, to \"multiply to 1\" doesn't make sense. The first question is a bit unclear: is $n$ fixed? it seems not, after reading the sequel. Also in the second question you mean \"unique up to isomorphism\", or maybe up to permutation of $X$ preserving $f$. $\\endgroup$ YCor –  YCor 2020-06-17 13:32:00 +00:00 Commented Jun 17, 2020 at 13:32 $\\begingroup$ Edited for clarity, I wasn't quite sure how to phrase the title, if you can think of better wording that would be very helpful. $\\endgroup$ Chris H –  Chris H 2020-06-17 13:49:39 +00:00 Commented Jun 17, 2020 at 13:49 $\\begingroup$ Actually what you count is more precise, since you retain the number of permutations. $\\endgroup$ YCor –  YCor 2020-06-17 13:51:01 +00:00 Commented Jun 17, 2020 at 13:51 $\\begingroup$ It's equivalent to know, for each $g$ and $h$, the multiset $\\{gh, hg\\}$. (And knowing that multiset is equivalent to knowing the set.) You'e shown that counting gives us this information. Conversely, if we have $n$ elements, and count all the ways to choose two of them, multiply them in any order, then choose another, and multiply it in any order, and so on, until all are chosen, we will count each ordering the same number $2^{n-2}$ of times. So to recover your information, we can sum over the possible pairwise products and then divide by $2^{n-2}$. $\\endgroup$ Will Sawin –  Will Sawin 2020-06-17 14:38:35 +00:00 Commented Jun 17, 2020 at 14:38 $\\begingroup$ Some more things you can recover from the $f_n$: orders of elements, subgroups, when two elements commute, centralisers, centre, conjugacy classes, normal subgroups, .... I don't know enough group theory to know if a subset of these properties recovers the group (maybe assuming $G$ is finite), but this is all pretty strong evidence that at least $(G,\\mu_1)$ and $(G,\\mu_2)$ are abstractly isomorphic. $\\endgroup$ R. van Dobben de Bruyn –  R. van Dobben de Bruyn 2020-06-18 04:14:58 +00:00 Commented Jun 18, 2020 at 4:14  |  Show 1 more comment 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions co.combinatorics gr.group-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 2 elements in the weyl group 8 Permutations of prescribed cycle types that multiply to the identity 4 Potentially identity elements in an Abelian group 0 Find the trace for some elements in group algebra 8 Harmonic flow on the Young lattice 9 Morse theory on outer space via the lengths of finitely many conjugacy classes 5 Number of $k$-tuples of elements generating a cyclic group 6 Number of ways a positive integer n can be expressed as a sum of k natural numbers under a certain ordering condition 8 Existence of a special ordering of the elements of a finite group 2 Existence of a special ordering of the elements of a finite group (II) $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363334, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "co.combinatorics,gr.group-theory,co.combinatorics,gr.group-theory",
  "scraped_at": "2026-01-14T04:17:05.929741",
  "answer": ""
}