{
  "id": "q_368693",
  "mathoverflow_id": 368693,
  "url": "https://mathoverflow.net/questions/368693/entire-function-which-modulus-grows-only-along-the-real-axis",
  "title": "cv.complex variables - Entire function which modulus grows only along the real axis",
  "body": "My research in theoretical physics led to the necessity of constructing an entire function with modulus decaying in the significant part of the complex plane. I wonder whether this is possible because all my attempts to combine known examples of entire functions show that the result is decaying at most for the half of the complex plane. Let me put the sharp version of the question. Can the modulus of entire function decay for all directions in the complex plane except the positive real axis? I don't see the obvious contradiction of such a behaviour with Picard's little theorem and Liouville's theorem. However, I failed to construct an example. I would be grateful for references about stronger results constraining the behaviour of entire functions. For my research I seek an entire function with somewhat weaker condition which decays everywhere except the arguments of complex numbers $z$ satisfying the condition $\\Re z > a (\\Im z)^2$ with some real positive $a$ . cv.complex-variables Share Cite Improve this question Follow edited Aug 9, 2020 at 10:57 R.P. 4,801 21 21 gold badges 45 45 silver badges 71 71 bronze badges asked Aug 9, 2020 at 9:52 Anna 41 1 1 bronze badge $\\endgroup$ 3 3 $\\begingroup$ This question was answered here: mathoverflow.net/questions/190837/… If this is not enough, state your question more precisely. $\\endgroup$ Alexandre Eremenko –  Alexandre Eremenko 2020-08-09 12:27:56 +00:00 Commented Aug 9, 2020 at 12:27 $\\begingroup$ Thank you very much for the reference! Anver Kiro suggested such an example in the explicit form of the Taylor series here: mathoverflow.net/q/191663 . However, I am confused with the fact that this series is divergent for |z|>1 if the notation log^n (...) is assumed to be (log(...))^n. But an entire function must be represented by the Tailor series which are convergent everywhere. If I misunderstand the notation I would be grateful to learn what does this mean. $\\endgroup$ Anna –  Anna 2020-08-09 22:58:00 +00:00 Commented Aug 9, 2020 at 22:58 1 $\\begingroup$ You are right: that answer with Taylor series makes no sense. The correct one is the first answer. $\\endgroup$ Alexandre Eremenko –  Alexandre Eremenko 2020-08-10 01:36:10 +00:00 Commented Aug 10, 2020 at 1:36 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions cv.complex-variables See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 30 Entire function bounded at every line Related 3 A question around Liouville's theorem 6 Entire function that grows along one axis and decays along the other 3 Singular set of entire functions 3 Looking for a sequence of analytic functions with strange behaviour 4 Asymptotics of an entire function with real zeroes on the real line 8 Order 1 entire function that decays along the real axis $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368693, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "cv.complex-variables,cv.complex-variables",
  "scraped_at": "2026-01-14T04:28:09.657508",
  "answer": ""
}