{
  "id": "q_363473",
  "mathoverflow_id": 363473,
  "url": "https://mathoverflow.net/questions/363473/is-the-existence-of-undecidable-propositions-decidable",
  "title": "lo.logic - Is the existence of undecidable propositions decidable?",
  "body": "In proving his first incompleteness theorem Godel constructed a proposition that is undecidable, i.e. neither provable nor disprovable within a consistent formal system $F$ that contains elementary arithmetic. My question is: Can the (true) statement $D$ =\"There exist propositions in $F$ that are undecidable\" be proved within some formal system $F$ to which the first incompleteness theorem applies? Note that $D$ is expressible as $$\\neg (\\forall _n \\exists_m [(\\Pi_m \\text{ proves } P_n) \\lor (\\Pi_m \\text{ proves }\\neg P_n)])$$ where $P_n$ is the $n$ -th proposition and $\\Pi_m$ is the $m$ -th proof. Hence this should be a valid arithmetical proposition in the Godel encoding. lo.logic Share Cite Improve this question Follow asked Jun 18, 2020 at 19:59 Ivan Meir 4,972 3 3 gold badges 34 34 silver badges 43 43 bronze badges $\\endgroup$ 6 7 $\\begingroup$ No. If $F$ proves that some statements are undecidable in $F$, then $F$ would prove $F$ is consistent (as otherwise it proves everything), which is impossible by Godel's second incompleteness theorem. $\\endgroup$ Wojowu –  Wojowu 2020-06-18 20:01:44 +00:00 Commented Jun 18, 2020 at 20:01 2 $\\begingroup$ To build off of Wojowu's statement, it is possible for a system F to prove \"If F is consistent, then there are undecidable statements in F.\" But what this really is in some sense a theorem of F + Con F being imported into F. $\\endgroup$ JoshuaZ –  JoshuaZ 2020-06-18 20:30:02 +00:00 Commented Jun 18, 2020 at 20:30 1 $\\begingroup$ @Wojowu Thank you for your answer, much appreciated. $\\endgroup$ Ivan Meir –  Ivan Meir 2020-06-18 22:08:24 +00:00 Commented Jun 18, 2020 at 22:08 1 $\\begingroup$ @IvanMeir In principle there are very weak theories that violate second incompleteness theorem (although, in comparision to say $\\mathsf{PA}$, for this theories it is far less clear what should count as \"natural\" formalization of provability). The most well-known examples of theories violating G2 are due to D. Willard, see for example his paper \"Self-verifying axiom systems, the incompleteness theorem and related reflection principles\". There is also my recent example arxiv.org/abs/1907.00877 . By slight modifications of those examples it is easy to get provably undecidable sentences. $\\endgroup$ Fedor Pakhomov –  Fedor Pakhomov 2020-06-20 10:09:53 +00:00 Commented Jun 20, 2020 at 10:09 1 $\\begingroup$ @IvanMeir The key limitation of this kind of theories is that they couldn't prove totality of the successor function. It isn't immediately clear that those theories directly provide examples of provably undecidable sentences. However, it is easy to modify those theories so that this examples will be present. If you add an additional unary predicate $P(x)$ to the theory $H_{<\\omega}$ from my paper, then the same argument used to show that $H_{<\\omega}\\vdash \\mathsf{Con}(H_{<\\omega})$ will show that $\\exists x\\;P(x)$ is provably undecidable for $H_{<\\omega}$. $\\endgroup$ Fedor Pakhomov –  Fedor Pakhomov 2020-06-20 20:40:53 +00:00 Commented Jun 20, 2020 at 20:40  |  Show 1 more comment 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions lo.logic See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 13 Most general formulation of Gödel's incompleteness theorems 16 Finite versions of Godel' s incompleteness 1 Was \"arithmetical translation\" (coding in the Goedel sense) ever a part of Hilbert's Program? 3 Theories of arithmetic from recursively inseparable sets 28 How do we construct the Gödel’s sentence in Martin-Löf type theory? 2 Can we use remote provability to prove the first incompleteness theorem sans $\\omega$-consistency? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363473, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "lo.logic,lo.logic",
  "scraped_at": "2026-01-14T04:17:15.291778",
  "answer": ""
}