{
  "id": "q_366820",
  "mathoverflow_id": 366820,
  "url": "https://mathoverflow.net/questions/366820/concerning-the-omnipresence-of-hyper-elliptic-curves-in-the-construction-of-exam",
  "title": "ag.algebraic geometry - Concerning the omnipresence of hyper-elliptic curves in the construction of examples",
  "body": "Vague rambling: I hate asking these types of questions, but I feel that I would benefit immensely from hearing some discussion of the use of hyperelliptic curves in constructing certain examples. What do I mean? Of course, as mathematicians, and especially as (aspiring) algebraic geometers, either while reading, examples are essential. Often times, however, hyperelliptic curves are mentioned. They are mentioned so often (from what I see) that they must have some property that is very useful when trying to construct examples. Let us consider an actual instance of this: Following Campana's survey on special manifolds , define a Bogomolov sheaf to be a saturated, coherent subsheaf $\\mathcal{L} \\subset \\Omega_X^p$ of rank one over a compact Kähler manifold $X$ such that the Kodaira dimension $\\kappa(X, \\mathcal{L})=p>0$ . The manifold $X$ is said to be special if $X$ admits no Bogomolov sheaves. We'll construct an example of a Bogomolov sheaf as follows: Let $E$ be an elliptic curve and $\\tau$ a translation of order $2$ on $E$ . Let $C$ be a hyperelliptic curve with an involution $\\eta$ . Set $X : = (E \\times C)/\\langle \\tau, \\eta \\rangle$ and let $f : X \\to B$ be the Moishezon--Iitaka map onto some curve $B$ . The saturation of $f^{\\ast}K_B$ in $\\Omega_X^1$ has Kodaira dimension $\\kappa(X, f^{\\ast}K_B)=1$ and is therefore a Bogomolov sheaf. In fact, it is the only one on $X$ . Question: What properties do hyperelliptic curves have that make them useful in the construction of examples? Feel free to downvote my question if this question is better suited for math.stackexchange. The reason for posting the problem to overflow is that the motivation is clearly at the level of research mathematics. And the question is, fundamentally, one of motivation. ag.algebraic-geometry complex-geometry elliptic-curves hyperelliptic-curves Share Cite Improve this question Follow edited Jul 29, 2020 at 7:56 asked Jul 28, 2020 at 20:32 AmorFati 1,399 10 10 silver badges 22 22 bronze badges $\\endgroup$ 12 2 $\\begingroup$ Properties besides being very explicit?. $\\endgroup$ Donu Arapura –  Donu Arapura 2020-07-28 20:42:30 +00:00 Commented Jul 28, 2020 at 20:42 1 $\\begingroup$ @DonuArapura From a geometric perspective, I find elliptic curves much more explicit: they are flat and have genus $1$! $\\endgroup$ AmorFati –  AmorFati 2020-07-28 20:51:20 +00:00 Commented Jul 28, 2020 at 20:51 1 $\\begingroup$ @DonuArapura I will try to be more precise in my question. Again, I apologize for the vague nature of the question. It clearly reflects my lack of understanding of hyperelliptic curves. $\\endgroup$ AmorFati –  AmorFati 2020-07-28 20:52:14 +00:00 Commented Jul 28, 2020 at 20:52 1 $\\begingroup$ If you want to get your hands on a higher genus curve for whatever reason, then a hyperelliptic curve is a good thing to look at: the $1$-forms on it is easy to describe, Mumford gave an explicit construction of its Jacobian... $\\endgroup$ Donu Arapura –  Donu Arapura 2020-07-28 21:29:14 +00:00 Commented Jul 28, 2020 at 21:29 1 $\\begingroup$ There's also the fact that every genus 2 curve is hyperelliptic, so you're getting another whole genus. OTOH, there are certainly theorems along the lines of \"If C is hyperelliptic, then X is true, otherwise Y is true.\" A larger class of curves that is easier to deal with are cyclic covers of $\\mathbb P^1$ (often called \"super-elliptic curves\"). Also, by analogy if you've studied number theory, after $\\mathbb Q$, it's very instructive to study quadratic extensions of $\\mathbb Q$; replace $\\mathbb Q$ with $k(T)$, voila, you have hyperelliptic function fields. $\\endgroup$ Joe Silverman –  Joe Silverman 2020-07-28 21:38:05 +00:00 Commented Jul 28, 2020 at 21:38  |  Show 7 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry complex-geometry elliptic-curves hyperelliptic-curves See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 14 Supersingular elliptic curves 2 Curves on elliptic ruled surfaces? 2 Isomorphic elliptic curves 10 examples of \"exotic\" moduli problems for elliptic curves? 16 Examples of elliptic curves over $\\mathbb{Q}$ 2 CM Elliptic Curves and a result concerning ray class fields 1 Is the Jacobian isogenous over $\\mathbb{F}_p$ to the direct product of the elliptic curves? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366820, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,complex-geometry,elliptic-curves,hyperelliptic-curves,ag.algebraic-geometry,complex-geometry,elliptic-curves,hyperelliptic-curves",
  "scraped_at": "2026-01-14T04:25:58.009519",
  "answer": ""
}