{
  "id": "q_363220",
  "mathoverflow_id": 363220,
  "url": "https://mathoverflow.net/questions/363220/the-role-of-a-combination-of-enestr%c3%b6m-kakeya-and-gauss-lucas-theorems-reference",
  "title": "cv.complex variables - The role of a combination of Enestr&#246;m-Kakeya and Gauss-Lucas theorems: reference request or soft question, asking for this combination as tool",
  "body": "In past days I was trying to create problems or direct applications invoking Eneström—Kakeya and Gauss-Lucas theorems for certain arithmetic functions that I know from analytic number theory. These were some of my combinations (I don't know if these are interesting in the context of the arithmetic functions that I'm using as coefficients of my polynomials, or if these are in the literature). Example 1. For each integer $n\\geq 1$ we define the polynomials $\\mathcal{F}_n(z)=a_0+\\sum_{k=1}^n\\frac{z^k}{\\sqrt[k]{p_k}}$ , where $0<a_0\\leq \\frac{1}{2}$ is a real number (let's say we take $a_0=\\frac{1}{4}$ ) and $p_k$ denotes the $k$ -th prime number. And we consider the zeros of the polynomial $P_n(z):=\\frac{d}{dz}\\mathcal{F}_n(z)$ . Then on assumption of Firoozbakht's conjecture the polynomial $P_n(z)=\\sum_{k=1}^n \\frac{k }{\\sqrt[k]{p_k}}z^{k-1}$ has all its zeros in $|z|\\leq 1$ as a direct application of Eneström-Kakeya theorem and Gauss–Lucas theorem. Example 2. Other similar examples for which one gets a proposition as result of a combination of the application of Eneström-Kakeya theorem and after invoking the Gauss-Lucas theorem are for the polynomials of degree $n$ , respectively for integers $n\\geq 1$ , $P_n(z)=\\sum_{k=0}^n\\frac{z^k}{\\zeta(k)}$ where $\\zeta(s)$ denotes the Riemann zeta function (and I need take Eneström—Kakeya theorem for example from [3]), and $P_n(z)=1+\\sum_{k=1}^n\\frac{z^k}{|G_k|}$ where $G_k$ denotes the Gregory coefficients. Question. We denote the convex hull of the zeros (we work over $\\mathbb{C}$ identified with $\\mathbb{R^2}$ as is usual) of a generic polynomial $P_n(z)$ as $C_n$ . We assume that their coefficients are under the assumptions of Eneström—Kakeya theorem. And as usual you can denote your disks (or other subsets in $\\mathbb{C}$ ) $D(a)=\\{z\\in\\mathbb{C}:|z|<a\\}$ as you prefer. I would like to know in what contexts or scenarios of mathematics (what I evoke are from complex analysis and polynomials, maybe functional analysis, the theory of convex hulls, other...) can be potentially interesting a suitable combination of Eneström—Kakeya and Gauss-Lucas theorems. Can you illustrate your words from an original application in your field or can you add a reference answering as reference request this question? Many thanks. I'm asking it as a soft question to elucidate in a concise discussion what could be the role of a combination of both theorems (you can to use higher order derivatives of your polynomials, greater than $1$ , in your applications). In case that there is some application from the literature, I mean an explicit combination of Eneström—Kakeya and Gauss-Lucas theorems please answer my question as a reference request and I try to search and read it from the literature. I know these classical theorems, and their proofs, just from an informative point of view ([1] and [2] in Spanish), and my previous examples were attempts to get an application of the mentioned combination of both theorems. References: [1] Manuel Bello Hernández, PROBLEMA 371 of the section Problemas y Soluciones, La Gaceta de la Real Sociedad Matemática Española, Vol. 23 (2020), Núm. 2, Pages 331-332. [2] Armengol Gasull, El teorema de Gauss-Lucas , Miniaturas matemáticas de La Gaceta de la RSME, La Gaceta de la Real Sociedad Matemática Española, Vol. 22 (2019), Núm. 3, Pág. 550. [3] K. K. Dewan and N. K. Govil, On the Eneström—Kakeya theorem , Journal of Approximation Theory, Volume 42, Issue 3, November 1984, Pages 239-244. [4] The Wikipedia page with title Gauss–Lucas theorem. reference-request cv.complex-variables polynomials convex-polytopes zeroes Share Cite Improve this question Follow edited Jun 21, 2020 at 12:05 asked Jun 16, 2020 at 10:45 user142929 1 $\\endgroup$ 2 $\\begingroup$ My question is if you know from the literature or can provide an explanation if a combination of both theorems , Eneström—Kakeya and Gauss-Lucas theorems, can be potentially interesting in some subject of mathematics. I know that polynomials plays a special role in many subjects of mathematics, for example the characteristic polynomial in algebra and solution of differential (vectorial) equations or polynomials associated to other objects, for example graphs. On the other hand I think that it is also interesting the convex hull of a set of zeros of polynomials. $\\endgroup$ user142929 –  user142929 2020-06-21 12:05:48 +00:00 Commented Jun 21, 2020 at 12:05 $\\begingroup$ I add this unrelated comment as a companion of previous theorems: other result that I think that is increible is the following, that I know as On a Theorem of Abel by Shui–Hung Hou, published on The American Mathematical Monthly Vol. 116, No. 7 (Aug. - Sep., 2009), pp. 629-630 $\\endgroup$ user142929 –  user142929 2020-06-25 07:27:35 +00:00 Commented Jun 25, 2020 at 7:27 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request cv.complex-variables polynomials convex-polytopes zeroes See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 0 Do similar properties hold for fractional polynomials? 4 The Poisson-kernel in the plane and polynomials 3 Generalization of the Hermite-Bielher-Kakeya Theorem 3 Hermite-Kakeya Theorem for entire functions 4 Is there a critical point of a polynomial $f$ within every disc having as diameter the line segment between two zeros of $f$? 0 Convex polygon containing the zeros of a convex linear combination of polynomials 2 On a transcendental number defined as a variation involving the Lambert $W$ function in the nested square root representation of the golden ratio 4 Generalizing Marden's theorem to quartics $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363220, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,cv.complex-variables,polynomials,convex-polytopes,zeroes,reference-request,cv.complex-variables,polynomials,convex-polytopes,zeroes",
  "scraped_at": "2026-01-14T04:16:58.932049",
  "answer": ""
}