{
  "id": "q_368964",
  "mathoverflow_id": 368964,
  "url": "https://mathoverflow.net/questions/368964/semisimple-subgroup-of-euclidean-group",
  "title": "gr.group theory - Semisimple subgroup of Euclidean group",
  "body": "Let $G$ be a closed and connected semisimple subgroup of the Euclidean group $E(n)$ (the group of isometries of $\\mathbb R^n$ ). Can we prove that $G$ is conjugate to a subgroup of $O(n)$ ? gr.group-theory lie-groups lie-algebras Share Cite Improve this question Follow asked Aug 12, 2020 at 14:24 Totoro 2,585 10 10 silver badges 21 21 bronze badges $\\endgroup$ 2 $\\begingroup$ I think you can do it by noting that we have the quotient homomorphism $q: E(n)\\to\\mathrm{O}(n)$, and homomorphic images of semisimple Lie algebras are semisimple. $\\endgroup$ Robin Goodfellow –  Robin Goodfellow 2020-08-12 17:32:59 +00:00 Commented Aug 12, 2020 at 17:32 2 $\\begingroup$ More directly, use the fact that $G$ is semi-simple. The restriction of the natural (linear)representation of $E(n)$ on $\\mathbb{R}^{n+1}$ preserves the subrepresentation $\\mathbb{R}^n$ and hence, by Weyl's theorem, it must be the direct sum of $\\mathbb{R}^n$ with a $1$-dimensional complimentary subrepresentation $L\\subset\\mathbb{R}^{n+1}$. This subrepresentation determines a fixed point of $G$ acting on $\\mathbb{R}^n$. Hence $G$ is conjugate to a subgroup of $\\mathrm{O}(n)$. $\\endgroup$ Robert Bryant –  Robert Bryant 2020-08-12 19:47:27 +00:00 Commented Aug 12, 2020 at 19:47 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions gr.group-theory lie-groups lie-algebras See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 5 Are maximal connected semisimple subgroups automatically closed? 4 Bound on the index of an abelian subgroup in discrete subgroup of the euclidean group? 7 Maximal compact subgroups of a semisimple Lie group are conjugate 7 Non-semisimple symmetric subgroups of simply connected simple algebraic groups 3 Is any spherical subgroup conjugate to a subgroup defined over a smaller algebraically closed field? 4 On maximal closed connected subgroups of a compact connected semisimple Lie group? 6 Semisimple compact Lie group topologically generated by two finite order elements 8 Is every contractible homogeneous space of a connected Lie group homeomorphic to a Euclidean space? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368964, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "gr.group-theory,lie-groups,lie-algebras,gr.group-theory,lie-groups,lie-algebras",
  "scraped_at": "2026-01-14T04:28:38.873928",
  "answer": ""
}