{
  "id": "q_366915",
  "mathoverflow_id": 366915,
  "url": "https://mathoverflow.net/questions/366915/is-this-inequality-of-the-random-matrices-correct",
  "title": "pr.probability - Is this inequality of the random matrices correct?",
  "body": "I need to confirm whether the following inequality correct. Let $\\xi_i\\in\\{\\pm 1\\}$ be independent random signs, and let $A_1,\\ldots, A_n$ be $m\\times m$ Hermitian matrices. Let $\\sigma^2 = \\|\\sum_{i=1}^n Var[\\xi_i]A_i^2\\|$ . Then $$Pr\\bigg(\\bigg\\|\\sum_{i=1}^n\\mathbb{E}[\\xi_i]A_i-\\sum_{i=1}^n\\xi_iA_i\\bigg\\|\\geq t\\bigg)\\leq2m\\exp(-t^2/2\\sigma^2).$$ It is said to be cited from the paper \" User-Friendly Tail Bounds for Sums of Random Matrices \". I can only find Theorem 1.5, which is only for normal distribution or equal probability for ${-1,+1}$ . Is the inequality correct? Note that the inequality is slightly different from a previous post . The inequality in that post is false accroding to a comment. pr.probability random-matrices Share Cite Improve this question Follow edited Jul 30, 2020 at 6:00 asked Jul 30, 2020 at 5:14 Nate 131 7 7 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions pr.probability random-matrices See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 4 Is the inequality of the random matrices correct? Related 6 The typical size of a random element in a Banach space 5 Asymptotic Expansion of Distribution in Central Limit Theorem for Non-Identically Distributed Random Variables 3 Conditional Form of Rosenthal's Inequality 11 Maximal inequality for the average of i.i.d. random variables 4 Is the inequality of the random matrices correct? 6 Maximal inequality of iid random variables $\\{X_{ij}\\}_{1\\leqslant i,j \\leqslant n}$ $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366915, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "pr.probability,random-matrices,pr.probability,random-matrices",
  "scraped_at": "2026-01-14T04:26:15.873915",
  "answer": ""
}