{
  "id": "q_364359",
  "mathoverflow_id": 364359,
  "url": "https://mathoverflow.net/questions/364359/a-polynomial-formed-from-the-roots-of-another-polynomial-ad-infinitum",
  "title": "ds.dynamical systems - A polynomial formed from the roots of another polynomial ad infinitum",
  "body": "Let $P(x)$ be a monic polynomial of degree $d$ with complex coefficients. Let $r_1(P),r_2(P),\\dots, r_d(P)$ denote the set of roots, ordered so that $|r_1(P)| \\leq |r_2(P)|\\leq\\dots\\leq |r_d(P)|$ . Define the map $T$ by: $$(TP)(x)=x^d+r_1(P)x^{d-1}+r_2(P)x^{d-2}+\\dots+r_d(P),$$ i.e. $TP$ is the monic polynomial whose coefficients are the roots of $P$ . Let us call a monic polynomial periodic if $T^KP=P$ for some $K>0$ . The question is: for any $d>0$ , does there exist a periodic polynomial of degree $d$ , other than the trivial solution $x^d$ ? Remark on the definition of T The above definition of $TP$ is ambiguous if there are two roots $r_i(P)$ and $r_j(P)$ such that $|r_i(P)|=|r_j(P)|$ and $r_i(P)\\neq r_j(P)$ . If the roots of $P$ have this property, then you may break the ties however you please. For example, if $P(x)=x^3-x$ , then it is up to you whether to set $r_2(P)=1$ and $r_3(P)=-1$ or $r_2(P)=-1$ and $r_3(P)=1$ . However, either ordering still must have $r_1(P)=0$ , since there is no ambiguity there. Note that the set of polynomials that have this ambiguity has measure zero, so I suspect such considerations will not influence the solution of the problem anyway. Empirical Evidence If $d=1$ then the answer is clearly yes (any $P(x)=x-a$ will do the job, with $a\\ne 0$ ). If $d=2$ then $P(x)=x^2+x-2$ is a fixed point of $T$ , so in particular is periodic with period 1. I examined other low degrees by numerical simulation. Note that this requires relaxing the definition of a cycle, since testing for exact equality of floating point numbers is impossible. Thus, for these simulations, the condition $T^KP=P$ was replaced with $\\|T^KP-P\\|_\\infty<\\varepsilon$ , with $\\varepsilon=10^{-10}$ . In particular, these simulations can only find polynomials $P$ that are periodic up to some fixed error tolerance. The simulation was done by first initializing the coefficients of $P$ using values drawn from a standard normal distribution, and then iteratively applying $T$ 1000 times and checking whether the obtained sequence was eventually periodic (up to error $<\\varepsilon$ ). Note that this method might not find all cycles. The periods found thusly for low degrees are: $$ \\begin{array}{rc} d=3 & \\text{possible periods}= 1 ; 11 \\\\ 4 & 21 \\\\ 5 & 4 ; 56 \\\\ 6 & 34 ; 44 \\\\ 7 & 10 ; 15 ; 26 ; 234 \\\\ 8 & 3 ; 38 ; 83 ; 292 \\\\ 9 & 256 ; 311 ; 466 \\\\ 10 & 275 ; 336 \\end{array} $$ Furthermore, for degrees $\\leq 8$ , all of the simulated sequences eventually became periodic, however this was not true for $d=9$ or $10$ (of course, this does not imply that these sequences never become periodic, just that they did not before the simulation ended). Originally posted on math stackexchange, where bounty period expired without an answer: https://math.stackexchange.com/questions/3724155/a-polynomial-formed-from-the-roots-of-another-polynomial-ad-infinitum ds.dynamical-systems polynomials Share Cite Improve this question Follow asked Jun 28, 2020 at 17:20 Simon Segert 515 2 2 silver badges 8 8 bronze badges $\\endgroup$ 2 2 $\\begingroup$ Reverse operator might be more tractable - assigning to $r_1,...,r_d$ their symmetric functions $\\sigma_1(r_1,...,r_d),...,\\sigma_d(r_1,...,r_d)$ $\\endgroup$ მამუკა ჯიბლაძე –  მამუკა ჯიბლაძე 2020-06-28 18:04:38 +00:00 Commented Jun 28, 2020 at 18:04 2 $\\begingroup$ This seems to be equivalent to mathoverflow.net/questions/216346 . $\\endgroup$ Richard Stanley –  Richard Stanley 2020-06-29 01:44:50 +00:00 Commented Jun 29, 2020 at 1:44 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ds.dynamical-systems polynomials See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 41 Which polynomial's roots are its coefficients? Related 12 What primes divide the discriminant of a polynomial? 21 Expressing power sum symmetric polynomials in terms of lower degree power sums 45 Polynomial roots and convexity 26 Using higher-order Bring radicals to solve arbitrary polynomials 18 Splitting the Resultant, as when the Determinant becomes the square of the Pfaffian 8 Coefficients of shifted Bernoulli polynomials 0 Necessary and/or sufficient condition for invertibility of the gradient of a polynomial of $m$ variables, viewed as a self map of $\\mathbb{R}^m?$ $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364359, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ds.dynamical-systems,polynomials,ds.dynamical-systems,polynomials",
  "scraped_at": "2026-01-14T04:18:53.618687",
  "answer": ""
}