{
  "id": "q_368459",
  "mathoverflow_id": 368459,
  "url": "https://mathoverflow.net/questions/368459/approximation-of-vector-field-by-vector-fields-with-all-trajectories-closed",
  "title": "ca.classical analysis and odes - Approximation of vector field by vector fields with all trajectories closed",
  "body": "Let $\\vec j$ be a smooth compactly supported vector field in $\\mathbb{R}^3$ such that $div(\\vec j)=0$ . Are there known either necessary or sufficient conditions such that there exists a sequence of smooth compactly supported vector fields $\\{\\vec j_i\\}$ which converges to $\\vec j$ say in $C^2$ topology, $div(\\vec j_i)=0$ , and such that all the trajectories of each $j_i$ are closed. If $C^2$ topology can be replaced by something else, that might be of interest too. ca.classical-analysis-and-odes ds.dynamical-systems Share Cite Improve this question Follow asked Aug 6, 2020 at 12:33 asv 23.1k 6 6 gold badges 58 58 silver badges 139 139 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ca.classical-analysis-and-odes ds.dynamical-systems See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 11 nowhere vanishing vector field on a manifold 6 Given a vector field all of whose integral curves are closed, is the period a smooth function? 10 Topological equivalence of homotopic vector fields 5 When is a solution to an ODE determined by its average value? 2 Divergence invariant lifting of a vector field via a submersion 9 Non-uniqueness of flow for divergence free vector fields 7 A criterion on a vector field for its flow to extend continuously at $t=\\infty$ 2 Reference request: Lie product formula for vector fields $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368459, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ca.classical-analysis-and-odes,ds.dynamical-systems,ca.classical-analysis-and-odes,ds.dynamical-systems",
  "scraped_at": "2026-01-14T04:27:26.685644",
  "answer": ""
}