{
  "id": "q_366902",
  "mathoverflow_id": 366902,
  "url": "https://mathoverflow.net/questions/366902/explicit-resolution-of-omega1-c-for-prestable-curve-c",
  "title": "ag.algebraic geometry - Explicit resolution of $\\Omega^1_C$ for prestable curve $C$",
  "body": "Suppose $C$ is a complex projective curve (or a compact $1$ -dimensional connected reduced complex space). If $C$ is smooth, then its module of differentials $\\Omega^1_C$ is locally free. If $C$ is a singular prestable curve (i.e. its singularities are at worst ordinary nodes), then $\\Omega^1_C$ is coherent, but not a locally free sheaf. Can we find a canonical finite complex of vector bundles $E^\\bullet$ on $C$ resolving $\\Omega^1_C$ ? It's easy to find such a canonical resolution locally near a node. Let $p\\in C$ be a node and assume that the two branches meeting at $C$ are $A,B$ . Then, we may embed $C$ locally into $A\\times B$ as $A\\times\\{p\\}\\cup\\{p\\}\\times B$ . This is the zero locus of a tautologically defined section $s$ of the bundle $L =\\mathcal O_A(p)\\boxtimes\\mathcal O_B(p)$ . Then, the conormal sequence $0\\to L^\\vee|_C\\to\\Omega^1_{A\\times B}|_C\\to\\Omega^1_C\\to0$ is a (local) resolution by a two term complex of vector bundles. I don't see any obvious way to globalize this construction though. My main motivation is to set up a Dolbeault type complex to better understand the vector space $\\text{Ext}^1(\\Omega^1_C,\\mathcal O_C)$ which is the space of first order deformations of $C$ . More generally, I also want to use this type of Dolbeault complex to understand the deformations of (possibly nodal) pseudo-holomorphic maps in almost complex manifolds. ag.algebraic-geometry complex-geometry sheaf-theory deformation-theory complex-analytic-spaces Share Cite Improve this question Follow asked Jul 29, 2020 at 20:03 Mohan Swaminathan 1,861 10 10 silver badges 27 27 bronze badges $\\endgroup$ 8 2 $\\begingroup$ Here is a first thought. If it had a finite resolution as you write (canonical or otherwise), if $C$ is irreducible and sheaf of differential forms is torsion free, then it would be locally free by Auslanser-Buchsbaum. This will solve a long standing conjecture known as Berger's conjecture. So, the answer is most likely to be unknown in your case. $\\endgroup$ Mohan –  Mohan 2020-07-29 20:23:29 +00:00 Commented Jul 29, 2020 at 20:23 1 $\\begingroup$ Embed the prestable curve $C$ as a Cartier divisor in a surface $S$. Then the resolution is $\\mathcal{O}_S(-\\underline{C})|_C \\to\\Omega_S|_C$. $\\endgroup$ Jason Starr –  Jason Starr 2020-07-29 21:54:35 +00:00 Commented Jul 29, 2020 at 21:54 $\\begingroup$ ... \"surface\" --> \"smooth surface\". $\\endgroup$ Jason Starr –  Jason Starr 2020-07-29 22:31:55 +00:00 Commented Jul 29, 2020 at 22:31 1 $\\begingroup$ If $C$ is prestable then its dualizing sheaf is a line bundle; if $C$ is stable this bundle is ample so you can use it to embed in projective space. Now project from a well chosen linear space to obtain an immersion in $\\mathbb P^2$, and blow up $\\mathbb P^2$ at those singularities which arose from projection (as opposed to those which are part of the abstract pre-stable curve). Now you have an embedding of $C$ in a rational surface. How is that? $\\endgroup$ Tabes Bridges –  Tabes Bridges 2020-07-30 02:50:11 +00:00 Commented Jul 30, 2020 at 2:50 1 $\\begingroup$ Yes, this is pretty explicit. In the unstable case, I think we can just stabilize by adding marked points $p_1,\\ldots,p_n$ and then take the ample line bundle $\\omega_C(p_1 + \\cdots + p_n)$ instead of $\\omega_C$. $\\endgroup$ Mohan Swaminathan –  Mohan Swaminathan 2020-07-30 03:12:06 +00:00 Commented Jul 30, 2020 at 3:12  |  Show 3 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry complex-geometry sheaf-theory deformation-theory complex-analytic-spaces See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 21 What is the DGLA controlling the deformation theory of a complex submanifold? 7 Can the homological dimension of a coherent sheaf explode along a formal deformation? (is the resolution property hereditary for formal deformations?) 9 DGLA controlling deformation of holomorphic curves 8 Koszul-Tate Resolution for Subvarieties of $\\mathbb P^n$ 1 Resolution of the diagonal for projective hypersurface 5 Question about Kapranov's resolution of the diagonal for Grassmannians $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366902, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,complex-geometry,sheaf-theory,deformation-theory,complex-analytic-spaces,ag.algebraic-geometry,complex-geometry,sheaf-theory,deformation-theory,complex-analytic-spaces",
  "scraped_at": "2026-01-14T04:26:06.926034",
  "answer": ""
}