{
  "id": "q_365650",
  "mathoverflow_id": 365650,
  "url": "https://mathoverflow.net/questions/365650/using-paley-wiener-theorem-to-prove-the-decay-of-gx-y",
  "title": "fa.functional analysis - Using Paley-Wiener Theorem to prove the decay of $G(x-y)$",
  "body": "This question is related to my previous one , where I was looking for some help to prove the decay of the lattice Green function: \\begin{eqnarray} G(x-y) = \\int_{[-\\pi,\\pi]^{d}}\\frac{d^{d}k}{(2\\pi)^{d}}\\frac{e^{ik\\cdot (x-y)}}{\\gamma(k)+p} \\quad (x,y \\in \\mathbb{Z}^{d}) \\label{1}\\tag{1} \\end{eqnarray} where $p>0$ , $k\\cdot (x-y) := k_{1}(x_{1}-y_{1}) +\\cdots+k_{d}(x_{d}-y_{d})$ and: $$\\gamma(k) := 2\\sum_{j=1}^{d}(1-\\cos(k_{j})). $$ As mentioned in the previous question, this decay should be like: $$G(x-y) \\le Ke^{\\alpha ||x-y||_{\\infty}}$$ where $||x-y||_{\\infty} := \\max_{i}\\{|x_{i}-y_{i}|\\}$ . As cited in the comments of the previous question, we can address this problem by using contour integrals or representation as a Neumann series. However, in this article (page 183) the authors propose a very interesting way to prove this result by using the Paley-Wiener Theorem. I'd really like to understand it but they just briefly mention the idea and I'm having trouble working out the details and I'm having trouble making the Paley-Wiener Theorem fit in this context. Shouldn't my function $G$ be an entire function of $n$ complex variables given by the Fourier transform of a $C_{0}^{\\infty}(\\mathbb{R}^{d})$ function? It does not seem the case to me. Any help would be appreciated! fa.functional-analysis cv.complex-variables fourier-analysis Share Cite Improve this question Follow asked Jul 14, 2020 at 22:29 MathMath 1,465 9 9 silver badges 21 21 bronze badges $\\endgroup$ 7 $\\begingroup$ My guess would be that this is the same as what Abdelmalek Abdesselam wrote in his comment to the other question — so strictly speaking not really an application of the Paley–Wiener theorem, but something to some extent similar. (And yes, $G$ is an entire function, once you define it for by the same formula for all $x \\in \\mathbb{C}^d$.) $\\endgroup$ Mateusz Kwaśnicki –  Mateusz Kwaśnicki 2020-07-15 21:39:09 +00:00 Commented Jul 15, 2020 at 21:39 1 $\\begingroup$ That said, the easiest way to get such a crude upper bound is perhaps as follows: If $p = \\cosh \\alpha - 2$, then the function $F(x) = \\exp(-\\alpha\\|x\\|_\\infty)$ is discrete $p$-superharmonic, in the sense that $H(x) := \\Delta F(x) - p F(x) \\leqslant 0$ for all $x \\in \\mathbb{Z}^d$. Therefore, $F$ is the discrete convolution of $G$ and $-H(x)$ (more precisely: $F + G*H$ is discrete harmonic and goes to zero at infiinity, and hence it is constant zero)). In particular, $F(x) \\geqslant (-H(0))G(x)$, that is, $G(x) \\leqslant (-H(0))^{-1} F(x)$. $\\endgroup$ Mateusz Kwaśnicki –  Mateusz Kwaśnicki 2020-07-15 21:50:12 +00:00 Commented Jul 15, 2020 at 21:50 $\\begingroup$ Oh, this seems a nice approach but I'm not very familiar with some of these objects. If $F(x)$ is $p$-superharmonic does it follow that it is the discrete convolution of $G$ and $-H$? Is this a theorem? Do you have any reference on the precise statement? $\\endgroup$ MathMath –  MathMath 2020-07-16 15:39:09 +00:00 Commented Jul 16, 2020 at 15:39 2 $\\begingroup$ All you need to know is that $(-\\Delta + p) G(x) = \\delta_0(x)$ (which follows by looking at the Fourier transform, for example). Then we find that $(-\\Delta + p) (G * H) = H = (\\Delta - p) F)$, and consequently $(-\\Delta - p)(F + G*H) = 0$. Now $F + G*H$ goes to zero at infinity (requires a proof!), and — if non-zero — it attains a positive maximum or a negative minimum somewhere. However, if $F(x_0) + G*H(x_0) > 0$ is a maximum, then $\\Delta (F + G*H)(x_0) < 0$, and so, in particular, $0 > (\\Delta - p)(F + G*H)(x_0) = 0$, a contradiction. Thus, $F + G*H = 0$, as desired. $\\endgroup$ Mateusz Kwaśnicki –  Mateusz Kwaśnicki 2020-07-16 16:51:53 +00:00 Commented Jul 16, 2020 at 16:51 $\\begingroup$ Amazing! I will try to work out the details! Thanks a lot! $\\endgroup$ MathMath –  MathMath 2020-07-16 17:06:32 +00:00 Commented Jul 16, 2020 at 17:06  |  Show 2 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions fa.functional-analysis cv.complex-variables fourier-analysis See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 3 Proving the exponential decay of Green's function for the lattice $-\\Delta+p$ Related 8 Fastest decay of Fourier Transform for Generalized Functions of compact support 9 The Paley-Wiener theorem and exponential decay. 0 Paley-Wiener type theorem for integral functions with compact support 4 Paley–Wiener theorem for functions with exponential decay 4 How to show that this limit converges in the distributional sense to a dirac delta function 4 Decay of the binomial expansion of $f^{\\circ k}$ 0 A property of the canonical dual frame in a Hilbert space $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365650, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "fa.functional-analysis,cv.complex-variables,fourier-analysis,fa.functional-analysis,cv.complex-variables,fourier-analysis",
  "scraped_at": "2026-01-14T04:22:36.010564",
  "answer": ""
}