{
  "id": "q_365845",
  "mathoverflow_id": 365845,
  "url": "https://mathoverflow.net/questions/365845/diophantine-problem-in-n-log-n",
  "title": "nt.number theory - Diophantine problem in n log n",
  "body": "Let $x_n = n \\log n$ for $n \\geq 1$ . What is a good upper bound for the number of solutions $(n_1, n_2, n_3, n_4) \\in \\{1, \\dots, N\\}^4$ of $$ |x_{n_1} - x_{n_2} + x_{n_3} - x_{n_4} | < \\gamma, $$ say for $\\gamma$ in the range $[1/N,1]$ ? The dependence in $N$ clearly should be around $N^3$ , but is it true that the dependence in $\\gamma$ is roughly linear? More specifially, is it true that the number of solutions is $\\ll \\gamma N^{3 + \\varepsilon}$ . nt.number-theory Share Cite Improve this question Follow asked Jul 17, 2020 at 10:04 Kurisuto Asutora 2,239 15 15 silver badges 28 28 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions nt.number-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 5 A naive question on circle method 7 Proportion of numbers with prime divisors from restricted set 6 Number of solutions for the inequality with square roots 3 Diophantine equations and 'quasi-paucity' 1 Positive integer solutions of linear equations under the constraint of Frobenius number 4 How to prove that a diophantine equation has only finitely many solutions in integers? 6 How many solutions are there to $n_1^2-n_2^2-n_3^2+n_4^2=k$? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365845, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "nt.number-theory,nt.number-theory",
  "scraped_at": "2026-01-14T04:23:17.211344",
  "answer": ""
}