{
  "id": "q_366139",
  "mathoverflow_id": 366139,
  "url": "https://mathoverflow.net/questions/366139/sdp-relaxation-vs-monte-carlo-for-maxcut-which-one-performs-better",
  "title": "markov chains - SDP relaxation vs. Monte Carlo for MaxCut: which one performs better?",
  "body": "the Goemans Williamson SDP relaxation of the MAXCUT problem famously gives a polynomial approximation ratio of .87856 for the MAXCUT on regular graphs. Another popular approach to obtain efficient approximations to NP-complete combinatorial optimization problems is that of sampling from a high enough temperature distribution using Markov chains. For the case of MAXCUT, this reduces to sampling from the Gibbs state on an Ising model. And there is a lot of literature which gives bounds on the temperatures that can be sampled from efficiently. However, I cannot find any comment on how SDP relaxations compare to polynomial-time Monte Carlo methods. What is the approximation ratio we obtain from Monte Carlo methods for say, 3 regular graphs? Any help is appreciated! markov-chains combinatorial-optimization semidefinite-programming Share Cite Improve this question Follow asked Jul 20, 2020 at 20:25 user134977 111 3 3 bronze badges $\\endgroup$ 1 $\\begingroup$ if you don't get an answer here, or.stackexchange.com might be a better bet, although it's a rather big \"ask\" there. $\\endgroup$ Mark L. Stone –  Mark L. Stone 2020-07-21 01:27:40 +00:00 Commented Jul 21, 2020 at 1:27 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions markov-chains combinatorial-optimization semidefinite-programming See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 2 Probability-one event for Markov chain 1 Semidefinite relaxation for a quadratic feasibility problem using CVX 0 Monte Carlo estimator with autocorrelated samples 3 SDP relaxation vs LP relaxation 3 SDP representation of ideal polynomials for positivstellensatz refutations 6 Exactness of the semidefinite programming (SDP) relaxation of maximum cut (Max-Cut) 1 Matrix Completion SDP Relaxation and Duality $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366139, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "markov-chains,combinatorial-optimization,semidefinite-programming,markov-chains,combinatorial-optimization,semidefinite-programming",
  "scraped_at": "2026-01-14T04:23:49.084521",
  "answer": ""
}