{
  "id": "q_363524",
  "mathoverflow_id": 363524,
  "url": "https://mathoverflow.net/questions/363524/riemannian-manifolds-on-which-bounded-sets-are-totally-bounded",
  "title": "dg.differential geometry - Riemannian manifolds on which bounded sets are totally bounded",
  "body": "A Riemannian manifold is known to be complete if and only if any of its closed bounded subset is compact. Is there a similar criterion for Riemannian manifolds for which every bounded subset is totally bounded with respect to the geodesic distance, that is, every bounded set for the geodesic distance can be covered by finitely many geodesic balls of arbitrarily small radius? Obviously this will happen in any complete Riemannian manifold. There are manifolds that are bounded without being totally bounded, see https://math.stackexchange.com/q/749891/105127 . dg.differential-geometry riemannian-geometry Share Cite Improve this question Follow asked Jun 19, 2020 at 12:20 Jean Van Schaftingen 2,854 1 1 gold badge 18 18 silver badges 27 27 bronze badges $\\endgroup$ 5 $\\begingroup$ What do you actually mean by similar criterion? You started with $P \\iff Q$ where $P$ is complete and $Q$ is closed bounded subset is compact. Is your goal to replace $Q$ by \"every bounded subset is totally bounded\" and ask what is the corresponding generalization of $P$? $\\endgroup$ Willie Wong –  Willie Wong 2020-06-19 14:58:41 +00:00 Commented Jun 19, 2020 at 14:58 1 $\\begingroup$ (Minor comment: doesn't Hopf Rinow require finite dimensions?) $\\endgroup$ Willie Wong –  Willie Wong 2020-06-19 15:01:00 +00:00 Commented Jun 19, 2020 at 15:01 $\\begingroup$ Convexity would be enough. $\\endgroup$ Moishe Kohan –  Moishe Kohan 2020-06-19 15:25:30 +00:00 Commented Jun 19, 2020 at 15:25 $\\begingroup$ Possibly a not very useful observation: for metric spaces the property \"every bounded subset is totally bounded\" is equivalent to \"the Cauchy-completion having the Heine-Borel property.\". Hopf Rinow says that finite dimensional Riemannian manifolds is geodesically complete IFF Cauchy-complete; unfortunately the Cauchy completion of an arbitrary Riemannian manifold need not be equipped with a good Riemannian structure. $\\endgroup$ Willie Wong –  Willie Wong 2020-06-19 18:48:14 +00:00 Commented Jun 19, 2020 at 18:48 $\\begingroup$ @WillieWong I am wondering about a necessary and sufficient condition as fruitful as the equivalence for completeness. $\\endgroup$ Jean Van Schaftingen –  Jean Van Schaftingen 2020-06-22 06:44:46 +00:00 Commented Jun 22, 2020 at 6:44 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions dg.differential-geometry riemannian-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 5 Are there countably many diffeomorphism classes of finite radius balls of complete Riemannian manifolds? 6 Fattening of totally convex sets 9 Existence of incomplete Riemannian metrics 7 Negatively curved manifolds with many totally geodesic submanifolds 2 Totally geodesic submanifold of codimension 1 in noncompact Riemannian manifold 5 Bishop-Gromov for Kähler metrics 5 Hyperbolic manifolds containing totally geodesic hypersurfaces which themselves contain totally geodesic hypersurfaces $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363524, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "dg.differential-geometry,riemannian-geometry,dg.differential-geometry,riemannian-geometry",
  "scraped_at": "2026-01-14T04:17:27.724421",
  "answer": ""
}