{
  "id": "q_366685",
  "mathoverflow_id": 366685,
  "url": "https://mathoverflow.net/questions/366685/the-best-way-for-obtaining-the-canonical-label-of-a-matroid",
  "title": "graph theory - The best way for obtaining the canonical label of a matroid?",
  "body": "For a graph, we can canonical labelings with Nauty or other methods. But for a matroid, I do not find an easy way to labeling. Dillon Mayhewa, Gordon F. Royle introduced the hyperplane graph of a matroid in their paper \"Matroids with nine elements\", which is the bipartite graph whose vertices are the elements and hyperplanes of the matroid and where a hyperplane-vertex is adjacent to an element-vertex if and only if the hyperplane contains the element. Then we can use Nauty to labelings the bipartite graph. But this method is a bit slow. So I want to know is there any better method for canonical labeling of a matroid? graph-theory algorithms matroid-theory Share Cite Improve this question Follow asked Jul 27, 2020 at 12:10 Xie 51 2 2 bronze badges $\\endgroup$ 2 2 $\\begingroup$ Depending on how your matroid is given, some other hash might be more suitable. How are your matroids given? Maybe relevant: cse.iitm.ac.in/~bvrr/jour/RS1.pdf $\\endgroup$ Moritz Firsching –  Moritz Firsching 2020-07-27 13:25:49 +00:00 Commented Jul 27, 2020 at 13:25 $\\begingroup$ I find some sagemath codes in \" oeis.org/A300985/a300985.sage.txt \", where use canonical_label of an IncidenceStructure. It's enough for me. $\\endgroup$ Xie –  Xie 2020-08-11 02:48:16 +00:00 Commented Aug 11, 2020 at 2:48 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions graph-theory algorithms matroid-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 Tractably Partitioning the possible vertex k-colorings of a graph by local stability and instability. 3 Complexity of Labeled Graph Homomorphism 4 Generating non-isomorphic graphs by adding edges to a given graph 5 Checking if a matroid is binary(Detecting $U^2_4$ minor in a matroid) 6 matroids axioms and independence system 5 What upper bounds are known on the number of non-isomorphic cycle matroids? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366685, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "graph-theory,algorithms,matroid-theory,graph-theory,algorithms,matroid-theory",
  "scraped_at": "2026-01-14T04:27:45.031883",
  "answer": ""
}