{
  "id": "q_368144",
  "mathoverflow_id": 368144,
  "url": "https://mathoverflow.net/questions/368144/is-the-dispersivewiki-website-down",
  "title": "ap.analysis of pdes - Is the DispersiveWiki website down?",
  "body": "Somewhat recently I learned about a website called the DispersiveWiki which is/was maintained by James Colliander. I have found a few different links to the website from around the web (e.g. http://math.mit.edu/~gigliola/ and https://terrytao.wordpress.com/ ) such as: http://tosio.math.toronto.edu/wiki/index.php/Main_Page https://kvm16.pims.math.ca/DispersiveWiki/index.php?title=Main_Page https://dispersivewiki.org/DispersiveWiki/index.php?title=Main_Page For a few weeks now I have been trying to access the DispersiveWiki without success – for all the links above, I have been getting an error message of ‘The website took too long to respond.’ I have tried this using various browsers and methods of connecting to the internet, and so I have begun to suspect that this may not be a problem on my end. In summary, my questions are: Do other people have difficulty accessing the website? Is the DispersiveWiki still being maintained? If so, what is its current web address? ap.analysis-of-pdes soft-question online-resources Share Cite Improve this question Follow edited Aug 2, 2020 at 17:46 YCor 67.5k 5 5 gold badges 203 203 silver badges 301 301 bronze badges asked Aug 2, 2020 at 14:37 Jonathan J. 177 4 4 bronze badges $\\endgroup$ 3 5 $\\begingroup$ This does not seem like a question in research-level mathematics. $\\endgroup$ LSpice –  LSpice 2020-08-02 14:45:22 +00:00 Commented Aug 2, 2020 at 14:45 3 $\\begingroup$ It is also down on my end, but I really don't think this question is appropriate. $\\endgroup$ Harry Wilson –  Harry Wilson 2020-08-02 14:55:29 +00:00 Commented Aug 2, 2020 at 14:55 5 $\\begingroup$ it seems that the WayBackMachine has archived only a single page from that site, regrettably; since the DispersiveWiki was maintained (at least originally) by @TerryTao , perhaps that MO user knows more... $\\endgroup$ Carlo Beenakker –  Carlo Beenakker 2020-08-02 15:10:20 +00:00 Commented Aug 2, 2020 at 15:10 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ap.analysis-of-pdes soft-question online-resources See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 84 What could be some potentially useful mathematical databases? 13 Are there any organized websites for seminar/conference videos? 7 A centralised website for computational attempts in graph theory and metric geometry? 80 Atlas-like websites on specific areas of mathematics 34 Wayback Machine for mathematics? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368144, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ap.analysis-of-pdes,soft-question,online-resources,ap.analysis-of-pdes,soft-question,online-resources",
  "scraped_at": "2026-01-14T04:26:43.797268",
  "answer": ""
}