{
  "id": "q_364435",
  "mathoverflow_id": 364435,
  "url": "https://mathoverflow.net/questions/364435/pseudoreflection-groups-in-affine-varieties",
  "title": "ag.algebraic geometry - Pseudoreflection groups in affine varieties",
  "body": "Suppose $\\mathsf{k}$ is an algebraically closed field of zero characteristic. Chevalley-Shephard-Todd (C-S-T) Theorem in one of its equivalent versions is the following result: (C-S-T): Let $G$ be a finite subgroup of $GL(V)$ , where $V$ is a finite dimensional vector space. Then the quotient variety $V/G$ is smooth if and only if $G$ is a group generated by pseudoreflections. My first question is the following: (Question 1) Let $G$ be a finite group of automorphisms of an irreducible affine smooth variety $X$ . When is the quotient variety $X/G$ smooth? Of course this holds if the action of $G$ is free, but I'm looking for a condition that is similar in nature to that of C-S-T Theorem. I've heard something among these lines: $G$ is generated by elements $g$ such that $X^g = \\{ x \\in X| g.x=x \\}$ is a divisor, etc; but I could not find an exact statement or reference. I would greatly appreciate an answer, either in form of an adequate reference, or a proof of an exact statement. My second question is related to the first one as follows. We have a result by Kantor (1977) and Levasseur (1981) that is: (K-L): Let $V$ be a finite dimensional vector space, $G$ a finite subgroup of $GL(V)$ . Then the quotient map $V \\mapsto V/G$ induces an isomorphism $\\mathcal{D}(V)^G \\simeq \\mathcal{D}(V/G)$ if and only if $G$ contains no pseudoreflections. (cf. Levasseur, Thm 5, MR633520) Here of course $\\mathcal{D}(.)$ is the ring of differential operators, and the action of $G$ on this ring is by conjugation. (Question 2) Let $X$ be an irreducible affine smooth variety, and $G$ a finite group of automorphisms of it. The quotient map $X \\mapsto X/G$ induces an injective map $\\mathcal{D}(X)^G \\rightarrow \\mathcal{D}(X/G)$ . When is this map an isomorphism? Again there are sufficient conditions for this to hold, such as the action of $G$ being free (cf. Cannings, Holland, 3.7, MR1305263, 1994). I wonder if there is a condition for this to hold analogue to the one considered by Kantor and Levasseur, i.e., $G$ having no \"pseudoreflections\", in the sense I suggested in Question (1). ag.algebraic-geometry reference-request geometric-invariant-theory orbifolds reflection-groups Share Cite Improve this question Follow edited Jun 29, 2020 at 23:15 asked Jun 29, 2020 at 16:27 jg1896 3,766 12 12 silver badges 29 29 bronze badges $\\endgroup$ 4 1 $\\begingroup$ Should $X$ be affine in Question 1 (judging by title looks like that's what you intended)? $\\endgroup$ Sam Hopkins –  Sam Hopkins ♦ 2020-06-29 18:24:29 +00:00 Commented Jun 29, 2020 at 18:24 $\\begingroup$ Yes, it is, thank you for pointing out. I will edit it. $\\endgroup$ jg1896 –  jg1896 2020-06-29 23:14:31 +00:00 Commented Jun 29, 2020 at 23:14 1 $\\begingroup$ I do not know about the general case, but over the complex numbers, $X/G$ is smooth if and only if the action on $T_xX$ of the stabilizer $G_x$ of each $x\\in X$ satisfies the CST condition. The key is Cartan's theorem on local holomorphic linearization, see the reference I gave here . $\\endgroup$ Moishe Kohan –  Moishe Kohan 2020-07-15 16:34:34 +00:00 Commented Jul 15, 2020 at 16:34 $\\begingroup$ This is extremely helpful! I will look Cartan's work. Thank you very much @MoisheKohan $\\endgroup$ jg1896 –  jg1896 2020-07-15 16:39:22 +00:00 Commented Jul 15, 2020 at 16:39 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry reference-request geometric-invariant-theory orbifolds reflection-groups See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 8 About the strength of representation-theoretic obstructions for orbit closure problems 6 Smoothness of fix point components of finite group action on smooth variety 4 Are quotient varieties local complete intersections? 5 Group actions on affine varieties with closed orbits $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364435, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,reference-request,geometric-invariant-theory,orbifolds,reflection-groups,ag.algebraic-geometry,reference-request,geometric-invariant-theory,orbifolds,reflection-groups",
  "scraped_at": "2026-01-14T04:21:51.135374",
  "answer": ""
}