{
  "id": "q_368364",
  "mathoverflow_id": 368364,
  "url": "https://mathoverflow.net/questions/368364/on-a-degenerate-sde-in-the-unit-ball",
  "title": "stochastic processes - On a degenerate SDE in the unit ball",
  "body": "This is a question about a diffusion process on the unit ball. In this article J.S , the author considered the following SDE in the closed unit ball $E \\subset \\mathbb{R}^n$ : \\begin{align*} (1)\\quad dX_t=\\sqrt{2(1-|X_t|^2)}\\,dB_t-cX_t\\,dt, \\end{align*} where $\\{B_t\\}_{t \\ge 0}$ is an $n$ -dimensional Brownian motion, $|\\cdot|$ denotes the Euclidean norm on $\\mathbb{R}^n$ and $c$ is a nonnegative constant. We define an elliptic operator $(\\mathcal{A},\\text{Dom}(\\mathcal{A}))$ by $\\mathcal{A}=C^2(\\mathbb{R}^n)|_E$ and \\begin{align*} \\mathcal{A}f=(1-|x|^2)\\Delta f-c x\\cdot \\nabla f,\\quad f \\in \\text{Dom}(\\mathcal{A}). \\end{align*} Then, standard results from martingale problems show that there exists a diffusion process $\\{X_t\\}_{t \\ge 0}$ on $E$ such that $f(X_t)-f(x)-\\int_{0}^{t}\\mathcal{A}f(X_s)\\,ds \\quad(t \\ge 0,\\, x \\in E) $ is a martingale. Thus, the SDE $(1)$ possesses a solution. Furthermore, we can show that the solution is unique in the sense of distribution (by the way, the pathwise uniqueness for (1) is a very profound problem). My question is as follows. If $c=0$ , then $\\mathcal{A}$ is a weighted Laplacian on $E$ and the corresponding diffusion process $X$ is a time-changed absorbing Brownian motion on the interior of $E$ . The boundary $\\partial E$ is the cemetery of $X$ . If $c>0$ , the corresponding diffusion process is a time-changed standard Brownian motion with drift? Thank you in advance. As for the above question, I may solved it myself. stochastic-processes dirichlet-forms Share Cite Improve this question Follow edited Aug 5, 2020 at 9:27 asked Aug 5, 2020 at 7:28 sharpe 817 6 6 silver badges 21 21 bronze badges $\\endgroup$ 8 $\\begingroup$ I think $\\mathcal{A} f = (1-|x|^2) \\nabla f - c x \\cdot \\nabla f$. Also, transforming to polar coordinates may shed insight into your questions. $\\endgroup$ Nawaf Bou-Rabee –  Nawaf Bou-Rabee 2020-08-05 07:39:35 +00:00 Commented Aug 5, 2020 at 7:39 $\\begingroup$ @NawafBou-Rabee Thank you. $\\mathcal{A}$ should be defined as you pointed out. $\\endgroup$ sharpe –  sharpe 2020-08-05 07:47:09 +00:00 Commented Aug 5, 2020 at 7:47 $\\begingroup$ @NawafBou-Rabee I am rather at a loss in interpreting boundary conditions. Even if $c$ vanishes, the corresponding diffusion process is not a time changed reflected B.M., right?. $\\endgroup$ sharpe –  sharpe 2020-08-05 07:50:59 +00:00 Commented Aug 5, 2020 at 7:50 $\\begingroup$ Clearly, if $c=0$, then the SDE has a fixed point on the unit sphere. That corresponds to an absorbed B.M., i.e., after the boundary is hit, the process will never leave the boundary for all subsequent times. $\\endgroup$ Nawaf Bou-Rabee –  Nawaf Bou-Rabee 2020-08-05 08:11:57 +00:00 Commented Aug 5, 2020 at 8:11 1 $\\begingroup$ It seems there is a slight transcription error in (1): the paper you mention considers an SDE with a quadratic diffusion coefficient. As the paper indicates, the classification of the boundary depends on $c$: if $c=0$ the process is a time-changed absorbed Brownian motion; if $0<c<2$, the process hits the boundary infinitely often and the solution can be identified with a time-changed reflecting Brownian motion with drift; and if $c \\ge 2$, the process never reaches the boundary and can be identified with a time-changed Brownian motion with drift. $\\endgroup$ Nawaf Bou-Rabee –  Nawaf Bou-Rabee 2020-08-07 03:49:13 +00:00 Commented Aug 7, 2020 at 3:49  |  Show 3 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions stochastic-processes dirichlet-forms See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 SDE-removal of the diffusion coefficients 4 Stochastic differential equation associated with an optimal control problem 1 Feller property for Ito diffusion with Lipschitz coefficients 2 Absolute value of a diffusion 2 Uniqueness of the solution to some degenerate SDE 3 Conditional expectation w.r.t. filtration of Brownian motion as a continuous map of its paths $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368364, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "stochastic-processes,dirichlet-forms,stochastic-processes,dirichlet-forms",
  "scraped_at": "2026-01-14T04:27:19.917974",
  "answer": ""
}