{
  "id": "q_365467",
  "mathoverflow_id": 365467,
  "url": "https://mathoverflow.net/questions/365467/best-known-primality-test-for-the-whole-intervals-of-integers-up-to-1020",
  "title": "nt.number theory - Best known primality test for the whole intervals of integers up to $10^{20}$ — like the sieve of Eratosthenes",
  "body": "What are the best known primality test(s) for the whole intervals of integers up to $N=10^{20}$ ? \"Best\" means \"have minimal amortized time per tested integer\". That is, the algorithm(s) should be fast only when testing a whole interval of integers. Just like sieve of Eratosthenes works well only if we test all integers in the whole interval $[N, N+N^{1/2+\\varepsilon})$ and degrades otherwise (say, sieve of Eratosthenes for interval $[N, N+1)$ is the same as method of trial division). UPDATE: The question probably should be asked as \"What is the best prime generation algorithm for modern computer hardware for integers up to $10^{20}$ Then for the modern CPU the answer probably is \"cache-friendly prime generation algorithms\" — this polite name is for algorithms that workaround severe non-randomness access time to modern RAM. There should be answer for modern GPGPU too. I still expect that somebody will answer, not me. nt.number-theory prime-numbers computational-number-theory Share Cite Improve this question Follow edited Jul 17, 2020 at 11:06 asked Jul 12, 2020 at 13:14 user1123502 121 3 3 bronze badges $\\endgroup$ 9 1 $\\begingroup$ Just a comment since this is a point test rather than an amortized test, but in case it’s useful for others: Michal Foriˇsek and Jakub Janˇcina, Fast Primality Testing for Integers That Fit into a Machine Word . $\\endgroup$ Geoffrey Irving –  Geoffrey Irving 2020-07-12 14:19:17 +00:00 Commented Jul 12, 2020 at 14:19 $\\begingroup$ @GeoffreyIrving Sometimes it may be possible to modify point test into amortized test, just like trial division test may be modified into the sieve of Eratosthenes and have some perfomance gain. But, of course, I am more interested in the \"ready to use\" tests. $\\endgroup$ user1123502 –  user1123502 2020-07-12 14:24:38 +00:00 Commented Jul 12, 2020 at 14:24 $\\begingroup$ Wheel sieving is ready to use. You might find that in combination with some other tests useful. Gerhard \"Sometimes Settles For Pretty Good\" Paseman, 2020.07.12. $\\endgroup$ Gerhard Paseman –  Gerhard Paseman 2020-07-12 16:28:15 +00:00 Commented Jul 12, 2020 at 16:28 2 $\\begingroup$ Since you have roughly 10^18 primes with 20 decimal digits, what are you going to do with them? Gerhard \"Please Don't Print Them Out\" Paseman, 2020.07.13. $\\endgroup$ Gerhard Paseman –  Gerhard Paseman 2020-07-13 15:53:38 +00:00 Commented Jul 13, 2020 at 15:53 $\\begingroup$ I'm thinking of a GPU version of an algorithm based on mathoverflow.net/q/243490 . You can add a comment there if you are interested and would like to contribute. Gerhard \"Is Going For Gentle Solicitation\" Paseman, 2020.07.13. $\\endgroup$ Gerhard Paseman –  Gerhard Paseman 2020-07-13 16:02:16 +00:00 Commented Jul 13, 2020 at 16:02  |  Show 4 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions nt.number-theory prime-numbers computational-number-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 5 How do these primes jump? Related 1 Interpreting a paper: primes and interval size 15 Saying things rapidly about integer factorisations 27 Proof for new deterministic primality test 5 Primality test for $2p+1$ 4 Primality test similar to the AKS test 12 Seeking references for finding primes infinitely often $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365467, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "nt.number-theory,prime-numbers,computational-number-theory,nt.number-theory,prime-numbers,computational-number-theory",
  "scraped_at": "2026-01-14T04:22:18.052936",
  "answer": ""
}