{
  "id": "q_368577",
  "mathoverflow_id": 368577,
  "url": "https://mathoverflow.net/questions/368577/uncountably-many-non-isomorphic-tate-modules",
  "title": "ag.algebraic geometry - Uncountably many non-isomorphic Tate modules",
  "body": "Do there exist uncountably many abelian surfaces with good reduction over $\\mathbb{Q}_p$ with pairwise non-isomorphic rational $p$ -adic Tate modules? If we took $l$ -adic Tate modules there would be countably many at most by a result of Kisin and the fact that the moduli of ppav is of finite type. This answer would suggest that there is only countably many $p$ -adic Tate modules for elliptic curves with good reduction. Is it at least true that there are uncountably many non-isomorphic crystalline representations of $\\mathrm{Gal}(\\overline{\\mathbb{Q}_p}/\\mathbb{Q}_p)$ coming from geometry? ag.algebraic-geometry arithmetic-geometry abelian-varieties galois-representations motives Share Cite Improve this question Follow edited Aug 8, 2020 at 18:25 asked Aug 7, 2020 at 15:20 user158636 $\\endgroup$ 7 1 $\\begingroup$ Given an abelian variety $A$ over a finite field $k$ its lifts to abelian schemes over $W(k)$ are in bijection with rank $g$ saturated submodules of $H^1_{cris}(A/W(k))$ that reduce mod $p$ to the 1st step of the Hodge filtration and are isotropic for the cup product so they are parametrized by (the $W(k)[1/p]$-points of) a residue disk in the isotropic Grassmanian. The isomorphism classes of Galois representations are then parametrized by the quotient of this disk by $Aut_{\\varphi} H^1_{cris}(A)[1/p]$. $\\endgroup$ SashaP –  SashaP 2020-08-09 20:30:17 +00:00 Commented Aug 9, 2020 at 20:30 1 $\\begingroup$ If the dimension of this algebraic group is less than $g(g+1)/2$ then the quotient has uncountably many points. This happens e.g. if $A$ is the product of $4$ pairwise non-isogenous elliptic curves, for in that case the automorphisms of a $\\varphi$-module is an $8$-dimensional group and $g(g+1)/2=10$. Maybe this happens in smaller dimensions as well because the action on the Grassmanian is not free, but I'm not sure. $\\endgroup$ SashaP –  SashaP 2020-08-09 20:30:19 +00:00 Commented Aug 9, 2020 at 20:30 1 $\\begingroup$ *4 pairwise non-isogenous ordinary elliptic curves $\\endgroup$ SashaP –  SashaP 2020-08-09 20:47:10 +00:00 Commented Aug 9, 2020 at 20:47 1 $\\begingroup$ @MikhailBondarko Sorry, I forgot to mention that we should pick a polarization on $A$ of degree prime to $p$ (let's assume that $A$ has such, if it doesn't then the question of existence of algebraizable deformations becomes subtler), it induces a perfect pairing on $H^1_{cris}$, and the claim is that lifts of the Hodge filtration isotropic for this pairing give lifts of the abelian variety that admit a lift of the polarizing line bundle. $\\endgroup$ SashaP –  SashaP 2020-08-12 22:01:08 +00:00 Commented Aug 12, 2020 at 22:01 1 $\\begingroup$ Deformations of abelian schemes are unobstructed and one can use that to show that any lift of the Hodge filtration is realized by a lift of $A$ to a formal abelian scheme (for a reference, see e.g. Messing's \"Crystals associated to Barsotti-Tate group\", though there the approach is slightly different). The chosen polarization lifts to a given formal lift if and only if the lift of the Hodge filtration is isotropic. this is because the obstruction to lifting a line bundle onto $\\mathfrak{A}$ is the image of its crystalline Chern class in the group $H^2(\\mathfrak{A},\\mathcal{O})$. $\\endgroup$ SashaP –  SashaP 2020-08-12 22:01:21 +00:00 Commented Aug 12, 2020 at 22:01  |  Show 2 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 36 In which ways can the isogeny theorem fail for local fields? Related 15 Does the p-adic Tate module of an elliptic curve with ordinary reduction decompose? 18 Period rings for Galois representations 4 Quotients of Tate modules 14 Motivic generalisation of Neron-Ogg-Shaferevich criterion 7 showing that abelian varieties are de Rham *without* showing that they are crystalline 8 Semisimplicity of Frobenius on *integral* Tate module 6 Rationality of the Tate module of an abelian variety relative to the algebra of its endomorphisms $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368577, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,arithmetic-geometry,abelian-varieties,galois-representations,motives",
  "scraped_at": "2026-01-14T04:28:05.208355",
  "answer": ""
}