{
  "id": "q_365871",
  "mathoverflow_id": 365871,
  "url": "https://mathoverflow.net/questions/365871/promoting-representation-of-a-subgroup-to-representation-of-an-action-groupoid",
  "title": "rt.representation theory - Promoting representation of a subgroup to representation of an action groupoid",
  "body": "Suppose I have a group $G$ , a subgroup $K \\leq G$ , and a representation $(\\sigma, V)$ of $K$ . There is a natural left action of $G$ on $X := G/K \\times G/K$ given by $g \\cdot (g'K,g''K) = (gg'K,gg''K)$ . From this I can form the quotient groupoid, which I'll denote $[G \\backslash X]$ (the objects are elements of $X$ , and $\\mathrm{Hom}_{[G \\backslash X]}(x,x') = \\{ g \\in G : g \\cdot x = x' \\}$ ). I define a representation of $[G \\backslash X]$ to be a functor $[G \\backslash X] \\to \\mathrm{Vect}_k$ , where the target is the category of vector spaces on $k$ . My question is: is there a \"natural\" representation of $[G \\backslash X]$ that one can define from $(\\sigma, V)$ ? It seems like there could maybe be one, because the automorphism groups of the groupoid are exactly intersections of pairs of conjugates of $K$ . The problem seems to be that $\\mathrm{Aut}_{[G \\backslash X]}(gK,g'K) = gKg^{-1} \\cap g'K(g')^{-1}$ ... and if this should act on the vector space $V$ then how should it act? $h \\cdot v = \\sigma(g^{-1}hg) \\cdot v$ ? $h \\cdot v = \\sigma((g')^{-1}hg') \\cdot v$ ? This question is admittedly a bit vague, and I guess I'm more just wondering if anyone has seen any kind of construction like this before. In my context, I'm thinking about derived Hecke algebras. rt.representation-theory group-actions groupoids hecke-algebras Share Cite Improve this question Follow edited Jul 17, 2020 at 16:13 asked Jul 17, 2020 at 16:07 Ashwin Iyengar 505 4 4 silver badges 12 12 bronze badges $\\endgroup$ 3 $\\begingroup$ I would choose the representations of these intersections that arise when you induce $\\sigma$ up to G and restrict to K' via the Mackey decomposition $\\endgroup$ Benjamin Steinberg –  Benjamin Steinberg 2020-07-18 12:02:48 +00:00 Commented Jul 18, 2020 at 12:02 $\\begingroup$ So for each $g$ you get an action of $gKg^{-1}$ on V by conjugating into K and acting. Then restrict to the intersection. This will give a functor on the groupoid in the obvious way. $\\endgroup$ Benjamin Steinberg –  Benjamin Steinberg 2020-07-18 12:04:19 +00:00 Commented Jul 18, 2020 at 12:04 $\\begingroup$ To define this explicitly you probably need to choose double coset representatives but the resulting representation is unique up to equivalence. $\\endgroup$ Benjamin Steinberg –  Benjamin Steinberg 2020-07-18 12:34:19 +00:00 Commented Jul 18, 2020 at 12:34 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions rt.representation-theory group-actions groupoids hecke-algebras See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 16 Representation of Groupoids 6 Is there a \"groupoid integral\" with values in a groupoid? 22 What is the precise relationship between groupoid language and noncommutative algebra language? 2 From the representation category of a Lie group and the representation on a homogeneous space, can we reconstruct the stabiliser subgroup reps? 8 Deligne-Scholl's motives for modular forms: Hecke operators vs. transposed Hecke operators 4 Conformal groupoid $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365871, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "rt.representation-theory,group-actions,groupoids,hecke-algebras,rt.representation-theory,group-actions,groupoids,hecke-algebras",
  "scraped_at": "2026-01-14T04:23:22.113713",
  "answer": ""
}