{
  "id": "q_368450",
  "mathoverflow_id": 368450,
  "url": "https://mathoverflow.net/questions/368450/two-kinds-of-generating-functions",
  "title": "co.combinatorics - Two kinds of generating functions",
  "body": "Sorry for a possibly off-the-topic question, but I am afraid to gain the necessary overview to give an answer (supposed the question is not ill-posed) is beyond my capabilities. In the course of creating random graphs I got to know the concept of generating functions generators for statistical distributions (as thoroughly described in Luc Devroye's book Non-uniform Random Variate Generation ). Such functions (as algorithms) are necessary to create given degree sequences to produce configuration model random graphs. On the other side I learned to know that generating functions (in the sense of generatingfunctionology ) can help to calculate combinatorial properties of graphs, especially random graphs. So I wonder if there is some \"deep\" connection between both kinds of \"generating functions\". Both have to do with statistics resp. combinatorics of graphs. Can knowing one help to know the other? co.combinatorics graph-theory generating-functions random-graphs random-functions Share Cite Improve this question Follow edited Aug 7, 2020 at 4:28 asked Aug 6, 2020 at 9:51 Hans-Peter Stricker 9,934 7 7 gold badges 59 59 silver badges 122 122 bronze badges $\\endgroup$ 3 $\\begingroup$ Your link seems to point to probability generation functions on the natural numbers. These are related to those described in generatingfunctiology and techniques from the latter help with the former. It is more that being able to manipulate of power series is useful. In practice, moment generating functions and the related characteristic functions are used more often $\\endgroup$ Henry –  Henry 2020-08-06 14:01:16 +00:00 Commented Aug 6, 2020 at 14:01 $\\begingroup$ Can you give an example or link a definition of the first kind of \"generating function\"? $\\endgroup$ Marcus M –  Marcus M 2020-08-06 20:22:11 +00:00 Commented Aug 6, 2020 at 20:22 $\\begingroup$ @MarcusM: You caught me! Devroye only talks about \"generators\" (of distributions), not literally about \"generating functions\". In fact a generator is more of an algorithm (a recipe) than of a mathematical function: it takes as input some parameters and gives as output a such-and-such distributed number. Only in my mind I called these generators \"generating functions\". I adjusted my question accordingly. $\\endgroup$ Hans-Peter Stricker –  Hans-Peter Stricker 2020-08-07 04:26:18 +00:00 Commented Aug 7, 2020 at 4:26 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions co.combinatorics graph-theory generating-functions random-graphs random-functions See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 12 Use of everywhere divergent generating functions 2 A sequence of generating functions 2 Proving generating functions equality 9 Is there a combinatorial/topological treatment of statistical independence? 3 One generating function, two-fold sums 2 Analytical expressions for certain exponential generating functions 6 $a^{th}$-root of exponential generating functions 6 Recursion for generating functions 8 Use of generating functions in logic $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368450, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "co.combinatorics,graph-theory,generating-functions,random-graphs,random-functions,co.combinatorics,graph-theory,generating-functions,random-graphs,random-functions",
  "scraped_at": "2026-01-14T04:27:24.449019",
  "answer": ""
}