{
  "id": "q_363253",
  "mathoverflow_id": 363253,
  "url": "https://mathoverflow.net/questions/363253/using-the-serre-spectral-sequence-moving-between-mathbbz-2-and-mathbbz",
  "title": "at.algebraic topology - Using the Serre spectral sequence - moving between $\\mathbb{Z}/2$ and $\\mathbb{Z}$ information",
  "body": "I am trying to understand the computation of $\\pi_5(S^3)$ and $\\pi_6(S^3)$ using the Serre spectral sequence. I know already that $\\pi_5(S^3)$ is only 2-torsion and $\\pi_6(S^3)$ is 2-torsion together with a $\\mathbb{Z}/3$ summand. For what it's worth, I'm looking at Hatcher's notes on the subject (starting on page 573). I'm sure that my confusion is fairly banal and probably will be alleviated in the comments, but I appreciate the help nevertheless. I'll start with the setup. We look at the part of the Postnikov tower $K(\\mathbb{Z}/2, 4) = K(\\pi_4(S^3), 4) \\to X_4 \\to X_3 = K(\\mathbb{Z}, 3)$ where here $X_i$ is the $i$ -th term in the Postnikov tower for $S^3$ . For the fiber and the base space, we know already the cohomology with $\\mathbb{Z}/2$ coefficients and using Bockstein cohomology and some Adem relations, we can also work out what the integral cohomology is in low degree groups (modulo odd torsion). Hatcher draws a nice picture of the $E^2$ -page of this spectral sequence (page 574). He uses the convention that an element labeled with an open circle comes from a reduction of an integral class and that an element with a closed circle does not. The Bockstein cohomology is computed for the fiber and the base in low degrees and this allows the circles in these dimensions to be filled in correctly. My first confusion is, how do we know how to fill in the terms that are not on the x- or y-axis? I imagine the convention here is to consider the reduction $H^p(B;H^q(F; \\mathbb{Z})) \\to H^p(B;H^q(F; \\mathbb{Z}/2))$ and to fill elements in if they do not lie in the dimension. In particular, the element $\\iota_3 \\iota_4$ and the element $\\iota_3 Sq^1 \\iota_4$ have a solid dot and a filled dot respectively, and I do not know why. Now we compute lots of differentials of this spectral sequence since we now that the cohomology of the total space vanishes through dimension 5 and using that various elements are transgressive and the transgression commutes with Steenrod squares. Once we have done this, we can say exactly what the $\\mathbb{Z}/2$ -cohomology of the total space is up to degree 8. Apparently, we can also say what the $\\mathbb{Z}$ -cohomology of the total space (modulo odd torsion) is in these dimensions as well. Why can we do we know this? It looks like we just look at the things on the $E^2$ -page and see what lives on to the $E^\\infty$ -page and then by looking to see if the dots are filled or not this tells us everything, but I do not understand why. at.algebraic-topology homotopy-theory spectral-sequences Share Cite Improve this question Follow edited Jun 16, 2020 at 17:33 Arun Debray 7,091 2 2 gold badges 34 34 silver badges 73 73 bronze badges asked Jun 16, 2020 at 16:09 user101010 5,389 12 12 silver badges 27 27 bronze badges $\\endgroup$ 3 $\\begingroup$ As to your first question, since we are talking about the mod 2 cohomology, we can simply use the Kunneth to fill in. The reason why Hatcher bothered to mark these classes is, presumably, becaute they hit the claas in the bottom line. $\\endgroup$ user43326 –  user43326 2020-06-16 19:10:43 +00:00 Commented Jun 16, 2020 at 19:10 $\\begingroup$ @user43326 What do you mean by using the Kuenneth here? The only Kuennth that comes to mind for me here is for computing (co)homology of products. The reason these classes are drawn is not really because they hit the bottom (see the next spectral sequence that is pictured in that section), but because they are involved in the computation of the cohomology of the total space through degree 8. $\\endgroup$ user101010 –  user101010 2020-06-17 06:48:09 +00:00 Commented Jun 17, 2020 at 6:48 $\\begingroup$ OK, it wasn't really Kunneth, but the thing is $H^*(F.Z/2)$ is a (graded) vector space over $Z/2$, so taking cohomology with $H^*(F.Z/2)$ coefficients is same as taking cohomology with $Z/2$-coefficients and then tensoring with $H^*(F.Z/2)$. $\\endgroup$ user43326 –  user43326 2020-06-17 07:59:11 +00:00 Commented Jun 17, 2020 at 7:59 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions at.algebraic-topology homotopy-theory spectral-sequences See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 13 Relating two different approaches to the Atiyah-Hirzebruch Spectral Sequence 7 Serre spectral sequence degeneration in homology vs cohomology 12 What is the relationship between spectral sequences and obstruction theory? 4 Third page differential in the Lyndon–Hochschild–Serre Spectral Sequence $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363253, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "at.algebraic-topology,homotopy-theory,spectral-sequences,at.algebraic-topology,homotopy-theory,spectral-sequences",
  "scraped_at": "2026-01-14T04:24:50.180219",
  "answer": ""
}