{
  "id": "q_368061",
  "mathoverflow_id": 368061,
  "url": "https://mathoverflow.net/questions/368061/chromatic-number-of-regular-graphs-using-spectra",
  "title": "co.combinatorics - Chromatic number of regular graphs using spectra",
  "body": "There exist inequalities relating the maximum and minimum eigenvalues of the adjacency matrix of a graph with its chromatic numbers, i.e. the Wilf's and Hoffmann's inequalities, which put together state that $1-\\frac{\\lambda_{max}}{\\lambda_{min}}\\le\\chi(G)\\le 1+\\lambda_{max}$ , where $\\chi, \\lambda_{max}, \\lambda_{min}$ respectively stand for the chromatic number, maximum and minimum eigenvalues of the adjacency matrix of $G$ . But, for regular graphs, the upper bound by Wilf's inequality is quite trivial, that is same as the greedy coloring bound. Is there a better bound for the chromatic number of a regular graphs using the spectra of, say the adjacency or Laplacian matrices? Thanks beforehand. co.combinatorics graph-theory graph-colorings spectral-graph-theory regular-graph Share Cite Improve this question Follow edited Aug 1, 2020 at 13:12 Martin Sleziak 4,813 4 4 gold badges 39 39 silver badges 42 42 bronze badges asked Jul 31, 2020 at 21:37 vidyarthi 2,145 1 1 gold badge 17 17 silver badges 24 24 bronze badges $\\endgroup$ 4 $\\begingroup$ Because I wasn't able to find it easily, can you include the Wilf-Hoffmann inequality? $\\endgroup$ M. Winter –  M. Winter 2020-08-01 11:54:20 +00:00 Commented Aug 1, 2020 at 11:54 $\\begingroup$ @M.Winter edited the post. See now $\\endgroup$ vidyarthi –  vidyarthi 2020-08-01 13:06:00 +00:00 Commented Aug 1, 2020 at 13:06 $\\begingroup$ For regular graphs, the adjacency and Laplacian matrices give exactly the same information. $\\endgroup$ Chris Godsil –  Chris Godsil 2020-08-06 17:36:40 +00:00 Commented Aug 6, 2020 at 17:36 $\\begingroup$ @ChrisGodsil ok. But, any better bound than the wilf and hoffmann's inequalities? especially upper bounds $\\endgroup$ vidyarthi –  vidyarthi 2020-08-06 17:38:12 +00:00 Commented Aug 6, 2020 at 17:38 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions co.combinatorics graph-theory graph-colorings spectral-graph-theory regular-graph See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 6 Eigenvalue inequality for regular graphs 0 Maximizing the chromatic number of regular hypergraphs $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368061, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "co.combinatorics,graph-theory,graph-colorings,spectral-graph-theory,regular-graph,co.combinatorics,graph-theory,graph-colorings,spectral-graph-theory,regular-graph",
  "scraped_at": "2026-01-14T04:26:34.878085",
  "answer": ""
}