{
  "id": "q_365541",
  "mathoverflow_id": 365541,
  "url": "https://mathoverflow.net/questions/365541/checking-existence-of-proofs-of-fixed-length",
  "title": "reference request - Checking existence of proofs of fixed length",
  "body": "This question is a continuation of a related previous question ( check here ). Let $\\mathcal{L}$ be a recursive first-order theory with the Hilbert-Ackerman's proof calculus, and such that the computational cost of deciding whether or not a formula $\\theta$ is an axiom is in P . Let $\\phi$ be a formula, and let $\\ell=(\\psi_1, \\ldots, \\psi_n = \\phi)$ be a proof of number of lines $n$ ; that is, each $\\psi_i$ is either an axiom or is obtained by a single application of a inference rule involving only formulas that appear previously in $\\ell$ (i.e., $\\psi_j, j<i$ ). Question: what is the asymptotical computational complexity of deciding whether or not $\\phi$ has a proof of number of lines $n$ ? If we change $\\mathcal{L}$ to a suitable (recursive) higher order theory and the proof calculus (e.g., Gentzen's proof calculus), how this complexity function can change? EDIT as discussed in the comments, the question above is undecidable in general. Let lenght of $\\ell$ be the total number of symbols appearing on it, which I will denot by $|\\ell|$ Question modified: what is the asymptotical computational complexity of deciding whether or not $\\phi$ has a proof $\\ell$ with a fixed lenght $|\\ell|=n$ ? If we change $\\mathcal{L}$ to a suitable (recursive) higher order theory and the proof calculus (e.g., Gentzen's proof calculus), how this complexity function can change? SECOND EDIT As seen in the coments, the modified question has a complexity function that is essentially always NP -complete. reference-request lo.logic computational-complexity computer-science proof-theory Share Cite Improve this question Follow edited Jul 14, 2020 at 0:31 Joe Previdi 509 5 5 silver badges 16 16 bronze badges asked Jul 13, 2020 at 14:09 jg1896 3,766 12 12 silver badges 29 29 bronze badges $\\endgroup$ 4 1 $\\begingroup$ In general, this is an undecidable problem, even if $n$ is a fixed constant. $\\endgroup$ Emil Jeřábek –  Emil Jeřábek 2020-07-13 14:33:54 +00:00 Commented Jul 13, 2020 at 14:33 1 $\\begingroup$ (Which is related to the fact that what you call length is usually called the number of lines , whereas the length of a proof is defined as the total number of symbols.) $\\endgroup$ Emil Jeřábek –  Emil Jeřábek 2020-07-13 14:40:01 +00:00 Commented Jul 13, 2020 at 14:40 $\\begingroup$ @EmilJeřábek and what if I change number of lines by the total number of symbols? Anyway, I thank you very much for pointing this, I am editing the question for appropriate terminology $\\endgroup$ jg1896 –  jg1896 2020-07-13 15:17:12 +00:00 Commented Jul 13, 2020 at 15:17 1 $\\begingroup$ If $n$ is the number of symbols in the proof, and it is given as input in unary, then the problem is obviously in NP. In fact, it is NP-complete as long as the theory proves $\\exists x\\exists y\\,(x\\ne y)$. $\\endgroup$ Emil Jeřábek –  Emil Jeřábek 2020-07-13 15:49:51 +00:00 Commented Jul 13, 2020 at 15:49 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request lo.logic computational-complexity computer-science proof-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 5 Computational complexity of proof verification Related 25 Are there complexity classes with provably no complete problems? 35 Is P=NP relevant to finding proofs of everyday mathematical propositions? 10 Arithmetic strength of Peano + the Howard ordinal 14 Is it possible for a theorem to be constructive only in a non-constructive metatheory? 13 Which ordinals can be proof-theoretic ordinals of a reasonable theory? 2 Complexity of deciding if an incomplete first-order theory has a stable completion 5 Computational complexity of proof verification 4 Complexity of the clause fragment of propositional Łukasiewicz logic $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365541, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,lo.logic,computational-complexity,computer-science,proof-theory,reference-request,lo.logic,computational-complexity,computer-science,proof-theory",
  "scraped_at": "2026-01-14T04:22:24.809559",
  "answer": ""
}