{
  "id": "q_366654",
  "mathoverflow_id": 366654,
  "url": "https://mathoverflow.net/questions/366654/tannakian-group-of-galois-representations-coming-from-geometry",
  "title": "Tannakian group of Galois representations coming from geometry",
  "body": "Let $K$ be a number field. Let $G_K$ be its absolute Galois group. Let $p$ be a rational prime. Let $\\mathcal{R}_{K,p}^g$ be the category of finite-dimensional continuous $p$ -adic representations of $G_K$ that come from geometry. Thus, an object $V$ of $RG_{K}^p$ is isomorphic to a sub-quotient of $H^i_{ét}(X, \\mathbb{Q}_p)(n)$ for some smooth projective variety $X$ and integers $i$ and $n$ . $\\mathcal{R}_{K,p}^g$ should be a Tannakian category, and therefore, have a Tannakian fundamental group scheme, $\\mathcal{G}_{K,p}^g$ , associated to it. How is $\\mathcal{G}_{K,p}^g$ related to $G_K$ ? ag.algebraic-geometry arithmetic-geometry algebraic-number-theory Share Cite Improve this question Follow edited Jul 27, 2020 at 3:26 asked Jul 27, 2020 at 0:46 smn 41 1 1 bronze badge $\\endgroup$ 1 4 $\\begingroup$ Its component group is $G_K$ because all Galois representations with finite image come from geometry. I don't think there is any other useful relation. $\\endgroup$ Will Sawin –  Will Sawin 2020-07-27 03:39:46 +00:00 Commented Jul 27, 2020 at 3:39 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry arithmetic-geometry algebraic-number-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 2 Tannakian fundamental group for finitely linear representation of group 13 Applications of anabelian geometry to Galois representations? 16 Galois group for 0-dimensional motives 15 Are there known cases of the Mumford–Tate conjecture that do not use Abelian varieties? 28 How are motives related to anabelian geometry and Galois-Teichmuller theory? 8 actions of the absolute Galois group and the motivic Galois group on étale cohomology 4 Tannakian fundamental group of automorphic representations 7 Tannakian-type reconstruction of étale fundamental group $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366654, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,arithmetic-geometry,algebraic-number-theory,ag.algebraic-geometry,arithmetic-geometry,algebraic-number-theory",
  "scraped_at": "2026-01-14T04:24:43.393866",
  "answer": ""
}