{
  "id": "q_365145",
  "mathoverflow_id": 365145,
  "url": "https://mathoverflow.net/questions/365145/the-chromatic-polynomial-of-a-line-graph",
  "title": "co.combinatorics - The chromatic polynomial of a line graph",
  "body": "Is there a way to obtain the chromatic polynomial of the line graph of a regular simple graph, having known the chromatic polynomial of the graph? There already exist characterizations of line graph of a simple graph, like it consists of several cliques of order equal to the maximum degree of the graph, any two being joined at at most one unique vertex. In addition, the skeleton graph of the cliques, that is the graph formed by taking each clique as a vertex, is nothing but the graph itself. Can we use these characterizations along with knowing the chromatic polynomial of the graph beforehand, to determine the required polynomial? What can be said about the complexity of this problem? Can there be a polynomial time algorithm to compute it, starting from the chromatic polynomial of the graph? Thanks beforehand. co.combinatorics graph-theory computational-complexity graph-colorings chromatic-polynomial Share Cite Improve this question Follow edited Jul 8, 2020 at 18:47 YCor 67.5k 5 5 gold badges 203 203 silver badges 301 301 bronze badges asked Jul 8, 2020 at 18:06 vidyarthi 2,145 1 1 gold badge 17 17 silver badges 24 24 bronze badges $\\endgroup$ 3 $\\begingroup$ If anything were known I might expect it to be discussed under the term \"edge chromatic polynomial\". $\\endgroup$ Ben Barber –  Ben Barber 2020-07-08 19:15:29 +00:00 Commented Jul 8, 2020 at 19:15 $\\begingroup$ @BenBarber yes, a similar question exists here , but I also ask about complexity and a method starting from the chromatic polynomial of the graph $\\endgroup$ vidyarthi –  vidyarthi 2020-07-08 19:23:41 +00:00 Commented Jul 8, 2020 at 19:23 $\\begingroup$ An observation: there are graphs with the same chromatic polynomial but different edge chromatic polynomials (various trees, say), so any such algorithm cannot depend solely on the chromatic polynomial. $\\endgroup$ Ben Barber –  Ben Barber 2020-07-08 20:28:58 +00:00 Commented Jul 8, 2020 at 20:28 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions co.combinatorics graph-theory computational-complexity graph-colorings chromatic-polynomial See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 3 Computing the Edge Chromatic Polynomial of a graph Related 0 Highly asymmetric regular graph 2 Chromatic number and graph polynomial 1 The Total Graph is similar to a line graph 6 List chromatic index of a particular graph 5 The max-clique chromatic number of a graph $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365145, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "co.combinatorics,graph-theory,computational-complexity,graph-colorings,chromatic-polynomial,co.combinatorics,graph-theory,computational-complexity,graph-colorings,chromatic-polynomial",
  "scraped_at": "2026-01-14T04:20:57.303392",
  "answer": ""
}