{
  "id": "q_365893",
  "mathoverflow_id": 365893,
  "url": "https://mathoverflow.net/questions/365893/homotopy-kan-extensions-formally-coherent-functors-and-derived-schlessinger-cri",
  "title": "ag.algebraic geometry - Homotopy Kan extensions, formally coherent functors and derived Schlessinger criterion",
  "body": "Let $k$ be a finite field. Denote by $discArt_k$ the category of Artinian rings with residue field $k$ and $Art_k$ the category of Artinian simplicial rings. Consider a functor $\\mathcal{F}:disArt_k\\rightarrow sSets$ , such that $\\mathcal{F}(k)$ is contractible. Now we can extend this functor along $disArt_k\\rightarrow Art_k$ via homotopy Kan extension to a functor $$hom\\mathcal{F}:Art_k\\rightarrow sSets.$$ By construction, this functor preserves homotopy equivalences and is reduced. One of the conditions in the derived Schlessinger criterion for $hom\\mathcal{F}$ to be pro-representable is that it is reduced, is homotopy invariant and preserves homotopy pullback. So it natural to ask when $hom\\mathcal{F}$ preserves pullbacks. Is it necessary that $\\mathcal{F}$ respects pullbacks? I'm asking because I'm studying a functor $\\mathcal{F}$ which I suspect is not (pro-)representable, but would hope that $hom\\mathcal{F}$ might be. Is this sensible? The \"geometric\" hope behind this that the \"non-transverse\" intersection of affine schemes might not be affine, but is representable by a derived scheme. ag.algebraic-geometry ct.category-theory simplicial-stuff model-categories derived-algebraic-geometry Share Cite Improve this question Follow asked Jul 17, 2020 at 20:52 curious math guy 4,438 10 10 silver badges 36 36 bronze badges $\\endgroup$ 1 2 $\\begingroup$ Pullbacks of rings correspond to gluing, not intersecting. The inclusion $disArt_k \\subset Art_k$ preserves pullbacks, so yes, it is necessary that $\\mathcal F$ preserves pullbacks. In fact, if $hom\\mathcal F$ is pro-representable by $(A_i)$, then $\\mathcal F$ is pro-representable by $(\\pi_0 A_i)$. $\\endgroup$ Marc Hoyois –  Marc Hoyois 2020-07-18 06:49:05 +00:00 Commented Jul 18, 2020 at 6:49 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry ct.category-theory simplicial-stuff model-categories derived-algebraic-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 7 Brown representability in slice category 6 (Pro-)representable functors and full subcategories in homotopy theory 8 Milnor excision for algebraic stacks 4 Coherent sheaves, Serre’s theorem and ext groups 2 Does derived tensor product preserve fiber sequence？ 6 Derived functors and functorial resolutions/(co)fibrant replacements $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365893, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,ct.category-theory,simplicial-stuff,model-categories,derived-algebraic-geometry,ag.algebraic-geometry,ct.category-theory,simplicial-stuff,model-categories,derived-algebraic-geometry",
  "scraped_at": "2026-01-14T04:27:42.778506",
  "answer": ""
}