{
  "id": "q_366497",
  "mathoverflow_id": 366497,
  "url": "https://mathoverflow.net/questions/366497/about-countable-dense-homogeneous-spaces-cdh-and-strongly-locally-homogeneous",
  "title": "gn.general topology - About Countable Dense Homogeneous spaces (CDH) and strongly locally homogeneous spaces",
  "body": "I am new to the study of CDH topological spaces, I wanted to study basic examples of this type of spaces, for example I could understand the demonstration that $\\mathbb{R}$ is CDH, using the Cantor method (back-and- forth). I have tried to imitate the idea of proof to demonstrate that $\\mathbb{R}^{n}$ is CDH but I have not been successful, does anyone have any idea how to demonstrate this fact? I have found that other authors introduce the notion of Strongly Locally Homogeneous spaces, and show that \" If $X$ is Polish and strongly locally homogeneous. Then $X$ is countable dense homogeneous \". Unfortunately I have also failed to demonstrate that $\\mathbb{R}^{n}$ is strongly locally homogeneous but also was not successful, does anyone have any ideas? Also, I would like to know what bibliography you recommend for a basic study of CDH spaces. Thank you very much gn.general-topology topological-groups homogeneous-spaces Share Cite Improve this question Follow asked Jul 24, 2020 at 20:08 Gabriel Medina 601 3 3 silver badges 10 10 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions gn.general-topology topological-groups homogeneous-spaces See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 Is the Cantor set countable dense homogeneous in pairs? 15 Is Bing's countable connected space topologically homogeneous? 5 All-set-homogeneous spaces 3 Hereditarily locally connected spaces 5 Polish space isometric to its hyperspace 21 Is the space $L^2([0,1],\\mathbb{Z})$ homeomorphic to $\\ell^2$? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366497, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "gn.general-topology,topological-groups,homogeneous-spaces,gn.general-topology,topological-groups,homogeneous-spaces",
  "scraped_at": "2026-01-14T04:24:18.664222",
  "answer": ""
}