{
  "id": "q_364146",
  "mathoverflow_id": 364146,
  "url": "https://mathoverflow.net/questions/364146/confusion-on-the-assumption-when-discussing-the-kneading-invariants-for-unimodal",
  "title": "ds.dynamical systems - Confusion on the assumption when discussing the kneading invariants for unimodal maps",
  "body": "A unimodal map is a continuous map $f:[0,1]\\longrightarrow [0,1]$ such that there is only one turning point (critical point), denoted by $c$ , and $f(0)=f(1)=0$ . Unimodal map is related to kneading invariant and kneading map, constructed by Hofbauer and Keller. One assumption is always being made by several books in dynamics. They all assume $$f^{2}(c)<c<f(c),$$ where $f^{n}(x)$ is the $n-$ times iteration of $f$ at $x$ . They all use an one-line explanation: If this condition does not hold, then $f$ has no interesting dynamics. I have drew several pictures but I cannot see why. Even though we have $c<f^{2}(c)<f(c)$ , the dynamics is still complicated, since I cannot see a clear rule about where $f^{n}(c)$ will go for $n\\geq 3$ . So what does it mean by \"interesting\" here? and why does this assumption make the dynamics \"interesting\"? Thank you! ds.dynamical-systems complex-dynamics definitions symbolic-dynamics Share Cite Improve this question Follow asked Jun 25, 2020 at 19:56 JacobsonRadical 131 4 4 bronze badges $\\endgroup$ 4 1 $\\begingroup$ In this case, the interval $I=[c,f(c)]$ is mapped into itself and the restriction of $f$ to $I$ is decreasing. This means that every orbit in $I$ converges either to a fixed point or a period two orbit. For points in $[0,c]$, the orbit is either monotonic (and so converges to a fixed point), or it eventually leaves $[0,c]$, whereupon it enters $I$. For points in $[f(c),1]$, the image is in $[0,f^2(c)]\\subset [0,c]\\cup I$, so that we have shown that every orbit approaches a fixed point or period 2 orbit. Pretty dull... $\\endgroup$ Anthony Quas –  Anthony Quas 2020-06-26 02:34:25 +00:00 Commented Jun 26, 2020 at 2:34 $\\begingroup$ @AnthonyQuas brilliant! Post an answer so that I can accept and vote? $\\endgroup$ JacobsonRadical –  JacobsonRadical 2020-06-26 13:51:31 +00:00 Commented Jun 26, 2020 at 13:51 $\\begingroup$ @AnthonyQuas could you please elaborate a little bit why every orbit in $I$ converges either to a fixed point or a period two orbit? $\\endgroup$ JacobsonRadical –  JacobsonRadical 2020-06-26 14:00:17 +00:00 Commented Jun 26, 2020 at 14:00 $\\begingroup$ The point is $f$ is a decreasing map from $I$ to $I$, so that $f^2$ is an increasing map from $I$ to $I$. It's pretty easy to see that if you have an increasing map, everything converges to a fixed point. Probably math.stackexchange.com would be a better place if you want to ask about that. $\\endgroup$ Anthony Quas –  Anthony Quas 2020-06-26 16:05:04 +00:00 Commented Jun 26, 2020 at 16:05 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ds.dynamical-systems complex-dynamics definitions symbolic-dynamics See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 8 A regularity property of transition matrices for the cat map 11 Permute Wada Lakes keeping the coastline intact? (still open in dim >2) 10 Periodicity in iterated powers of sin, cos, exp 7 Gradient flows on Hilbert manifolds 4 Critical points of polarized endomorphisms of algebraic varieties 1 Computing kneading sequences for renormalizations of Lorenz maps $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364146, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ds.dynamical-systems,complex-dynamics,definitions,symbolic-dynamics,ds.dynamical-systems,complex-dynamics,definitions,symbolic-dynamics",
  "scraped_at": "2026-01-14T04:18:28.958408",
  "answer": ""
}