{
  "id": "q_364374",
  "mathoverflow_id": 364374,
  "url": "https://mathoverflow.net/questions/364374/jordan-normal-form-in-a-reductive-group",
  "title": "lie algebras - Jordan normal form in a reductive group",
  "body": "Let $G$ be a connected complex reductive group. Given an element $g \\in G$ , there is a canonical decomposition $g = s u$ such that $s$ is semisimple, $u$ is unipotent and $s$ and $u$ commute. Similarly, for $x \\in \\frak{g}$ in the Lie algebra, there is a canonical decomposition $x = s + n$ , where $s$ is semisimple, $n$ is nilpotent and $[s,n] = 0$ . This is a generalisation of the Jordan normal form for matrices. However, in the case of matrices, the nilpotent component $x = s + n$ in the Jordan normal form has a special form, namely $n$ is block upper triangular with $1$ 's on the upper diagonal. My question is to what extent this more refined normal form generalises to reductive groups? For example, let $n \\in \\frak{g}$ be a nilpotent element. Is it possible to find a maximal torus $T \\subset G$ , and a set of simple roots $\\alpha_{1}, ..., \\alpha_{k}$ , such that $n = \\sum_{i} \\epsilon_{i} \\alpha_{i}$ , where each $\\epsilon_{i} = 0$ or $1$ ? Maybe more precisely, whats the minimal number of simple roots required in such a decomposition (where we allow the choice of maximal torus and simple roots to vary as needed). In fact, I this is enough to imply the general case. This can be seen as follows. Let $x = s + n \\in \\frak{g}$ be the canonical decomposition. The centralizer $H = C_{G}(s)$ is a connected and reductive subgroup of $G$ . It also has maximal rank, because it contains any maximal torus containing $s$ (i.e. its Lie algebra contains $s$ ). But now $n \\in \\frak{h}$ , and the roots of $H$ are a subset of the roots of $G$ . So now we can apply any result about decomposing nilpotent elements inside of $H$ , and this will be compatible with $s$ . Note: I also asked this question on math stack exchange . lie-groups lie-algebras algebraic-groups reductive-groups Share Cite Improve this question Follow asked Jun 28, 2020 at 23:42 unknownymous 531 2 2 silver badges 9 9 bronze badges $\\endgroup$ 1 1 $\\begingroup$ This sounds like you are after the classification theory of (mainly nilpotent, indeed) orbits — theories of Jacobson, Morozov, Dynkin, Kostant, Bala, Carter,... as exposed in e.g. Collingwood-McGovern ( 1993 ). N.B. Cross-posting after < 2 hours is too early. $\\endgroup$ Francois Ziegler –  Francois Ziegler 2020-06-29 01:03:53 +00:00 Commented Jun 29, 2020 at 1:03 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions lie-groups lie-algebras algebraic-groups reductive-groups See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 Orbits of Root Vectors 12 History of Jordan Canonical Form? 5 Do the absolute roots restricting to a given root form a Galois orbit? 6 Abstract Jordan decomposition maybe not exist 4 Is the Jordan decomposition for reductive groups algebraic? 4 Jordan decomposition on the dual Lie algebra 3 Restriction of scalar commutes with taking maximal subtorus for semisimple group G $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364374, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "lie-groups,lie-algebras,algebraic-groups,reductive-groups,lie-groups,lie-algebras,algebraic-groups,reductive-groups",
  "scraped_at": "2026-01-14T04:18:58.678959",
  "answer": ""
}