{
  "id": "q_364683",
  "mathoverflow_id": 364683,
  "url": "https://mathoverflow.net/questions/364683/exponentially-suppressed-events-for-bounded-difference-super-martingales",
  "title": "stochastic processes - Exponentially suppressed events for bounded difference super-martingales",
  "body": "Let $\\{ Z_n \\mid n = 0,1,..\\}$ be a non-negative super-martingale and assume that it is of bounded difference i.e $\\exists ~c_i >0$ s.t $\\vert Z_{i+1} - Z_i \\vert \\leq c_i$ . Then we know (Azuma-Hoeffding) that $\\mathbb{P} \\left [ Z_n - Z_0 \\geq t \\right ] $ is exponentially suppressed for any $t>0$ , Under what conditions are either or both of the following probabilities also low or even exponentially suppressed ? $\\mathbb{P} \\left [ \\min_{i=0,\\ldots,n} Z_i \\geq t \\right ] $ $\\mathbb{P} \\left [ \\frac{1}{n+1} \\sum_{i=0,\\ldots,n} Z_i \\geq t \\right ] $ The above question might be reminiscent of what happens in the ``Kolmogorov's sub-martingale inequality\" which says the following : that if $\\{ Z_n \\mid n = 1,..\\}$ is a non-negative sub-martingale then for any $a >0$ and $m \\in \\mathbb{Z}^+ $ we have, $\\mathbb{P} [ \\max_{n=1,..m} Z_n > a ] \\leq \\frac{\\mathbb{E} [Z_m ]}{a}$ Though I don't know if there is any direct connection between this and my question. stochastic-processes measure-concentration martingales Share Cite Improve this question Follow edited Jul 6, 2020 at 21:18 asked Jul 2, 2020 at 17:22 gradstudent 2,256 1 1 gold badge 17 17 silver badges 30 30 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions stochastic-processes measure-concentration martingales See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 6 Local concentration of measure on Erdos-Rényi graph 6 Iterated Ito Integral, Gaussian Volterra Process 9 Extension of the Azuma-Hoeffding inequality (when the differences are bounded with large probability) 9 Adaptive version of the Azuma–Hoeffding inequality 7 Large deviation/concentration inequality for submartingale 7 Do i.i.d. sums concentrate any faster than martingales? 2 Extension of Bernstein’s Inequality when the random variable is bounded with large probability 8 Concentration bounds for martingales with adaptive Gaussian steps 1 Azuma-Hoeffding for one-side bounded super-martingale sequence $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364683, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "stochastic-processes,measure-concentration,martingales,stochastic-processes,measure-concentration,martingales",
  "scraped_at": "2026-01-14T04:21:53.351525",
  "answer": ""
}