{
  "id": "q_366759",
  "mathoverflow_id": 366759,
  "url": "https://mathoverflow.net/questions/366759/algebras-with-symmetric-cartan-matrix",
  "title": "rt.representation theory - Algebras with symmetric Cartan matrix",
  "body": "Let $A$ be a finite dimensional algebra with Cartan matrix $C_A$ . $C_A$ being a symmetric matrix is equivalent to the Coxeter matrix being minus the identity matrix in case $A$ has finite global dimension and thus for finite global dimension having a symmetric Cartan matrix is a derived invariant. Question 1: Is having a symmetric Cartan matrix a derived invariant for general algebras $A$ ? edit: This is true by Jeremy Rickard's comment. Question 2: Is it true for a general finite dimensional algebra with symmetric Cartan matrix that the dominant and Gorenstein dimensions are even in case they are finite? Probably not, but maybe it is true when adding an extra condition. Is it true when the algebra additionally has finite global dimension? (I edited question 2: Before it was about the finitistic dimension instead of the Gorenstein dimension, but there is an algebra with symmetric Cartan matrix and finitistic dimension 1). rt.representation-theory homological-algebra Share Cite Improve this question Follow edited Jul 28, 2020 at 13:08 asked Jul 28, 2020 at 5:48 Mare 28.3k 7 7 gold badges 26 26 silver badges 117 117 bronze badges $\\endgroup$ 1 5 $\\begingroup$ Symmetry of the Cartan matrix is a derived invariant. If $C$ and $C'$ are the Cartan matrices of two derived equivalent finite dimensional algebras, then $C'=X^TCX$ for some invertible integer matrix $X$. $\\endgroup$ Jeremy Rickard –  Jeremy Rickard 2020-07-28 08:44:52 +00:00 Commented Jul 28, 2020 at 8:44 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions rt.representation-theory homological-algebra See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 5 Derived equivalences of Artin algebras with finitistic dimension zero 6 Derived invariant for Gorenstein algebras? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366759, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "rt.representation-theory,homological-algebra,rt.representation-theory,homological-algebra",
  "scraped_at": "2026-01-14T04:25:39.854576",
  "answer": ""
}