{
  "id": "q_362246",
  "mathoverflow_id": 362246,
  "url": "https://mathoverflow.net/questions/362246/understanding-krantzs-proof-of-hefers-lemma-in-mathbbc2",
  "title": "real analysis - Understanding Krantz&#39;s proof of Hefer&#39;s lemma in $\\mathbb{C}^2$",
  "body": "Note: I initially phrased the question in a different way, and it did not receive much attention. In the hope to make it more interesting, I have included a (long) introduction to contextualize and motivate it. However, the question itself can be understood without reading the preceding paragraphs. I was reading the chapter about Cousin problems in Krantz's \"Function theory of several complex variables\" and I was trying to understand the proof of the following fact, which according to the author contains the main ideas that are developed in the chapter. Proposition. Let $\\Omega\\subseteq\\mathbb{C}^n$ be pseudoconvex. Assume that $0\\in\\Omega$ . If $f:\\Omega\\to\\mathbb{C}$ is a holomorphic function that satisfies $f(0)=0$ , then there are holomorphic functions $f_1, f_2$ on $\\Omega$ such that $f(z) = z_1f_1(z) + z_2f_2(z)$ on $\\Omega$ . I think I can follow the proof proposed by the author (even though I find it unnecessarily convoluted, since it seems to me that the Cousin-like construction adopted in the proof is not essential and could be avoided), but I have some trouble understanding a crucial point. The domain $\\Omega$ is covered by open subsets $U_i$ and in the first part of the proof the author defines a family of smooth functions $h_1^i, h_2^i:U_i\\to\\mathbb{C}$ such that $z_1h_1^i(z) + z_2h_2^i(z) = 0$ on $U_i$ ; $\\overline\\partial h_1^j = \\overline\\partial h_1^i$ on $U_i\\cap U_j$ ; $\\overline\\partial h_2^j = \\overline\\partial h_2^i$ on $U_i\\cap U_j$ . Then the 1-forms $\\alpha_1$ and $\\alpha_2$ are defined on $\\Omega$ imposing $\\alpha_1 = \\overline\\partial h_1^i$ on each subset $U_i$ and similarly for $\\alpha_2$ . This makes sense because of the properties 2. and 3. above. The following step of the proof, which is the one I would like to understand, consists in finding two smooth functions $h_1, h_2:\\Omega\\to\\mathbb{C}$ such that $\\overline\\partial h_1 = \\alpha_1$ , $\\overline\\partial h_2 = \\alpha_2$ and $z_1h_1 + z_2h_2 = 0$ . I know that Hörmander's theorem implies the existence of $h_1$ and $h_2$ such that $\\overline\\partial h_1 = \\alpha_1$ and $\\overline\\partial h_2 = \\alpha_2$ , but it is not necessarily true that $z_1h_1 + z_2h_2 = 0$ . In fact, one has a lot of choices for such $h_1$ and $h_2$ , and it is clear that for most of them $z_1h_1 + z_2h_2 = 0$ does not hold. So some clever strategy should be used to choose the right ones. If I am reading the proof correctly, the author uses Hörmander's theorem to find $h_1$ and then defines $h_2(z) = -\\frac{z_1h_1(z)}{z_2}$ . But then I don't see why $h_2$ should be smooth; in fact I am pretty sure it is not, if $h_1$ is has not been chosen carefully. I think the problem can be solved with the following plan: Note that $z_1\\alpha_1 + z_2\\alpha_2 = 0$ on $\\Omega$ . Write $\\alpha_1 = z_2\\beta_1$ and $\\alpha_2 = z_1\\beta_2$ for some smooth 1-forms $\\beta_1$ and $\\beta_2$ . Apply Hörmander's theorem to $\\beta_1$ and $\\beta_2$ . However, I am not entirely sure on how to realize the second point. The fact that we are dealing with 1-forms instead of functions should be irrelevant. Also, the domain $\\Omega$ does not play an important role. So the real question is: Question. Let $f,g:\\mathbb{C}^2\\to\\mathbb{C}$ be two smooth functions such that $z_1\\ f(z_1, z_2) = z_2\\ g(z_1, z_2)$ on $\\mathbb{C}^2$ . Is it true that there is a smooth function $h:\\mathbb{C}^2\\to\\mathbb{C}$ such that $f(z_1,z_2) = z_2\\ h(z_1, z_2)$ ? Edit. Let me add that I have found a way around the issues in the proof of the proposition (basically, it is possible to make sure that $\\alpha_1$ and $\\alpha_2$ vanish in a neighborhood of $0$ , and then the \"plan\" i have described becomes easier to realize), but I would like to know if the question has a positive answer in general. real-analysis cv.complex-variables smoothness Share Cite Improve this question Follow edited Jun 22, 2020 at 20:49 asked Jun 5, 2020 at 12:00 fram 11 2 2 bronze badges $\\endgroup$ 2 $\\begingroup$ @StevenGubkin I think that what you are saying refers to the definition of $h_2^i$, not $h_2$. $\\endgroup$ fram –  fram 2020-06-22 15:35:11 +00:00 Commented Jun 22, 2020 at 15:35 $\\begingroup$ @StevenGubkin I am probably missing something, since I have not studied the contents of chapter 4 in much detail, but isn't it true that, if $u(z)$ is a smooth function, then $u(z) + 1/z_2$ is a non-smooth function that solves the same $\\overline\\partial$ equation off the set $z_2=0$? $\\endgroup$ fram –  fram 2020-06-22 20:39:27 +00:00 Commented Jun 22, 2020 at 20:39 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions real-analysis cv.complex-variables smoothness See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 Inverse of a function defined by an integral 2 A question from complex analysis 7 Existence of complex function? 3 Bicomplex Conjugate Derivative 7 A differential equation governing compositional inversion $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 362246, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "real-analysis,cv.complex-variables,smoothness,real-analysis,cv.complex-variables,smoothness",
  "scraped_at": "2026-01-14T04:16:49.920831",
  "answer": ""
}