{
  "id": "q_365588",
  "mathoverflow_id": 365588,
  "url": "https://mathoverflow.net/questions/365588/gaga-for-vector-bundles-over-riemann-surfaces",
  "title": "ag.algebraic geometry - GAGA for vector bundles over Riemann surfaces",
  "body": "Serre’s GAGA theorem gives an equivalence of categories between algebraic and analytic coherent sheaves over a complex projective variety. The proof relies on the finiteness of the cohomologies of coherent analytic sheaves over compact complex manifolds, which is a non-trivial analytic result. I was wondering that maybe GAGA theorem could be proven quite more easily in the case of vector bundles over a Riemann surface $X$ by using the existence of meromorphic functions as the underlying analytic result and “Grothendieck” theorem about the classification of vector bundles on the Riemann sphere. The idea is to consider a meromorphic function $f:X \\rightarrow \\mathbb{P}^1$ and, for any vector bundle $E\\rightarrow X$ , consider the pushforward $f_*E$ , which is a vector bundle over $\\mathbb{P}^1$ , which by the Grothendieck theorem is algebraic. My question is if this idea can be used to show that, since $f_*E$ is algebraic, then $E$ is also algebraic. ag.algebraic-geometry vector-bundles riemann-surfaces analytic-geometry gaga Share Cite Improve this question Follow asked Jul 14, 2020 at 7:33 G. Gallego 553 2 2 silver badges 15 15 bronze badges $\\endgroup$ 6 3 $\\begingroup$ Well, the existence of non-zero meromorphic functions is itself a non-trivial analytic result. $\\endgroup$ Francesco Polizzi –  Francesco Polizzi 2020-07-14 08:15:24 +00:00 Commented Jul 14, 2020 at 8:15 $\\begingroup$ @FrancescoPolizzi Of course, but imho is quite more simple than the other one I mention. $\\endgroup$ G. Gallego –  G. Gallego 2020-07-14 08:23:16 +00:00 Commented Jul 14, 2020 at 8:23 $\\begingroup$ $f_*E$ is not locally free in general $\\endgroup$ Chris –  Chris 2020-07-14 08:59:15 +00:00 Commented Jul 14, 2020 at 8:59 1 $\\begingroup$ Yes it is, since $f$ is finite and flat and so $R^if_*E=0$ for all $i >0$. $\\endgroup$ Francesco Polizzi –  Francesco Polizzi 2020-07-14 09:25:28 +00:00 Commented Jul 14, 2020 at 9:25 2 $\\begingroup$ I think this can work. There is a natural transformation $E \\to f^{\\ast} f_{\\ast} E$, and I think that in the curve case I can show that it is injective and $E$ even splits off as a summand. Your argument easily shows that $f^{\\ast} f_{\\ast} E$ is algebraic, so we'd want to know that a summand of an algebraic bundle is algebraic. $\\endgroup$ David E Speyer –  David E Speyer 2020-07-14 11:45:14 +00:00 Commented Jul 14, 2020 at 11:45  |  Show 1 more comment 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry vector-bundles riemann-surfaces analytic-geometry gaga See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 6 Reference for openness of stable locus of holomorphic family of vector bundles on a compact riemann surface. 3 Endomorphisms of stable vector bundles over a Riemann surface 9 Coherent sheaves and holomorphic vector bundles 20 Vector bundles on vector bundles 10 What is the role of projective spaces in GAGA? 9 Cohomology of vector bundles in families 16 GAGA for stacks 12 Does there exist a GRR-like generalization of the AS Index Theorem? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365588, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,vector-bundles,riemann-surfaces,analytic-geometry,gaga,ag.algebraic-geometry,vector-bundles,riemann-surfaces,analytic-geometry,gaga",
  "scraped_at": "2026-01-14T04:22:29.282238",
  "answer": ""
}