{
  "id": "q_364375",
  "mathoverflow_id": 364375,
  "url": "https://mathoverflow.net/questions/364375/bruhat-tits-theory-how-does-the-normalizer-act-on-an-apartment",
  "title": "algebraic groups - Bruhat-Tits theory: how does the normalizer act on an apartment?",
  "body": "Let $G$ be the points of a split, simply connected, semisimple algebraic group over a $p$ -adic field $k$ . Let $T$ be a maximal torus of $G$ , $T_c$ its unique maximal compact subgroup, and $N$ the normalizer of $T$ in $G$ . The canonical apartment of $G$ should be the vector space $V = X_{\\ast}(T) \\otimes \\mathbb R$ , where $X_{\\ast}(T)$ is the lattice of cocharacters of $T$ . There is a natural action of $N$ as a group of vector space automorphisms of $V$ , induced from the action of $N$ on cocharacters of $T$ : $$ n. \\gamma(x) = n\\gamma(x)n^{-1} \\tag{$n \\in N, x \\in k^{\\ast}, \\gamma \\in X_{\\ast}(T)$}$$ However, in Bruhat-Tits theory there should be a more general action of $N$ as a group of affine space automorphisms of $V$ , satisfying the following properties: The translations on $V$ should come from $T$ , and the kernel of the action on $N$ should be $T_c$ . Since every affine space automorphism of $V$ is a linear transformation (the \"linear part\") followed by a translation, the linear part of the automorphism induced by any $n \\in N$ should be the one I just described above (coming from the action $n.\\gamma(x) = n\\gamma(x)n^{-1}$ ). The action should depend on some sort of choice of root vectors $x_{\\alpha}: k \\xrightarrow{\\cong} U_{\\alpha}$ , where $\\alpha$ is a root of $T$ in $G$ , and $U_{\\alpha}$ is the root subgroup of $\\alpha$ . The action should possibly depend on a choice of Borel subgroup, I'm not sure. What should the action of $N$ on $V$ as a group of affine space automorphisms be? What is the cleanest way of defining it? The choice of a Borel subgroup (that is, a set of simple roots $\\Delta$ ) gives an action of $T$ on $V$ by translations. If $\\varpi_{\\alpha}^{\\vee}$ is the coweight corresponding to a simple root $\\alpha$ , then to $t \\in T$ we can associate the translation $$v \\mapsto v + \\sum\\limits_{\\alpha \\in \\Delta} \\operatorname{ord}_k(\\alpha(t)) \\varpi_{\\alpha}^{\\vee}. \\tag{$v \\in V$}$$ If the normalizer $N$ split as a direct product $N/T \\times T$ , there is an easy way of defining the action of $N$ , since the Weyl group $N/T$ already acts linearly on $V$ . However, $N$ does not typically split in this way. I have some idea of how to define the action in general, although it depends on a choice of Borel subgroup $B = TU$ as well as a choice of \"canonical Weyl group representatives\" depending on a \"splitting,\" i.e. choice of simple root vectors. algebraic-groups reductive-groups buildings Share Cite Improve this question Follow asked Jun 28, 2020 at 23:56 D_S 6,278 1 1 gold badge 16 16 silver badges 49 49 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions algebraic-groups reductive-groups buildings See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 Braid relations $n_\\alpha n_\\beta n_\\alpha \\ldots = n_\\beta n_\\alpha n_\\beta \\ldots $ in arbitrary reductive groups 9 Technical lemma on root systems, reduced to linear algebra 11 A reductive group has a quasi-split inner form 5 Do the absolute roots restricting to a given root form a Galois orbit? 0 Some confusion about weights and roots in parabolic root systems 3 Pro-unipotent radical (in Bruhat-Tits) vs. unipotent radical (and reference request) $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364375, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "algebraic-groups,reductive-groups,buildings,algebraic-groups,reductive-groups,buildings",
  "scraped_at": "2026-01-14T04:19:37.656193",
  "answer": ""
}