{
  "id": "q_366559",
  "mathoverflow_id": 366559,
  "url": "https://mathoverflow.net/questions/366559/sum-of-an-operator-with-disconnected-spectrum-and-a-compact-operator-is-strongly",
  "title": "fa.functional analysis - Sum of an operator with disconnected spectrum and a compact operator is strongly reducible",
  "body": "Let $H$ be a complex, infinite-dimensional, separable Hilbert space. Let $T \\in B(H)$ be an operator with disconnected spectrum. In the introduction of the paper: Jiang, C.; Sun, S.; Wang, Z. (1997). Essentially normal operator +compact operator = strongly irreducible operator.Transactions of the American Mathematical Society, vol 349, 1, 217-233 it is stated that $T+K$ is strongly reducible for every compact operator $K$ . I know that any operator $A$ having disconnected spectrum cannot be strongly irreducible, but how can we prove the the above sum is never strongly irreducible, whichever is $K$ compact? Any suggestion is greatly appreciated. EDIT: to be more precise, on the first page of the link in the comments, it is stated that: ... P. R. Halmos proved that for each $T \\in \\mathcal{L}(H)$ and $\\epsilon > 0$ , there exists a $K$ compact with $\\| K \\| < \\epsilon$ such that $T+K$ is irreducible [11]. It is obvious that if $\\sigma(T)$ is not connected, then for each $K$ compact, $T+K$ is still strongly reducible. Thus D. A. Herrero asked the following questions ... fa.functional-analysis operator-theory Share Cite Improve this question Follow edited Jul 25, 2020 at 20:01 asked Jul 25, 2020 at 18:44 Manuel Norman 1,195 2 2 gold badges 8 8 silver badges 13 13 bronze badges $\\endgroup$ 9 $\\begingroup$ It appears you misquoted the statement, if you are referring to what the authors call the Main Theorem (and I don't find anything else on the topic in the introduction). See here: ams.org/journals/tran/1997-349-01/S0002-9947-97-01754-6/… $\\endgroup$ Christian Remling –  Christian Remling 2020-07-25 19:08:05 +00:00 Commented Jul 25, 2020 at 19:08 $\\begingroup$ Actually, I'm not referring to the main Theorem. On the first page, before introducing the two conjectures by Herrero, it is explained why such questions are only considered for operators with connected spectrum, namely because the conjecture is said to be obviously false if the spectrum is disconnected $\\endgroup$ Manuel Norman –  Manuel Norman 2020-07-25 19:34:13 +00:00 Commented Jul 25, 2020 at 19:34 $\\begingroup$ Thanks for the clarification. And I suppose by \"strongly reducible\" they mean not strongly irreducible (I don't see any other interpretation, though it's perhaps not exactly what the grammar would suggest). $\\endgroup$ Christian Remling –  Christian Remling 2020-07-26 14:42:13 +00:00 Commented Jul 26, 2020 at 14:42 $\\begingroup$ Yes, that's precisely the definition given in other papers on Herrero's conjectures by the same authors. $\\endgroup$ Manuel Norman –  Manuel Norman 2020-07-26 14:47:13 +00:00 Commented Jul 26, 2020 at 14:47 1 $\\begingroup$ I have looked at some other papers on this topic, and I have found out that the reason why $T+K$ is not strongly irreducible (for all compact $K$) follows from Riesz decomposition Theorem: thanks to disconnectedness, this result implies the existence of nontrivial (Riesz) projections commuting with the operators considered. Consequently, the above operator is not strongly irreducible (for every compact $K$). $\\endgroup$ Manuel Norman –  Manuel Norman 2020-07-28 12:11:42 +00:00 Commented Jul 28, 2020 at 12:11  |  Show 4 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions fa.functional-analysis operator-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 5 Strongly convergent operator sequence 7 Is there an irreducible, noncompact commuting, nonnormal operator, with spectrum strictly continuous? 6 Invertible operator with countable spectrum 2 Compact operators on Banach spaces and their spectra 5 An extension of Lomonosov Theorem 4 Continuity of the extension of a tracial state with respect to the strong operator topology $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366559, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "fa.functional-analysis,operator-theory,fa.functional-analysis,operator-theory",
  "scraped_at": "2026-01-14T04:25:19.271156",
  "answer": ""
}