{
  "id": "q_364779",
  "mathoverflow_id": 364779,
  "url": "https://mathoverflow.net/questions/364779/going-from-a-class-of-path-functions-to-a-topology",
  "title": "Going from a class of path functions to a topology",
  "body": "Someone asked a version of this 10 years ago, but no satisfactory answer was given, so I want to try again. I have a class of functions F from the reals to a set S (the specifics are complicated and don't matter). I'm curious to know whether one can find a metric topology or any topology T such that F is exactly the set of continuous functions from the reals to S relative to T. So I'd be interested in either a strong set of necessary conditions (to prove that there isn't any such topology) or a weak set of sufficient conditions (to prove that there is). Here are some necessary conditions of the sort I'm thinking of: Constant: Every constant function is in F. Composition with continuous functions: If f is in F and g:R->R is continuous then f(g(t)) is in F. Splicing: If f and g are in F and f(0) = g(0), then the function h which is equal to f on negative numbers and equal to g on non-negative numbers is also in F. Separation: (for Hausdorff topologies). If f is in F, u and v are in S, u!=v and f(0)=u then there is some open interval I around 0 such that v is not in f(I). Can any one suggest any good theorems of this kind? gn.general-topology Share Cite Improve this question Follow asked Jul 3, 2020 at 20:27 Ernest Davis 461 2 2 silver badges 7 7 bronze badges $\\endgroup$ 1 1 $\\begingroup$ how about if $f(t)=g(t)$, for $t\\in A$, then $f(t)=g(t)$, for $t\\in \\overline{A}$? $\\endgroup$ erz –  erz 2020-07-04 09:30:57 +00:00 Commented Jul 4, 2020 at 9:30 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions gn.general-topology See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 10 Is there a notion of a \"perfectly regular\" topological space? 24 What sets of self-maps are the continuous self-maps under some topology? 33 Topology on the set of analytic functions 38 can another topology be given to $\\mathbb R$ so it has the same continuous maps $\\mathbb R\\rightarrow \\mathbb R$? 5 Properties of $C_B(X)$ equipped with the strict topology 26 Is there an infinite topological space with only countably many continuous functions to itself? 20 Existence of a *really* nice topology on the powerset of a topological space $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364779, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "gn.general-topology,gn.general-topology",
  "scraped_at": "2026-01-14T04:20:13.520985",
  "answer": ""
}