{
  "id": "q_365051",
  "mathoverflow_id": 365051,
  "url": "https://mathoverflow.net/questions/365051/triangle-free-graph-with-chromatic-number-4-and-one-vertex-of-a-color",
  "title": "Triangle-free graph with chromatic number &gt;= 4 and one vertex of a color",
  "body": "I was wondering about the existence of an example of a graph in the title - ie a triangle-free graph which is not 3-colorable such that one of the colors only colors one vertex. The Groetzsch graph needs at least 2 of each color as far as I can tell. I would prefer an example which is 4-colorable. Any ideas on how to find such a graph other than a brute force computer search? My understanding is that although the Groetzsch graph is the smallest triangle-free graph which is not 3-colorable it does not necessarily imply that a larger graph cannot have the property I'm looking for. graph-theory Share Cite Improve this question Follow asked Jul 7, 2020 at 16:15 bottledcaps 295 1 1 silver badge 5 5 bronze badges $\\endgroup$ 4 $\\begingroup$ Just to clarify: are you asking for a triangle-free graph which is not 3-colorable, but in which there is a vertex s.t. when coloring this vertex with a 4th color the remaining graph is 3-colorable? $\\endgroup$ Patrick Schnider –  Patrick Schnider 2020-07-08 06:46:33 +00:00 Commented Jul 8, 2020 at 6:46 $\\begingroup$ yes, and the graph should be triangle-free $\\endgroup$ bottledcaps –  bottledcaps 2020-07-08 16:33:21 +00:00 Commented Jul 8, 2020 at 16:33 $\\begingroup$ In that case I think the Groetzsch graph should work. If you color the unique vertex of degree 5 with the fourth color, the rest is 3-colorable. In fact, a smallest triangle-free graph that is not 3-colorable must necessarily work: if you would need to color two vertices with the fourth color, you could just remove one of them to get a smaller graph which is still triangle-free and still not 3-colorable, contradicting the minimality. $\\endgroup$ Patrick Schnider –  Patrick Schnider 2020-07-08 17:35:53 +00:00 Commented Jul 8, 2020 at 17:35 $\\begingroup$ Ah, it does indeed work! Thank you $\\endgroup$ bottledcaps –  bottledcaps 2020-07-08 19:01:00 +00:00 Commented Jul 8, 2020 at 19:01 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions graph-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 Tractably Partitioning the possible vertex k-colorings of a graph by local stability and instability. 4 Regular graph colorings 7 3-coloring of specific planar graphs 28 Algebraic proof of Five-Color Theorem using chromatic polynomials by Birkhoff and Lewis in 1946 4 New edge coloring problem in graph theory 3 Smallest triangle-free graph with chromatic number 5 11 Graph chromatic numbers defined by interactive proof 3 Graph which is maximal triangle-free 3-colorable, but not maximal triangle-free 11 Dense triangle-free graphs and their independent sets $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365051, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "graph-theory,graph-theory",
  "scraped_at": "2026-01-14T04:20:48.282092",
  "answer": ""
}