{
  "id": "q_363251",
  "mathoverflow_id": 363251,
  "url": "https://mathoverflow.net/questions/363251/questions-about-a-structure-related-to-simplicial-complexes",
  "title": "higher category theory - Questions about a structure related to simplicial complexes",
  "body": "While researching some superficially unrelated theory, a structure similar to the one described below presented itself to me. I'm having trouble with identifying what's the structure name. It seems to be related to simplicial homology or maybe even isomorphic. I am unfamiliar with simplicial homology, perhaps the answer to this question is \"Yes, what you're asking is exactly simplicial homology.\". I also realize the questions that I ask at the bottom are not entirely well defined. I would be grateful for any pointers that would allow me to identify the structure in question or similar. Let's assume ambient undirected graph universe. Level 1 structures are surfaces defined by directed (sets) of cycles (i.e. sets of edges with empty boundary) in the graph. One can compose two or more cycles if they have empty intersection of their directed edge sets. The sum is defined by summing them and if the resulting set contains edges of opposite orientation, removing them. This effectively merges the cycles. It is easy to show that it will still be (set of) cycles. Orientation of the surface is defined by the orientation of all edges of its boundary. There is a unique involution operation on surfaces defined by reversing orientation of all the edges of its boundary. Level 2 structures are (sets) volumes defined by sets of oriented surfaces. Similarly, for a volume to be well defined, the boundary of the boundary must be empty. Volume summing is defined in the same way: sets of boundaries (oriented surfaces, different orientations are distinct) of summands must be disjoint and we remove surfaces of opposite orientation. Resulting volumes are oriented as well. That construction can be iterated. Questions from the most general to most specific: Does this structure have a name in literature? Is it plain isomorphic to some subset of oriented simplicial complexes or simplicial homology or some generalization of them? could you give hints on how to construct said isomorphism? I am not sure whether the definition should insist on disjointedness of the sum operation, or just focus on the boundary of the boundary is empty condition. Can this structure generalized so that what's above would be just a particular presentation of the structure? The naive way of adding equalities on each level does not feel like particularly elegant ... perhaps axiomatic approach can give better theory, but I'm not sure how to define it. Can this structure be \"modelling\" \"higher order\" linear spaces along these lines: Orientation involution corresponds to taking a dual linear space. Summing of structures with disjoint undirected boundaries corresponds to tensor product. Empty structure corresponds to scalar. General summing corresponds to general composition. Shapes in general correspond to \"types/shapes/names\" of the sub-spaces / coordinates. I apologize for the fuzziness. What I'm trying to accomplish with this question is to remove that exact fuzziness. Thank you. higher-category-theory simplicial-stuff tensor-products homology Share Cite Improve this question Follow edited Jun 16, 2020 at 15:33 asked Jun 16, 2020 at 15:24 Łukasz Lew 225 1 1 silver badge 8 8 bronze badges $\\endgroup$ 3 $\\begingroup$ What exactly is meant by the sentence \"Let's assume ambient undirected graph universe.\"? $\\endgroup$ Mark Grant –  Mark Grant 2020-06-16 21:08:44 +00:00 Commented Jun 16, 2020 at 21:08 $\\begingroup$ I realize now that a more standard phrasing would be: \"Let's fix an undirected graph G\". This is the graph that the further definitions are referring to. Phrase is meant to indicate that all levels or dimensions share the same underlying graph. $\\endgroup$ Łukasz Lew –  Łukasz Lew 2020-06-17 06:52:45 +00:00 Commented Jun 17, 2020 at 6:52 1 $\\begingroup$ You talk about \"surfaces\" and \"volumes\", which are 2- and 3-dimensional concepts, whereas the underlying graph is inherently 1-dimensional. What is your schema for associating these higher dimensional objects to the underlying graph? Once you poin that down, it does sound like simplicial homology (maybe with coefficients mod 2). $\\endgroup$ Mark Grant –  Mark Grant 2020-06-17 13:39:39 +00:00 Commented Jun 17, 2020 at 13:39 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions higher-category-theory simplicial-stuff tensor-products homology See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 26 A Peculiar Model Structure on Simplicial Sets? 3 Homology with Coefficients 7 Singular homology of a graph. 4 Constructing a simplicial set homology-equivalent to a given CW complex 4 Homology of simplicial complex versus homology of simplicial _set_ $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363251, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "higher-category-theory,simplicial-stuff,tensor-products,homology,higher-category-theory,simplicial-stuff,tensor-products,homology",
  "scraped_at": "2026-01-14T04:10:33.761626",
  "answer": ""
}