{
  "id": "q_365634",
  "mathoverflow_id": 365634,
  "url": "https://mathoverflow.net/questions/365634/quantitative-bounds-on-convergence-of-bayesian-posterior",
  "title": "pr.probability - Quantitative bounds on convergence of Bayesian posterior",
  "body": "Let $Y$ be a random variable in $[0,1]$ , and let $X_1, X_2, \\ldots$ be a sequence of random variables in $[0,1]$ . Suppose that the $X_i$ 's are conditionally i.i.d given $Y$ ; in other words, I'd like to think of each $X_i$ as a \"measurement\" or \"signal\" regarding $Y$ , and the signals are i.i.d. Let $Z_k = Y | X_1,\\ldots,X_k$ be the posterior on $Y$ given the first $k$ observations. I believe that the Bernstein von-Mises theorem implies that the sequence $Z_k$ converges to some limit posterior as $k$ grows large. However, BVM does not provide any quantitative guarantees on the rate of convergence as far as I'm aware. I'm interested in quantitative statements of the form: \" $Z_k$ is close to $Z_{k-1}$ \", for some suitable choice of distance metric on distributions. More precisely, what I'd love to know is whether, for some suitable distance function $d(.,.)$ , there exists a bound of the form $d(Z_k, Z_{k-1}) \\leq f(k)$ for some decreasing function $f$ . Note that I'm asking that the bound on $d(Z_k,Z_{k-1})$ not depend on the particulars of $Y$ and the $X_i$ 's, which may or may not be asking too much... If that is asking too much, bounds on $d(Z_k,Z_{k-1})$ which depend as minimally as possible on $Y$ and the $X_i$ 's would be appreciated as well. I've seen a few somewhat similar questions on Mathoverflow and stackexchange, but didn't find anything that really answered this question. Any literature references would be appreciated. pr.probability probability-distributions bayesian-probability Share Cite Improve this question Follow edited Jul 14, 2020 at 20:39 asked Jul 14, 2020 at 20:00 sd234 173 4 4 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions pr.probability probability-distributions bayesian-probability See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 14 Concentration bounds for sums of random variables of permutations 2 Concentration rates for the posterior distribution 1 convergence of Bayesian posterior with non iid data 5 Bounding the sensitivity of a posterior mean to changes in a single data point 4 Probability of achieving the maximum among absolute value of Gaussians 7 Chernoff-type bounds for a stopped sum of independent random variables 2 Convergence in probability of a supremum $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365634, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "pr.probability,probability-distributions,bayesian-probability,pr.probability,probability-distributions,bayesian-probability",
  "scraped_at": "2026-01-14T04:21:37.638276",
  "answer": ""
}