{
  "id": "q_364185",
  "mathoverflow_id": 364185,
  "url": "https://mathoverflow.net/questions/364185/why-the-name-lipschitz-free-banach-spaces",
  "title": "fa.functional analysis - Why the name `Lipschitz-Free Banach spaces&#39;?",
  "body": "There are many names for the same objects that is known as the Arens--Eells spaces , transportation cost spaces, free Banach spaces over a (pointed) metric space, and Lipschitz-free Banach spaces . The last one bothers me a bit. Doesn't the construction something-free mean free of that something ? Think of alcohol-free drinks. The name free in Mathematics means free of further relations, so the name means free of Mr Lipschitz , who's been quite dead for some time already. Is it just slopiness or is there are good reason to call these spaces Lipschitz-free ? fa.functional-analysis banach-spaces terminology Share Cite Improve this question Follow edited Jun 26, 2020 at 13:48 RobPratt 5,784 1 1 gold badge 16 16 silver badges 27 27 bronze badges asked Jun 26, 2020 at 11:54 A_curious_asker 19 2 2 bronze badges $\\endgroup$ 6 2 $\\begingroup$ After Isaiah Berlin, are these spaces free from Lipschitz, or free to Lipschitz? $\\endgroup$ Ben McKay –  Ben McKay 2020-06-26 12:05:36 +00:00 Commented Jun 26, 2020 at 12:05 6 $\\begingroup$ I think 'slopiness' is a bit harsh. Godefroy and Kalton presumably wished to say: free with respect to Lipschitz maps. I think they were the originators of the terminology \"Lipschitz-free spaces\" and some later authors have followed them; every time the terminology gets repeated, there is less incentive to change it :-/ $\\endgroup$ Yemon Choi –  Yemon Choi 2020-06-26 12:09:05 +00:00 Commented Jun 26, 2020 at 12:09 1 $\\begingroup$ I suppose that this is the standard use of “free” as in free group, free topological group, free vector space, free locally convex space, etc. The technical definition is that it can be regarded as a functor which is adjoint to a forgetful one. In this case, the one from the category of Banach spaces to that of pointed metric spaces (both with the condition that the morphisms are contractive) where one maps the Banach space to its unit ball and forgets the linear structure. By the way do you mean “slopiness” or “sloppiness”? $\\endgroup$ user131781 –  user131781 2020-06-26 17:07:28 +00:00 Commented Jun 26, 2020 at 17:07 $\\begingroup$ Add the phrase “with radius at most 1” above after “pointed metric space”. $\\endgroup$ user131781 –  user131781 2020-06-26 17:16:20 +00:00 Commented Jun 26, 2020 at 17:16 1 $\\begingroup$ @user131781 Undoubtedly Yemon Choi was mimicking the OPs misspelling, the standard is \"sloppiness\" (\"slopiness\" is a conceivable way of referring to the quality of being sloped). I think you are right that it is \"free\" in the sense of left adjoint. Of course, $\\ell^1(X)$ is the left adjoint to the forgetful closed unit ball functor to $\\mathbf{Set}$, so some extra thing is needed to specify that it is not this forgetful functor that is meant, but the one to the category with Lipschitz maps, as you mentioned. $\\endgroup$ Robert Furber –  Robert Furber 2020-06-26 17:31:10 +00:00 Commented Jun 26, 2020 at 17:31  |  Show 1 more comment 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions fa.functional-analysis banach-spaces terminology See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 1 Continuous Left-inverse of Dirac Lipschitz-Free Space 2 Existence of a Hölder-free space 5 Concrete description of lift in Arens-Eells space 1 Known Lipschitz-free spaces 5 Existence of a Gelfand triple involving the Arens–Eells space (aka Lipschitz free space) $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364185, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "fa.functional-analysis,banach-spaces,terminology,fa.functional-analysis,banach-spaces,terminology",
  "scraped_at": "2026-01-14T04:18:33.428238",
  "answer": ""
}