{
  "id": "q_365654",
  "mathoverflow_id": 365654,
  "url": "https://mathoverflow.net/questions/365654/what-is-the-relation-between-different-generalizations-of-linear-programming",
  "title": "convex optimization - What is the relation between different generalizations of linear programming?",
  "body": "Linear programming subsumed by each of Semidefinite programming (SDP) Convex programming (CXP) SOS programming (SSP) Is there any relation between each pair in the three? Are all three equivalent in expressive capability? convex-optimization linear-programming sums-of-squares semidefinite-programming Share Cite Improve this question Follow edited Jul 15, 2020 at 18:37 none 1,137 1 1 gold badge 10 10 silver badges 24 24 bronze badges asked Jul 14, 2020 at 23:36 VS. 1,846 1 1 gold badge 12 12 silver badges 27 27 bronze badges $\\endgroup$ 2 1 $\\begingroup$ $LP\\subset SDP\\subset SSP\\subset CXP$. Also, you can encode SSP as SDP by lifting. These slides are relevant: mit.edu/~parrilo/pubs/talkfiles/Eckman.pdf $\\endgroup$ Dustin G. Mixon –  Dustin G. Mixon 2020-07-15 01:32:28 +00:00 Commented Jul 15, 2020 at 1:32 $\\begingroup$ So it is rather $LP\\subset_{poly} SDP=_{poly}SSP\\subset_{poly} CXP$? By subscript $poly$ I mean you are blowing up the program only polynomially. So the inclusions are upto polynomial blowup? $\\endgroup$ VS. –  VS. 2020-07-15 01:33:29 +00:00 Commented Jul 15, 2020 at 1:33 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions convex-optimization linear-programming sums-of-squares semidefinite-programming See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 3 Mathematical Programming with other Algebras than Linear 2 Better tactics for removing redundant constraints than Linear Programming? 3 Strict complementary slackness for semidefinite programs with strong duality 13 Famous theorems that are special cases of linear programming (or convex) duality 3 SDP representation of ideal polynomials for positivstellensatz refutations 2 Solving linear programming without solving linear programming $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365654, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "convex-optimization,linear-programming,sums-of-squares,semidefinite-programming,convex-optimization,linear-programming,sums-of-squares,semidefinite-programming",
  "scraped_at": "2026-01-14T04:22:38.235263",
  "answer": ""
}