{
  "id": "q_365564",
  "mathoverflow_id": 365564,
  "url": "https://mathoverflow.net/questions/365564/counting-unions-of-unlabelled-connected-graphs",
  "title": "reference request - Counting unions of unlabelled connected graphs",
  "body": "My question can be stated as follows: let $X$ be a hereditary family of unlabelled graphs closed under disjoint unions. Suppose we know, for each $n$ , the number $c_n$ of connected graphs in X on $n$ vertices. How do we get from that the total number $x_n$ of graphs in $X$ on $n$ vertices? I am vaguely aware that there are methods involving generating functions that answer (some version of) this question, but the only source I found for that online is a transcription of a set of lecture notes with no references whatsoever. I am not particularly well versed in the theory of generating functions, so any source which goes from the basics to the relevant derivation would be greatly appreciated. However, if it is at all possible, I would ideally like to find an explicit formula for the coefficients $x_n$ in terms of the $c_i$ , or at least a (tight-ish) lower bound for $x_n$ in terms of the $c_i$ . I can see the answer in some very simple cases: if, say, $c_i = 1$ for all $i$ (e.g., $X$ is the class of unions of cliques), then $x_n$ is just the partition function $p(n)$ from number theory (compare this to the labelled case, where we get the Bell numbers ). However, I do not see how to generalise this. It seems to me very likely that this question would have been studied in the language of multisets, but once again, I am not particularly familiar with that area. reference-request co.combinatorics graph-theory enumerative-combinatorics generating-functions Share Cite Improve this question Follow asked Jul 13, 2020 at 19:58 Bogdan 183 7 7 bronze badges $\\endgroup$ 4 2 $\\begingroup$ This is what exponential generating functions do. If you want an online source see e.g. Section 2.3 of these note: arxiv.org/abs/1409.2562 . $\\endgroup$ Sam Hopkins –  Sam Hopkins ♦ 2020-07-13 20:03:55 +00:00 Commented Jul 13, 2020 at 20:03 3 $\\begingroup$ Exponential generating functions are for labeled graphs. For unlabeled graphs you need ordinary generating functions. If $c_n$ is the number of unlabeled connected graphs in $X$ on $n$ vertices then the generating function for all unlabeled graphs in $X$ is $$\\prod_{n=1}^\\infty (1-x^n)^{-c_n}=\\exp\\biggl(\\sum_{i=1}^\\infty c(x^i)/i\\biggr)$$ where $c(x) = \\sum_{n=1}^\\infty c_n x^n$. The first formula is easier to see but the second is usually more useful for computations. This is well known, and may have been first found by Pólya. $\\endgroup$ Ira Gessel –  Ira Gessel 2020-07-13 22:29:22 +00:00 Commented Jul 13, 2020 at 22:29 1 $\\begingroup$ Apologies, Ira is of course correct, I missed the unlabeled nature of the question. (I'll leave a link to those notes of Ardila because they're very good, anyways.) $\\endgroup$ Sam Hopkins –  Sam Hopkins ♦ 2020-07-13 22:35:58 +00:00 Commented Jul 13, 2020 at 22:35 3 $\\begingroup$ One online reference is Flajolet and Sedgewick, algo.inria.fr/flajolet/Publications/book.pdf , page 34. $\\endgroup$ Ira Gessel –  Ira Gessel 2020-07-13 22:38:53 +00:00 Commented Jul 13, 2020 at 22:38 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request co.combinatorics graph-theory enumerative-combinatorics generating-functions See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 7 Examples of self-centered graphs (with large radius) 21 A strange sum over bipartite graphs 4 Algorithm to generate free unlabelled trees uniformly at random 1 Distinguishing graphs by 2-dimensional Weisfeiler-Leman vertex colourings $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365564, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,co.combinatorics,graph-theory,enumerative-combinatorics,generating-functions,reference-request,co.combinatorics,graph-theory,enumerative-combinatorics,generating-functions",
  "scraped_at": "2026-01-14T04:21:35.393574",
  "answer": ""
}