{
  "id": "q_366878",
  "mathoverflow_id": 366878,
  "url": "https://mathoverflow.net/questions/366878/generalization-of-elementary-symmetric-polynomials",
  "title": "reference request - Generalization of elementary symmetric polynomials",
  "body": "The elementary symmetric polynomials (ESPs) are defined as - \\begin{align*} E_{1}^{1} &= X_1, \\\\ E_{1}^{2} &= X_1 + X_2, \\\\ E_{2}^{2} &= X_1 X_2, \\\\ E_{2}^{3} &= X_1 X_2 + X_1 X_3 + X_2 X_3, \\\\ E_{k}^{n} &= \\sum_{1 \\leq j_1 < \\dotsb < j_k \\leq n} X_{j_1} \\dotsm X_{j_k}. \\end{align*} Notice that in the above examples, all the coefficients are 1. Now we can generalize $E_{k}^{n}$ by the following function $$ G_{k}^{n} = \\sum_{1 \\leq j_1 < \\dotsb < j_k \\leq n} S_{j_1 \\cdots j_k} \\: X_{j_1} \\dotsm X_{j_k}, $$ where $S_{j_1 \\cdots j_k}$ is symmetric. If $S_{j_1 \\cdots j_k} = 1$ , the above equation reduces to the ESP. Edit: although $S_{j_1 \\cdots j_k}$ is symmetric, $G_{k}^{n}$ is not (in the previous versions I incorrectly wrote $G_{k}^{n}$ is a symmetric polynomial). My questions are - Does the polynomial $G_{k}^{n}$ have a name? Do decompositions of $G_{k}^{n}$ exist, like the ESP (by Lee - Power sum decompositions of elementary symmetric polynomials, 2016 )? I apologize if my notations are not standard. I have edited some of them to look familiar. reference-request co.combinatorics symmetric-functions symmetric-polynomials Share Cite Improve this question Follow edited Jul 29, 2020 at 17:51 asked Jul 29, 2020 at 16:49 twofiveone 47 3 3 bronze badges $\\endgroup$ 4 $\\begingroup$ I don't see how $G_N^M$ are symmetric, unless I misunderstood the hypotheses. Minor point: you seem to be using very non-standard notation for what is a very standard object in symmetric functions theory. $\\endgroup$ user35313 –  user35313 2020-07-29 17:01:30 +00:00 Commented Jul 29, 2020 at 17:01 $\\begingroup$ Edited. Thanks! $\\endgroup$ twofiveone –  twofiveone 2020-07-29 17:20:26 +00:00 Commented Jul 29, 2020 at 17:20 $\\begingroup$ The polynomial is still not symmetric, unless all the $S $es are equal. $\\endgroup$ darij grinberg –  darij grinberg 2020-07-29 17:27:36 +00:00 Commented Jul 29, 2020 at 17:27 3 $\\begingroup$ As @darijgrinberg implies , I think you may be running into the confusion about \"how symmetric\". A symmetric polynomial is symmetric in all its variables, whereas a symmetric tensor is symmetric only in the indices that are passed to it. (I'm also not sure what you gain by thinking of tensors here.) For example, any degree-1 tensor, say $S_i = i$ in the index notation, is symmetric; but $G^2_1 = X_1 + 2X_2$ is not a symmetric polynomial. $\\endgroup$ LSpice –  LSpice 2020-07-29 17:41:56 +00:00 Commented Jul 29, 2020 at 17:41 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request co.combinatorics symmetric-functions symmetric-polynomials See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 6 Monotonicity of complete homogeneous symmetric polynomials 7 PDE characterisation of elementary symmetric functions? 15 An orbit of symmetric polynomials 2 Lagrange interpolation vs homogeneous symmetric polynomials? 10 Decomposition of even symmetric polynomials and Euler numbers 10 The vanishing of sum of coefficients: symmetric polynomials 5 Dimension reduction for non-negativity of elementary symmetric polynomials 11 Positivity of elementary symmetric polynomials under linear fractional transformations 1 Expressing factorial elementary symmetric polynomials in terms of factorial complete symmetric polynomials $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366878, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,co.combinatorics,symmetric-functions,symmetric-polynomials,reference-request,co.combinatorics,symmetric-functions,symmetric-polynomials",
  "scraped_at": "2026-01-14T04:26:02.465728",
  "answer": ""
}