{
  "id": "q_365943",
  "mathoverflow_id": 365943,
  "url": "https://mathoverflow.net/questions/365943/resolution-of-pairs-in-characteristic-p",
  "title": "ag.algebraic geometry - Resolution of pairs in characteristic p",
  "body": "Let $R$ be a complete DVR of characteristic $p$ , say $R=\\mathbb{F}_p[[t]]$ , and $X$ be a reduced scheme of finite type over $R$ . Let also $X_s$ denote the special fiber of $X$ . If I understand correctly, resolution of singularities in characteristic p, says that there is a regular scheme $X'$ of finite type over $R$ and a blowup $f:X'\\to X$ in a nowhere dense center $Z$ . However, it gives us no information on what the new special fiber $X'_s$ looks like. Q: (a) Is there a (conjectured) version of resolution of singularities in characteristic $p$ that also ensures that $X'_s$ is of a \"nice\" form (normal crossings divisor)? (b) If so, does this mean that $X'$ locally looks like $$\\operatorname{Spec}(R[x_1,\\dotsc,x_d]/(f_1^{e_1}f_2^{e_2}\\dotsb f_n^{e_n}-t))$$ where the $\\mathbb{F}_p$ -schemes cut out by the $\\bar f_i$ 's are as in the definition of normal crossings? It seems that the corresponding statement in characteristic $0$ is true and well-known (Theorem 3.1.5 in Temkin - Absolute desingularization in characteristic zero ). Also, any references that address this (or closely related) issues would be useful. Some background: I am not an algebraic geometer, but I found it convenient to assume, at least temporarily, some form of RoS in characteristic $p$ for a problem I am trying to solve. ag.algebraic-geometry reference-request schemes resolution-of-singularities Share Cite Improve this question Follow edited Jul 18, 2020 at 16:23 LSpice 14k 4 4 gold badges 48 48 silver badges 76 76 bronze badges asked Jul 18, 2020 at 16:01 Kostas Kartas 292 1 1 silver badge 8 8 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry reference-request schemes resolution-of-singularities See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 6 Resolution of singularities, nature of 23 Definition of fiber bundle in algebraic geometry 10 Schematic locus of algebraic spaces in fibers 2 Locally toric resolutions of compactifications 6 Singularities at worst like a hyperplane arrangement 22 Is being of general type stable under generization $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365943, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,reference-request,schemes,resolution-of-singularities,ag.algebraic-geometry,reference-request,schemes,resolution-of-singularities",
  "scraped_at": "2026-01-14T04:23:28.888083",
  "answer": ""
}