{
  "id": "q_368645",
  "mathoverflow_id": 368645,
  "url": "https://mathoverflow.net/questions/368645/on-some-bounds-on-two-constants-concerning-the-disconnectedness-of-the-spectra-o",
  "title": "fa.functional analysis - On some bounds on two constants concerning the disconnectedness of the spectra of small perturbations of operators",
  "body": "Let $H$ be a separable, infinite dimensional, complex Hilbert space. In the book: Jiang, C. L.; Wang, Z. Y. (1998). Strongly Irreducible Operators on Hilbert Space. CRC press above the statement of Theorem 5.17 the authors say that given $T \\in B(H)$ with disconected spectrum, there exists $\\delta >0$ such that $\\sigma(T+B)$ is disconnected for all $B$ with $\\| B \\| < \\delta$ . If an operator has disconnected spectrum, then it is strongly reducible (i.e. there exists a nontrivial projection commuting with it), while the converse is not necessarily true. Moreover, in the introduction of the paper: Herrero, D. A.; Jiang, C. L. Limits of strongly irreducible operators, and the Riesz decomposition theorem. Michigan Math. J. 37 (1990), no. 2, 283-291 it is stated that if $T$ has disconnected spectrum, all the operators which are \"close enough\" to $T$ commute with a nontrivial (Riesz) projection, and hence are strongly reducible. I think that \"close enough\" here means 'the perturbation $B$ has a small norm'. In what follows, we will consider these two constants to be the largest possible. As a first question, I wonder if there is any relation between the two constants in the above paper (I think that they may be equal, but I'm not sure about this). In any case, is there any known way to evaluate these two constants? Or is there any known upper/lower bound? fa.functional-analysis operator-theory hilbert-spaces Share Cite Improve this question Follow asked Aug 8, 2020 at 14:59 Manuel Norman 1,195 2 2 gold badges 8 8 silver badges 13 13 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions fa.functional-analysis operator-theory hilbert-spaces See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 7 Is there an irreducible, noncompact commuting, nonnormal operator, with spectrum strictly continuous? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368645, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "fa.functional-analysis,operator-theory,hilbert-spaces,fa.functional-analysis,operator-theory,hilbert-spaces",
  "scraped_at": "2026-01-14T04:27:33.721499",
  "answer": ""
}