{
  "id": "q_363537",
  "mathoverflow_id": 363537,
  "url": "https://mathoverflow.net/questions/363537/brachistochrone-for-a-rolling-sphere-with-slippage",
  "title": "ca.classical analysis and odes - Brachistochrone for a rolling sphere with slippage",
  "body": "I was recently looking into generalisations of the brachistochrone problem: for example, in this article the authors study the brachistochrone with Amontons-Coulomb friction where a bead slides along a wire from one fixed point to another under the influence of gravity and friction. In this one the author considers the brachistochrone for a sphere which rolls without friction. It seems like in the literature no-one has studied the brachistochrone/tautochrone curves for a homogeneous sphere with slippage between sphere and surface ie. a sphere which slides and rolls with friction (I am happy to be corrected if I am wrong on this). Is there any reason why this solution would be impossible to obtain or something to do with the effect of slip being too difficult to analyze? I note that in the first article it is possible to express the solution in terms of elementary functions but perhaps that is no longer possible for the rolling sphere problem. ca.classical-analysis-and-odes calculus-of-variations classical-mechanics Share Cite Improve this question Follow edited Jun 19, 2020 at 14:11 YCor 67.5k 5 5 gold badges 203 203 silver badges 301 301 bronze badges asked Jun 19, 2020 at 14:09 Hollis Williams 5,481 3 3 gold badges 30 30 silver badges 61 61 bronze badges $\\endgroup$ 2 1 $\\begingroup$ Let me suggest these generalizations of the brachistochrone, which generate numerous unsolved problems: aapt.scitation.org/doi/abs/10.1119/1.14839 and aapt.scitation.org/doi/abs/10.1119/1.15423 and aapt.scitation.org/doi/abs/10.1119/1.15001 $\\endgroup$ David G. Stork –  David G. Stork 2020-06-19 18:04:45 +00:00 Commented Jun 19, 2020 at 18:04 $\\begingroup$ Hi David, I had seen this article as well but this generalization is for a frictionless track, I was interested in a problem with the presence of friction which dissipates energy. I will consider that article again though. $\\endgroup$ Hollis Williams –  Hollis Williams 2020-06-19 18:07:20 +00:00 Commented Jun 19, 2020 at 18:07 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ca.classical-analysis-and-odes calculus-of-variations classical-mechanics See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 16 Fastest Rolling Shape? 13 When sticks fall, will they weave? 7 Rolling a convex body: Geodesics vs. rolling curves 25 Hanging a ball with string 11 \"Rolling Geodesics\": Designing a $k$-putt green 6 Is there a sideways-walking rolling convex body? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363537, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ca.classical-analysis-and-odes,calculus-of-variations,classical-mechanics,ca.classical-analysis-and-odes,calculus-of-variations,classical-mechanics",
  "scraped_at": "2026-01-14T04:17:29.945957",
  "answer": ""
}