{
  "id": "q_364984",
  "mathoverflow_id": 364984,
  "url": "https://mathoverflow.net/questions/364984/iterative-method-for-solving-certain-systems-of-linear-equations",
  "title": "algorithms - Iterative method for solving certain systems of linear equations",
  "body": "I've noticed that a method for calculating the stationary distribution of a finite-state rational-transition-probabilities Markov chain introduced by Arthur Engel many years ago generalizes to give an inefficient but charming method for solving certain systems of linear equations with rational coefficients. E.g., consider the linear system regarding three people sharing money described by Leonardo of Pisa in his Liber Abaci, as recounted by David Mumford in the April 1, 2020 installment of his blog ( http://www.dam.brown.edu/people/mumford/blog/2020/Ridiculous.html ); we can rewrite it as system of equations $x = \\frac{5}{6} x + \\frac{7}{18} y + \\frac{4}{9} z$ , $y = \\frac{1}{6} x + \\frac{5}{9} y + \\frac{5}{18} z$ , $z = \\frac{1}{18} y + \\frac{5}{18} z$ , characterizing $(x,y,z)$ as a fixed point. It's easy to verify that (33,13,1) is a solution, as is any multiple; the question is how one can find such a solution. Given a triple $t=(x,y,z)$ of positive integers, define a new triple $t'=(x',y',z')$ where $x'$ is $\\frac{5}{6} x + \\frac{7}{18} y + \\frac{4}{9} z$ rounded up to the next multiple of 18, $y'$ is $\\frac{1}{6} x + \\frac{5}{9} y + \\frac{5}{18} z$ rounded up to the next multiple of 18, and $z'$ is $\\frac{1}{18} y + \\frac{5}{18} z$ rounded up to the next multiple of 18. (More generally, you always round each variable up to the next multiple of the common denominator of the fractions associated with the right hand side of the associated equation.) I claim that for any initial triple of positive integers, the process $t \\rightarrow t’ \\rightarrow t’' \\rightarrow \\cdots$ converges to a positive integer solution to the original underdetermined system. This method is not efficient; if you start from (18,18,18), you don't arrive at (594,234,18) until 34 steps later. Still, I find it interesting that this iterative method always terminates. Has anyone characterized the sorts of problems for which this sort of method works? I'd also be curious to know whether the approach can be modified so that one is guaranteed to find the minimal positive integer solution, or can be modified to converge more quickly. linear-algebra algorithms Share Cite Improve this question Follow edited Jul 7, 2020 at 10:00 asked Jul 6, 2020 at 19:33 James Propp 20.2k 5 5 gold badges 58 58 silver badges 147 147 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions linear-algebra algorithms See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 3 Solving a noisy set of linear equations. 8 Algorithm for solving systems of linear Diophantine inequalities 0 Comparing iterative methods for linear systems 31 solving linear equations made difficult 6 Complexity of solving systems of linear diophantine equations 7 Complexity for solving linear equations? 3 Solving multilinear equations 3 Origin of the term relaxation method in numerical analysis for iteratively solving linear equations 9 Solving systems of linear equations without introducing negative numbers $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364984, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "linear-algebra,algorithms,linear-algebra,algorithms",
  "scraped_at": "2026-01-14T04:24:59.118958",
  "answer": ""
}