{
  "id": "q_363072",
  "mathoverflow_id": 363072,
  "url": "https://mathoverflow.net/questions/363072/frobenius-inner-product-of-a-zero-line-sum-matrix-and-a-doubly-stochastic-matrix",
  "title": "co.combinatorics - Frobenius inner product of a zero line-sum matrix and a doubly stochastic matrix",
  "body": "Let $A$ , $B$ be two $n\\times n$ real matrices. Let $A$ be a zero line-sum matrix where each row sum and each column sum equals zero, i.e., $$\\sum_{i=1}^{n}a_{ij}=\\sum_{j=1}^{n}a_{ij}=0 $$ (it seems there is no name for such matrix, see Name for matrices with vanishing row and column sums ). Let $B$ be a matrix where every entry is non-negative and each row sum and each column sum equals 1, i.e., $$\\sum_{i=1}^{n}b_{ij}=\\sum_{j=1}^{n}b_{ij}=1, b_{ij}\\geq 0 $$ ( $B$ is a doubly stochastic matrix). An index set $S\\subset[n]\\times[n]$ is a permutation set if $S$ has $n$ elements and if for every $(i,j),(i'j')\\in S$ , $(i,j)\\neq(i',j')$ then $i\\neq i;$ and $j\\neq j'$ . Now suppose there exists a permutation set $S$ such that $a_{ij}\\geq 0$ for every $(i,j)\\in S$ , $a_{ij}\\leq 0$ for every $(i,j)\\notin S$ and $\\sum_{(i,j)\\in S} b_{ij}\\geq \\sum_{(i,j)\\in S'} b_{ij}$ for every permuation set $S'$ . Is it true that $\\langle A,B\\rangle_F\\geq 0$ ? Note this is obviously true if $B$ is a permutation matrix or if $b_{ij}=1/n$ for every $(i,j)$ . These seems like the two extreme cases. But how to prove it in general? co.combinatorics linear-algebra matrices inequalities Share Cite Improve this question Follow edited Jun 15, 2020 at 17:47 asked Jun 14, 2020 at 21:06 Lo Celso 71 6 6 bronze badges $\\endgroup$ 4 $\\begingroup$ A small correction: $B$ is called a doubly stochastic matrix , not a Birkhoff polytope. The Birkhoff polytope is the set of all doubly stochastic matrices (in fixed dimension). $\\endgroup$ Jochen Glueck –  Jochen Glueck 2020-06-14 23:07:45 +00:00 Commented Jun 14, 2020 at 23:07 1 $\\begingroup$ @JochenGlueck Thanks! I miswrote it because I was thinking about minimizing $\\langle A,B\\rangle_F$ over a Birkhoff polytope. $\\endgroup$ Lo Celso –  Lo Celso 2020-06-14 23:32:35 +00:00 Commented Jun 14, 2020 at 23:32 2 $\\begingroup$ Going beyond your two examples, a computer might be of help finding potential counterexamples here. Data enters the problem in a very combinatorial way, and it's hard to get an intuition for why the statement should be true in general. So my 2 cents would be to try to finding some genuine counterexamples (e.g using a computer), and only in case of failure to find such, should you have more confidence in the claim, and try proving it. $\\endgroup$ dohmatob –  dohmatob 2020-06-15 08:06:15 +00:00 Commented Jun 15, 2020 at 8:06 $\\begingroup$ @dohmatob Thanks for your advice! I used Sage to try the $3 \\times3$ case and I found that the Birkhoff polytope, with the additional property I required on $B$ (I let $S=\\{(i,i)\\}$), has 24 vertices, which is indeed hard to analyze. I have changed the question to a weaker one which I believe is true. $\\endgroup$ Lo Celso –  Lo Celso 2020-06-15 17:43:07 +00:00 Commented Jun 15, 2020 at 17:43 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions co.combinatorics linear-algebra matrices inequalities See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 3 Name for matrices with vanishing row and column sums Related 6 Counting the (additive) decompositions of a quadratic, symmetric, empty-diagonal and constant-line matrix into permutation matrices 5 Rank of a 0-1-matrix 10 Properties of Zero Line-Sum Matrices 1 On a condition for a matrix sum to be zero 4 Frobenius normal form of a doubly stochastic matrix 7 On permanent of a square of a doubly stochastic matrix 2 Maximum permuted row/column sum of a matrix $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363072, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "co.combinatorics,linear-algebra,matrices,inequalities,co.combinatorics,linear-algebra,matrices,inequalities",
  "scraped_at": "2026-01-14T04:10:18.105447",
  "answer": ""
}