{
  "id": "q_364179",
  "mathoverflow_id": 364179,
  "url": "https://mathoverflow.net/questions/364179/interpreting-the-bockstein-lemma",
  "title": "at.algebraic topology - Interpreting the Bockstein lemma?",
  "body": "I am reading through \"Cohomology Operations and Applications in Homotopy Theory\" by Mosher and Tangora and I had a little bit of confusion with the Bockstein lemma. All cohomology will be with $\\mathbb{Z}/2$ -coefficients. The map $d_i$ is the $i$ -th Bockstein differential and the map $\\tau$ is the transgression in the Serre spectral sequence. The statement of the lemma is as follows, suppose that $F \\to E \\to B$ is a fibration with maps $j: F \\to E$ and $p: E \\to B$ and let $i \\geq 1$ be an integer. Let $u \\in H^n(F)$ is transgressive and $d_i v = \\tau (u)$ . Then the Bockstein lemma says that $d_{i+1} p^\\ast(v)$ is defined and $j^\\ast d_{i+1} p^\\ast(v) = d_1(u)$ . The authors say that \"The equalities should be suitably interpreted.\" and I wanted to see if I am doing that correctly, namely the last equality. In particular, when they write $j^\\ast d_{i+1} p^\\ast(v)$ does that mean that I should take a lift of $d_{i+1} p^\\ast(v)$ to $H^{n+1}(E)$ , apply $j^\\ast$ to that lift, and then interpret the result in $H^{n+1}(F)$ ? So the equality $j^\\ast d_{i+1} p^\\ast(v) = d_1(u)$ is an equality of elements in $H^{n+1}(F)$ ? Why does $j^\\ast d_{i+1} p^\\ast(v)$ not depend on the choice of lift of $d_{i+1} p^\\ast(v)$ to $H^{n+1}(E)$ ? at.algebraic-topology homotopy-theory Share Cite Improve this question Follow asked Jun 26, 2020 at 9:17 user101010 5,389 12 12 silver badges 27 27 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions at.algebraic-topology homotopy-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 8 the hopf invariant of the hopf construction 12 $Sq^1$ cohomology of spaces 8 Homology-Cohomology Pairing 6 Why are cup-i products and Steenrod Squares often (always?) unary? 21 A spectral sequence for computing cohomology of a space from that of its strata 17 Multiplicative Brown representability? 8 Analogue of Bockstein for crossed module extensions and higher Steenrod square 6 Cohomology ring of the homotopy fiber of a self map of $S^2$ of degree 2 $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364179, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "at.algebraic-topology,homotopy-theory,at.algebraic-topology,homotopy-theory",
  "scraped_at": "2026-01-14T04:18:31.192886",
  "answer": ""
}