{
  "id": "q_366618",
  "mathoverflow_id": 366618,
  "url": "https://mathoverflow.net/questions/366618/what-aspects-of-faltings-proof-of-mordells-conjecture-can-be-generalized-to-hi",
  "title": "nt.number theory - What aspects of Faltings&#39; proof of Mordell&#39;s conjecture can be generalized to higher dimensional varieties?",
  "body": "Falting's proof of Mordell's conjecture is one of the greatest achievements in arithmetic geometry. Broadly speaking, it capitalizes on an earlier observation of Parshin, which reduces Mordell's conjecture to a conjecture of Shafarevich. The proof can be broken down as follows: Given a curve $C/K$ , $K$ a number field, Parshin's construction shows that for every $K$ -point $x \\in C$ there exists a curve $C^\\prime(x)$ of fixed degree such that $C^\\prime(x)$ admits a dominant map to $C$ branched only at $x$ . Moreover, this dominant map is defined over a number field $L/K$ which is independent of $x$ . Finally, for each $x \\in C(K)$ the primes of bad reduction of the curve $C^\\prime(x)/L$ lie above the corresponding set for $C/K$ . This defines a finite-to-one map between the set of curves $\\mathcal{C}/L$ having good reduction outside of a fixed set of primes and the set $C(K)$ and thus, reduces the proof of Mordell's conjecture to Shafarevich's conjecture. Faltings broke down the proof of Shafarevich's conjecture into two components: the first is essentially Tate's conjecture for abelian varieties , which is the assertion that the $L$ -function of an abelian variety exactly determines the isogeny class of the abelian variety. The most novel part of Faltings' proof, arguably, is the statement that there are at most finitely many $K$ -isomorphism classes of abelian varieties in a given isogeny class. This necessitated the notion of a new height which is now named after Faltings. In particular, he proved that Faltings' height is necessarily bounded within an isogeny class, and that non-isomorphic but isogenous abelian varieties have different enough Faltings' height. These facts imply that the number of isomorphism classes within an isogeny class is finite. These statements together imply Mordell's conjecture, albeit in an fairly ineffective way (to be precise, it is known how to extract a numerical bound for the cardinality of $C(K)$ from this argument, but not the height of the points themselves). What aspects of this argument can be generalized to varieties of general type of higher dimensions? I understand that Tate's conjecture outside of the abelian variety setting appears to be very very difficult. What about other aspects of this argument? nt.number-theory arithmetic-geometry Share Cite Improve this question Follow asked Jul 26, 2020 at 14:55 Stanley Yao Xiao ♦ 31k 7 7 gold badges 63 63 silver badges 173 173 bronze badges $\\endgroup$ 2 2 $\\begingroup$ Note that it is not at all clear how the Tate conjecture would help in the absence of Parshin's trick (and possibly a Torelli theorem). But there are some analogues beyond the curve case of the finiteness of integral points in moduli, e.g. in the work of Lawrence and Venkatesh . As far as I know, these do not lead to new cases of the Bombieri–Lang–... conjectures. $\\endgroup$ R. van Dobben de Bruyn –  R. van Dobben de Bruyn 2020-07-26 15:27:32 +00:00 Commented Jul 26, 2020 at 15:27 $\\begingroup$ Ah yes you are right. I forgot about this key aspect of Faltings' proof, which I believe has no analogue in the higher dimensional case. $\\endgroup$ Stanley Yao Xiao –  Stanley Yao Xiao ♦ 2020-07-27 18:42:58 +00:00 Commented Jul 27, 2020 at 18:42 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions nt.number-theory arithmetic-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 12 Modularity of higher dimensional abelian varieties 9 For which fields does the isogeny theorem hold 4 question regarding Faltings' proof of the Tate conjecture for Abelian varieties over number fields 16 Lang's conjecture beyond the curve case $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366618, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "nt.number-theory,arithmetic-geometry,nt.number-theory,arithmetic-geometry",
  "scraped_at": "2026-01-14T04:25:28.597408",
  "answer": ""
}