{
  "id": "q_364941",
  "mathoverflow_id": 364941,
  "url": "https://mathoverflow.net/questions/364941/pseudodifferential-operators-and-functional-calculus",
  "title": "mp.mathematical physics - Pseudodifferential Operators and Functional Calculus",
  "body": "I hope this is not too naive a question for MO. I've been taking a mathematical physics course, and was shown how operators like $\\sqrt{1-\\Delta}$ could be defined by taking multiplication operators in Fourier space. Later it emerged that functional calculus methods also allow one to construct similarly general operators, and it seems that they are considered equivalent, as some texts do not even specify how they interpreted such formulas when they write them. Why are we allowed to identify operators constructed by these two techniques (if we are)? mp.mathematical-physics pseudo-differential-operators functional-calculus Share Cite Improve this question Follow asked Jul 6, 2020 at 10:27 Wahome 757 6 6 silver badges 11 11 bronze badges $\\endgroup$ 3 3 $\\begingroup$ For me these two methods are the same: the spectral theorem asserts that self adjoint operators are unitarily equivalent to multiplication operators, and this allows us to define an action of a suitable algebra of functions i.e. a functional calculus. Did you have something else in mind? $\\endgroup$ Paul Siegel –  Paul Siegel 2020-07-06 11:54:44 +00:00 Commented Jul 6, 2020 at 11:54 3 $\\begingroup$ \"Why are we allowed to identify operators constructed by these two techniques?\" The short answer is: the spectral theorem. $\\endgroup$ Nik Weaver –  Nik Weaver 2020-07-06 12:21:42 +00:00 Commented Jul 6, 2020 at 12:21 1 $\\begingroup$ The route we took to functional calculus was via Helffer-Sjostrand, not the 'traditional' spectral theorem. But I see now what to do, thank you! $\\endgroup$ Wahome –  Wahome 2020-07-06 13:15:57 +00:00 Commented Jul 6, 2020 at 13:15 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions mp.mathematical-physics pseudo-differential-operators functional-calculus See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 8 Where can I learn about (the asymptotics of) Toeplitz operators? 9 Functions of pseudodifferential operators 42 Recent fundamental new directions in PDEs 3 about smoothing pseudodifferential operators 8 What is the general form of the duality transform for the Fock space? 0 Definition of Elliptic pseudodifferential operators 10 Why does Riesz's Representation Theorem apply in quantum mechanics? 10 Rigorous proof of the pentagon identity $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364941, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "mp.mathematical-physics,pseudo-differential-operators,functional-calculus,mp.mathematical-physics,pseudo-differential-operators,functional-calculus",
  "scraped_at": "2026-01-14T04:20:34.744561",
  "answer": ""
}