{
  "id": "q_368874",
  "mathoverflow_id": 368874,
  "url": "https://mathoverflow.net/questions/368874/support-of-the-fundamental-class-of-irreducible-components-of-partial-springer-f",
  "title": "ag.algebraic geometry - Support of the fundamental class of irreducible components of partial Springer fibres corresponding to flag signatures",
  "body": "The (partial) Springer resolution is defined as a map $\\mu: T^*\\mathcal{F} \\to \\mathcal{N}$ , where $\\mathcal{F}$ is the partial flag variety consisting of $n$ -step partial flags of $\\mathbb{C}^d$ , and $\\mathcal{N}$ a set of nilpotent operators $\\mathcal{N} = \\{X \\in \\text{End}(\\mathbb{C}^d) : X^n = 0\\}$ . A partial Springer fibre is the set $\\mathcal{F}^X := \\mu^{-1}(X) = \\{F_\\bullet : X F_i \\subset F_{i-1}\\}$ . Ginzburg has a construction of certain irreps of $\\mathfrak{sl}_n$ on the (top Borel-Moore homology) of these fibres $H(\\mathcal{F}^X)$ (the vector space spanned by the fundamental classes of the irreducible components of $\\mathcal{F}^X$ ). In particular, they are irreducible, with highest weight given by the Jordan type of $X$ (a partition consisting of the sizes of the Jordan blocks in its decomposition), see Chriss-Ginzburg Theorem 4.2.3 for example. In the proof of this theorem, the first part goes (below is an abridged version): For any partition (or sequence/composition) $\\lambda$ the fundamental class of the diagonal $T_\\Delta^*(\\mathcal{F}_\\lambda \\times \\mathcal{F}_\\lambda)$ acts as the identity map on any cycle in $H(\\mathcal{F}^X)$ supported only on $\\mathcal{F}_\\lambda$ , annihilating any other cycle. I am looking hopefully for a reference to why this statement should be true. I can think of an equivalent statement that is (at least) easier for me to understand: Let $F$ be an irreducible component of the partial Springer fibre $\\mathcal{F}^X$ , and let $[F]$ be its fundamental class in the top Borel-Moore homology. Then the support of $F$ is contained in $\\mathcal{F}_\\mu$ if and only if $F \\subseteq \\mathcal{F}_\\mu$ . A point to make here is that the general definition (that I'm comfortable with) of the support of a cycle (as a sum of singular simplices) is the union of the images of each of the simplices. In the case of the Borel-Moore homology, it seems that the support of a cycle (as a linear combination of fundamental classes - the distinguished basis) is the union of the irreducible components whose fundamental classes appear with nonzero coefficient in the expression of that cycle in the vector space $H(\\mathcal{F}^X)$ . I am unable to see how to reconcile these two definitions, but surely they must be equivalent in the BM homology. In lieu of a reference to the previous statement/s or even the proof in Ginzburg's book, a hint on why they may or may not be true (even just morally), or even better a reference/outline, would be desired in the answer. Finally, this is a repost of the question I asked on MSE found here . This is also my first time posting on MO, by advice of my supervisor - please let me know if there are any improvements I can make to the question. ag.algebraic-geometry reference-request rt.representation-theory Share Cite Improve this question Follow asked Aug 11, 2020 at 13:44 mi.f.zh 159 4 4 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry reference-request rt.representation-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 2 Springer fibres for nilpotents of type $(n,n)$; framed tangles 8 Are there cases in which the Weyl group _does_ act on the flag variety/springer fiber? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368874, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,reference-request,rt.representation-theory,ag.algebraic-geometry,reference-request,rt.representation-theory",
  "scraped_at": "2026-01-14T04:28:27.629088",
  "answer": ""
}