{
  "id": "q_368281",
  "mathoverflow_id": 368281,
  "url": "https://mathoverflow.net/questions/368281/when-is-the-natural-map-of-tate-cohomology-an-isomorphism",
  "title": "gr.group theory - When is the natural map of Tate cohomology an isomorphism?",
  "body": "First of all I want to say that I am not at all an expert in Group cohomology . Recently I attended a seminar where the speaker mentioned about something called Tate cohomology groups which in someway relate group homology and group cohomology in one sequence. My question is the following: Is there any result towards the characterization of the finite groups $G$ and $G$ -modules $A$ such that the natural map $N:H_0(G,A) \\rightarrow H^{0}(G,A)$ appearing in Tate cohomology is an isomorphism of groups? (My reference is https://en.wikipedia.org/wiki/Tate_cohomology_group ) It seems interesting to me because when $N$ is an isomorphism it represents some sort of notion of duality between group homology and group cohomology at the zeroth level. I asked this question to the speaker but did not get satisfactory answer . So I am asking here for an answer / partial answer to my question. I apologise in advance if my question sounds stupid. gr.group-theory finite-groups group-cohomology class-field-theory duality Share Cite Improve this question Follow edited Aug 4, 2020 at 7:21 YCor 67.5k 5 5 gold badges 203 203 silver badges 301 301 bronze badges asked Aug 4, 2020 at 6:41 Adittya Chaudhuri 1,235 7 7 silver badges 14 14 bronze badges $\\endgroup$ 3 3 $\\begingroup$ It holds, for example, if A is a projective Z[G]-module (III.1.1(c) in Brown's book 'Cohomology of Groups') $\\endgroup$ Drew Heard –  Drew Heard 2020-08-04 06:55:02 +00:00 Commented Aug 4, 2020 at 6:55 $\\begingroup$ @DrewHeard Thanks for the Reference. I guess you mean Chapter 3, Section 1 in Brown's book. I have the first edition of the book with me but I could not find 1(c) in section 1 of chapter 3 there. Is it a different edition? $\\endgroup$ Adittya Chaudhuri –  Adittya Chaudhuri 2020-08-04 07:14:39 +00:00 Commented Aug 4, 2020 at 7:14 $\\begingroup$ @DrewHeard Thanks I found it. It was in the Exercise. $\\endgroup$ Adittya Chaudhuri –  Adittya Chaudhuri 2020-08-04 07:35:29 +00:00 Commented Aug 4, 2020 at 7:35 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions gr.group-theory finite-groups group-cohomology class-field-theory duality See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 15 Tate Cohomology via stable categories 70 Nontrivial finite group with trivial group homologies? 7 The Norm Map in (group) cohomology via classifying spaces 8 The extension class of a finite Heisenberg group 5 When is the cohomology of a fiber bundle a tensor product? 3 Cup product in Tate Cohomology Ring 2 A description of the fundamental class of the group cohomology of the fundamental group of an orientable surface of genus $g$ 9 Comparing cohomology of a total complex with the cohomology of semidirect product $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368281, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "gr.group-theory,finite-groups,group-cohomology,class-field-theory,duality,gr.group-theory,finite-groups,group-cohomology,class-field-theory,duality",
  "scraped_at": "2026-01-14T04:26:57.377131",
  "answer": ""
}