{
  "id": "q_366668",
  "mathoverflow_id": 366668,
  "url": "https://mathoverflow.net/questions/366668/meaning-of-l-reduction-from-dominating-set-problem",
  "title": "graph theory - Meaning of L-reduction from Dominating set problem",
  "body": "We are working in a variation of Locating dominating sets. Recently, we realized that the reduction from dominating set to our problem in proving its NP-completeness turns out to be also an L-reduction. This would mean that there is no PTAS for our problem since the dominating set problem does not have PTAS. Now we have two questions: since the dominating set problem is W[2]-complete, does that follow to our problem because of the L-reduction? we have proved that our problem is in XP (i.e, piecewise polynomial) and also in APX (there is a 2-approximation polynomial algorithm). But dominating set problem is known to be not in APX. Does this mean somewhere we might have gone wrong or is this perfectly alright? graph-theory computational-complexity approximation-algorithms graph-domination Share Cite Improve this question Follow asked Jul 27, 2020 at 8:02 Venugopal K 11 1 1 bronze badge $\\endgroup$ 3 $\\begingroup$ (1) I'd say that it depends. L-reductions allow some leeway between the upper and lower bounds of solution sizes (the $\\alpha$ and $\\beta$ constants), whereas W[2]-hardness reductions use an exact value of $k$. If your proof show that G has a dom-set of size at most k iff your instance has solution size at most f(k) for some function f, then W[2]-hardness should hold. (2) APX membership is preserved between minimization problems, so if you have a minimization problem, something might be wrong. But if you have a maximization problem, you might still be OK. $\\endgroup$ Manuel Lafond –  Manuel Lafond 2020-07-29 01:04:11 +00:00 Commented Jul 29, 2020 at 1:04 $\\begingroup$ @ManuelLafond Ours is a minimization problem and we have proved it to be APX complete by L-reduction from Dominating set-B (graphs bounded by vertex degree B, i.e, $\\Delta(G)=B$ ) problem. In proving W-hardness, f(k) is generally like k or k+1 or k+2 and so on. Any idea how much can we stretch that f(k)? Can it be as big as something like $2*k$ or say $\\Delta*k$? Thank you for the response! $\\endgroup$ Venugopal K –  Venugopal K 2020-07-30 15:06:44 +00:00 Commented Jul 30, 2020 at 15:06 $\\begingroup$ DomSet-B is in APX, assuming B is a constant. So there seems to be no contradiction with the L-reduction. For W-hardness, you can stretch k to any function f(k) not depending on $n$. So $2k$ or even $2^{2^k}$ is fine but not $\\Delta k$ unless $\\Delta$ is bounded by $k$. Also, I don't know if DomSet-B is actually W[2]-hard - make sure this is the case if you reduce from that variant. $\\endgroup$ Manuel Lafond –  Manuel Lafond 2020-07-31 17:41:31 +00:00 Commented Jul 31, 2020 at 17:41 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions graph-theory computational-complexity approximation-algorithms graph-domination See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 10 Polynomial-time complexity and a question and a remark of Serre 1 Analogue break down between complexity theory and computability theory 4 Under what conditions does an Integer Programming problem run in polynomial time? 7 Complexity of finding semi-ordered Eulerian tours in a 4-regular graph 0 Minimal dominating sets in flat graphs $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366668, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "graph-theory,computational-complexity,approximation-algorithms,graph-domination,graph-theory,computational-complexity,approximation-algorithms,graph-domination",
  "scraped_at": "2026-01-14T04:25:30.838438",
  "answer": ""
}