{
  "id": "q_363167",
  "mathoverflow_id": 363167,
  "url": "https://mathoverflow.net/questions/363167/sum-of-squares-of-polynomials-in-one-variable-with-missing-powers",
  "title": "ag.algebraic geometry - Sum of squares of polynomials in one variable with missing powers",
  "body": "As we known, a positive polynomial in $\\mathbb{R}\\left[x\\right]$ can be expressed as a sum of squares of polynomials. The problem is that whether this holds if some powers is missed. Let $A$ be a finite set of natural numbers with $0\\in A$ . Let $\\mathcal{P}=Lin\\left \\{x^n: n\\in A\\right\\}$ be a linear span of monimials and $\\mathcal{P}^2=Lin\\left\\{x^{m+n}:m,n\\in A\\right\\}$ . Let $f$ be a positive polynomial in $\\mathcal{P}^2$ , that is, $f\\in \\mathcal{P}^2$ and $f\\geq 0$ . Questions: (i) When $f$ can be expressed as a sum of squares of polynomials in $\\mathcal{P}$ ?, i.e, $f=\\sum_{i}f_i^2, \\quad f_i\\in \\mathcal{P}$ (ii) Is there another modified form for a sum of squares of polynomials in $\\mathcal{P}$ ? I will give an example. Let $A=\\left\\{0,2,3\\right\\}$ . Then $\\mathcal{P}=Lin\\left\\{1,x^2,x^3\\right\\}$ and $\\mathcal{P}^2=Lin\\left\\{1,x^2,x^3,x^4,x^5,x^6\\right\\}$ . Take $f=x^2$ . We see that the only way to write $f$ as a sum of squares is $f=\\left(x\\right)^2$ . But in this case, $x\\notin\\mathcal{P}$ . This means $f$ cannot expressed as a sum of squares of polynomials in $\\mathcal{P}$ . The first question is not much difficult. I focus on the second one. Idea: a positive polynomial in $\\mathcal{P}^2$ is a finite sum of terms $gp^2$ , where $p,gp \\in \\mathcal{P}$ and $g\\geq 0$ . Example: Let $A=\\left\\{0,2,3\\right\\}$ as above. Take $f=x^4-x^2+1$ . We can write $$f=\\left(x^2-1\\right)^2+x^2=1.\\left(x^2-1\\right)^2+x^2.1$$ (we have here $g=1\\geq 0,\\ p=gp=x^2-1\\in \\mathcal{P}$ and $g=x^2\\geq 0, \\ p=1\\in \\mathcal{P}, \\ gp = x^2\\in \\mathcal{P}$ ) This idea may be right or not. I have no counter-example so far. I took some cases with low degree and did see that this really works. But I don't know how to prove it. The condition $p\\in \\mathcal{P}$ (and also $gp\\in \\mathcal{P}$ ) is required (because we want a expression as sum of squares of polinomials in $\\mathcal{P}$ ). Do you think it works? I think it's true and try to prove it. ag.algebraic-geometry polynomials sums-of-squares Share Cite Improve this question Follow edited Jun 15, 2020 at 21:35 asked Jun 15, 2020 at 21:29 Chivul 129 3 3 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry polynomials sums-of-squares See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 36 When is a power of a nonnegative polynomial a sum of squares? 2 Homogenous polynomials as sum or differences of squares and symmetric polynomials 6 For a Sum-of-Squares cost functions J(x) is it true that J(x)-j* is also SOS? 7 Positive Semidefinite Polynomial with Bounded Degree in each Variable 8 Can a positive polynomial on sphere be represented as the sum of squares of spherical harmonics 0 Linear independence of complex polynomials and a \"sum of squares\" conjecture 6 Representing a symmetric polynomial as a conical sum of squares 17 Representing $x^3-2$ as a sum of two squares $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363167, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,polynomials,sums-of-squares,ag.algebraic-geometry,polynomials,sums-of-squares",
  "scraped_at": "2026-01-14T04:10:24.841845",
  "answer": ""
}