{
  "id": "q_366135",
  "mathoverflow_id": 366135,
  "url": "https://mathoverflow.net/questions/366135/what-is-the-order-of-binary-partition-function-when-number-of-partitions-is-fixe",
  "title": "nt.number theory - What is the order of binary partition function when number of partitions is fixed?",
  "body": "Given a number $N$ , the number of ways to write it as a sum of powers of $2$ is called the binary partition function of $N$ and is well studied. But if the number partitions are fixed, then how do you write the number $N$ as the sum of $k$ powers of $2$ , that is, are there are any known upper and lower bounds for number of partitions? nt.number-theory co.combinatorics analytic-number-theory Share Cite Improve this question Follow edited Jul 21, 2020 at 11:15 vidyarthi 2,145 1 1 gold badge 17 17 silver badges 24 24 bronze badges asked Jul 20, 2020 at 18:59 Rishi Gajjala 11 1 1 bronze badge $\\endgroup$ 1 $\\begingroup$ See OEIS A089052 . $\\endgroup$ Max Alekseyev –  Max Alekseyev 2020-07-21 18:32:56 +00:00 Commented Jul 21, 2020 at 18:32 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions nt.number-theory co.combinatorics analytic-number-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 6 Count of full, binary trees with fixed number of leaves 1 Does the Hardy-Ramanujan Asymptotic Formula Partition Sets or Integers? 4 Which unordered partition of $n$ gives rise to the largest number of ordered partitions? 3 Partitioning a binary tree into vertex-disjoint subtrees 8 A generalization of partition function to the sums of squares 5 Closed-form for the number of partitions of $n$ avoiding the partition $(4,3,1)$ 5 Number of partitions dominated by a given partition $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366135, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "nt.number-theory,co.combinatorics,analytic-number-theory,nt.number-theory,co.combinatorics,analytic-number-theory",
  "scraped_at": "2026-01-14T04:23:44.601737",
  "answer": ""
}