{
  "id": "q_364251",
  "mathoverflow_id": 364251,
  "url": "https://mathoverflow.net/questions/364251/pro-commutative-group-schemes",
  "title": "ag.algebraic geometry - pro-commutative group schemes",
  "body": "When $k$ is field, Demazure and Gabriel defined and worked with the category of commutative pro-algebraic groups over $k$ . In their book, they proved that $Ext^n(\\varprojlim G_i, H)= \\varinjlim Ext^n(G_i,H)$ (Chap.5, cor. 3.9), the Ext is taken within the category of commutative pro-algebraic groups. When working with general base $S$ , I am aware that the category of commuatative group schemes over $S$ needs not be abelian. But do we have similar construction of the pro-category here? More importantly (this is really the question I concern) do we have the isomorphism $Ext^n(\\varprojlim G_i, H)= \\varinjlim Ext^n(G_i,H)$ in general? ag.algebraic-geometry group-schemes Share Cite Improve this question Follow edited Jun 27, 2020 at 9:00 asked Jun 27, 2020 at 7:56 Noah 21 2 2 bronze badges $\\endgroup$ 1 $\\begingroup$ @მამუკაჯიბლაძე Oh no.. sorry for the typos. edited. $\\endgroup$ Noah –  Noah 2020-06-27 08:59:56 +00:00 Commented Jun 27, 2020 at 8:59 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry group-schemes See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 13 Lie Algebra of Group Scheme 6 demazure's and gabriel's book, problem with the proof of a theorem 8 What about schemes built up out of graded rings? 8 Tate modules of commutative group schemes over finite field 11 'Continuity' of the étale topos 9 Some basic questions on quotient of group schemes 6 Extensions of algebraic groups and extensions of fpqc sheaves 7 Group cohomology for finite étale group schemes $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364251, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,group-schemes,ag.algebraic-geometry,group-schemes",
  "scraped_at": "2026-01-14T04:18:35.647137",
  "answer": ""
}