{
  "id": "q_363618",
  "mathoverflow_id": 363618,
  "url": "https://mathoverflow.net/questions/363618/positive-vector-in-the-kernel-of-an-skew-symmetric-incidence-matrix",
  "title": "graph theory - Positive vector in the kernel of an skew-symmetric incidence matrix",
  "body": "Let $G=(V,A)$ be an oriented graph, stronlgy connected with $n\\in\\mathbb{N}^*$ vertices. Let $M\\in\\mathcal{M}_n(\\mathbb{R})=(m_{i,j})$ be an skew-symmetric matrix of size $n$ and rank $r$ , such that for all $i,j\\in V$ : $i\\longrightarrow j\\Longleftrightarrow m_{i,j}>0$ (hence $M$ is a skew-symmetric incidence matrix of $G$ ). Is there any necessary and sufficient condition on $G$ and $r$ ensuring that there exists a positive vector in $\\text{Ker}(M)$ ? I've tried several matrices for $n\\in\\{3,4,5\\}$ and it seems that, given $G$ and $r$ , the fact that there exists a positive vector in $\\text{Ker}(M)$ does not depend on the exact values of the coefficients $m_{i,j}$ , but I do not know how to predict that such a vector exists. I have just noticed that given $G$ , the answer of the question can vary with $r$ . graph-theory matrices Share Cite Improve this question Follow edited Jun 24, 2020 at 16:25 asked Jun 20, 2020 at 10:45 G. Panel 511 3 3 silver badges 10 10 bronze badges $\\endgroup$ 1 $\\begingroup$ Sounds like a manifestation of (a weighted) Kastelyn's Theorem. $Det(M)$ is the square of the Pfaffian. However in some cases the latter is a sum of terms corresponding to matchings, involving the weights $m_{ij}$ and all contributing with the same sign. See, e.g., arxiv.org/abs/1409.4631 $\\endgroup$ Abdelmalek Abdesselam –  Abdelmalek Abdesselam 2020-06-22 13:49:40 +00:00 Commented Jun 22, 2020 at 13:49 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions graph-theory matrices See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 2 Positive semidefinite decomposition, Laplacian eigenvalues, and the oriented incidence matrix 10 LU factorization for $I+A$ (A skew-symmetric) 0 Reference request: Strong Connectivity and the Incidence Matrix 2 Norm of a the skew symmetric part of a unitary matrix 1 A \"positive diagonal plus skew-symmetric\" matrix decomposition 6 Determinant of walk matrix for a skew-symmetric matrix of even order 3 Slight skew in the distribution of eigenvalues for normal symmetric matrices $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363618, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "graph-theory,matrices,graph-theory,matrices",
  "scraped_at": "2026-01-14T04:17:36.682840",
  "answer": ""
}