{
  "id": "q_368986",
  "mathoverflow_id": 368986,
  "url": "https://mathoverflow.net/questions/368986/what-relationship-exists-between-samples-of-a-function-and-samples-of-its-vector",
  "title": "multivariable calculus - What relationship exists between samples of a function and samples of its vector gradient field?",
  "body": "A real function $f(x)$ is defined on $N$ -dimensional real space where $N \\ge 3$ . $f(x)$ is differentiable and its gradient with respect to x is $g(x)$ . So $g(x)$ is a vector field. Assume we do not know the closed form of $f(x)$ or $g(x)$ . Instead we only know the value of $f(x)$ (real numbers) on one set of data samples $x_0,x_1,\\ldots$ , and the value of $g(x)$ (real vectors) on a (possibly separate) set of data samples $x_0',x_1',\\ldots$ . Under what condition, is it possible to derive a relationship between the function samples $f(x_0), f(x_1), \\ldots$ and the gradient samples $g(x_0'), g(x_1'), \\ldots$ ? Intuitively, the relationship between a function and its gradient is governed by vector calculus results like Green's identities. But such results are only applicable when $f(x)$ and $g(x)$ are available in closed form. It is unclear how to apply it to the case of sampling. multivariable-calculus Share Cite Improve this question Follow edited Aug 12, 2020 at 18:08 asked Aug 12, 2020 at 18:02 hyu 19 2 2 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions multivariable-calculus See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 How to define a function that has these specific properties? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368986, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "multivariable-calculus,multivariable-calculus",
  "scraped_at": "2026-01-14T04:28:45.878367",
  "answer": ""
}