{
  "id": "q_363012",
  "mathoverflow_id": 363012,
  "url": "https://mathoverflow.net/questions/363012/on-a-conjecture-about-the-arithmetic-function-that-counts-the-number-of-twin-pri",
  "title": "nt.number theory - On a conjecture about the arithmetic function that counts the number of twin primes",
  "body": "This is cross-posted from the question that I've asked with same title on Mathematics Stack Exchange two months ago, which has remained unanswered. Given a positive real number $x$ we will write positive integer or real number $x$ ) as $$\\pi_2(x)=\\#\\{\\text{ primes }p\\leq x\\,:\\,p+2\\text{ is also a prime}\\}$$ the arithmetic function that counts the number of primes $p$ less than a given positive real $x$ satisfying that $p+2$ is also a prime. (Such primes are known as twin primes . It is an open problem if there are infinitely many twin primes. Inspired by the Second Hardy–Littlewood conjecture , a few experiments using Pari/GP scripts to state the following two conjectures. Conjecture 1. One has $$\\pi_2(x+y)\\leq \\pi_2(x)+\\pi_2(y)+1$$ for all integer $x\\geq 2$ and all integer $y\\geq 2$ . Conjecture 2. There exists an integer constant $K\\geq 2$ such that $$\\pi_2(x+y)\\leq \\pi_2(x)+\\pi_2(y)+1$$ holds, for all integer $x\\geq K$ and all integer $y\\geq K$ . Question. Are these known, or is it possible to prove or refute any of previous conjectures? Can you find counterexamples for the first conjecture or add heuristics to know what about the veracity of this kind of conjectures? I've tested the first conjecture for the segments of integers $2\\leq x,y\\leq 500$ . I've added the second conjecture since I don't know if it is possible to find easily a counterexample for Conjecture 1. Edit: Additionally/alternatively you can investigate what work can be done for/what about the veracity of the conjectures on assumption that the twin prime conjecture holds, or under assumption of other well-known conjectures. If this question is hard, I should to accept an answer that provide the more helpful discussion about what work can be done for our questions currently. See the contributions in comments of the users of the linked MSE post. References: [1] G. H. Hardy and J. E. Littlewood, Some Problems of 'Partitio Numerorum.' III. On the Expression of a Number as a Sum of Primes , Acta Math. (44), J. E. (1923) pp. 1–70. nt.number-theory analytic-number-theory prime-numbers prime-constellations prime-gaps Share Cite Improve this question Follow edited Jul 10, 2020 at 7:10 kodlu 10.6k 3 3 gold badges 37 37 silver badges 61 61 bronze badges asked Jun 14, 2020 at 6:12 user142929 1 $\\endgroup$ 8 5 $\\begingroup$ In the unlikely event that the Twin Prime Conjecture is false, then of course both conjectures here are true for sufficiently large $x,y$ since we'll have $\\pi_2(x+y)=\\pi_2(x)=\\pi_2(y)$. $\\endgroup$ Gerry Myerson –  Gerry Myerson 2020-06-14 06:18:50 +00:00 Commented Jun 14, 2020 at 6:18 $\\begingroup$ Many thanks for your clarification and help, then I'm going to delete the question in next minures @GerryMyerson $\\endgroup$ user142929 –  user142929 2020-06-14 06:20:14 +00:00 Commented Jun 14, 2020 at 6:20 3 $\\begingroup$ I'm glad you undeleted. My comment did not at all completely resolve your question. Please don't consider my comment as grounds for deleting your question. $\\endgroup$ Gerry Myerson –  Gerry Myerson 2020-06-16 13:23:09 +00:00 Commented Jun 16, 2020 at 13:23 9 $\\begingroup$ The most interesting thing to do is to study this conjecture under the condition of the first Hardy-Littlewood conjecture. One could try to show that conjecture 1 is false under that assumption by the same strategy as the second Hardy-Littlewood conjecture - i.e. by finding an admissible tuple which contains too many twin pairs. This should be more fruitful to perform a computer search on than looking at twin primes directly. $\\endgroup$ Will Sawin –  Will Sawin 2020-06-17 17:02:01 +00:00 Commented Jun 17, 2020 at 17:02 1 $\\begingroup$ Many thanks @WillSawin for your attention and help, also thanks again for previous professor in comments. I'm not a professional mathematician but I understand many of the details of the answers that provide the professors here for my questions, thus feel free to add your thoughts as an answer since these are according the Question and my previous Edit (that one can to invoke conjectures, heuristics or other reasonings to provide an answer). $\\endgroup$ user142929 –  user142929 2020-06-17 17:05:01 +00:00 Commented Jun 17, 2020 at 17:05  |  Show 3 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions nt.number-theory analytic-number-theory prime-numbers prime-constellations prime-gaps See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 23 Where does the \"Hardy-Littlewood\" conjecture that $\\pi(x+y) \\leq \\pi(x) + \\pi(y)$ originate? 4 Calculating the infinite product from the Hardy-Littlewood Conjecture F 3 Whence the k-tuple conjecture? 2 On $\\sum_{\\substack{p\\leq x\\\\p,p+2\\text{ twin primes}}}\\frac{(\\log p)^m}{p}$, on assumption of the first Hardy–Littlewood conjecture 1 A question about a sum that involves gaps between twin primes, on assumption of the First Hardy–Littlewood conjecture 3 On conjectures about the arithmetic function that counts the number of Sophie Germain primes 0 Prime gap conjecture $ \\pi_{2a}(n+(6a+4)^3)+(6a+4)^3 > \\pi_{4a}(n)$ counterexamples? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363012, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "nt.number-theory,analytic-number-theory,prime-numbers,prime-constellations,prime-gaps,nt.number-theory,analytic-number-theory,prime-numbers,prime-constellations,prime-gaps",
  "scraped_at": "2026-01-14T04:24:47.925899",
  "answer": ""
}