{
  "id": "q_368352",
  "mathoverflow_id": 368352,
  "url": "https://mathoverflow.net/questions/368352/properties-of-differentiable-functions-on-non-locally-bounded-fields",
  "title": "reference request - Properties of differentiable functions on non-locally-bounded fields",
  "body": "I was reading some results on the structure of non-locally-bounded topological fields, and I was wondering what is known about differentiable functions on them. In particular, on the complex numbers with the usual topology, differentiable functions are infinitely differentiable. Is the same thing (or something similar) true of functions on fields with weird topologies? reference-request topological-rings Share Cite Improve this question Follow asked Aug 5, 2020 at 2:39 dog_mu 111 1 1 bronze badge $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request topological-rings See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 17 Measure theory treatment geared toward the Riesz representation theorem 125 Topology and the 2016 Nobel Prize in Physics 12 What was Burroni's sketch for topological spaces? 4 Convergence (topology) for $\\sigma$-finite measures 9 Questions on the group $\\mathrm{GL}(H)$ 8 The state of the art on topological rings - the Jacobson topology $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368352, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,topological-rings,reference-request,topological-rings",
  "scraped_at": "2026-01-14T04:27:15.406279",
  "answer": ""
}