{
  "id": "q_366372",
  "mathoverflow_id": 366372,
  "url": "https://mathoverflow.net/questions/366372/subgraph-induced-by-negative-cycles-detected-by-bellman-ford-algorithm",
  "title": "graph theory - Subgraph induced by negative cycles detected by Bellman-Ford algorithm",
  "body": "What is known about the properties of the subgraph induced by the negative cycles are defined by the predecessor relation that is established during the execution of the Bellman-Ford algorithm and arcs $(u,v)$ satisfying $\\mathrm{dist}(u)+\\omega(u,v)\\lt\\mathrm{dist}(v)$ after its execution? Assuming that the negative cycles are vertex-disjoint, is it true that re-running the Bellman-Ford algorithm after the weights of negative-cycle arcs have been multiplied by $-1$ , no negative cycles will be found in that 2nd execution? graph-theory algorithms Share Cite Improve this question Follow asked Jul 23, 2020 at 12:52 Manfred Weis 14k 4 4 gold badges 40 40 silver badges 82 82 bronze badges $\\endgroup$ 4 $\\begingroup$ Manfred, I do not quite understand how the multiplication by -1 comes in? Why does this multiplication take place? $\\endgroup$ Mary Sp. –  Mary Sp. 2020-07-24 15:23:43 +00:00 Commented Jul 24, 2020 at 15:23 $\\begingroup$ @MaryS. it is because the negative edges resemble edges in the non-optimal matching $M$, whose direction has been inverted and their weight multiplied by $-1$. After having detected a negative cycle, we exchange edges in $M$ corresponding to the negative edges on that cycle with the positive ones on that cycle, reducing $|M|$. For the next iteration we must undo the inversion of direction and negation of weights for edges removed from $M$ and do it for the added ones and, and the reason for multiplying with $-1$ is that do ing it twice amounts to undo ing it. $\\endgroup$ Manfred Weis –  Manfred Weis 2020-07-25 07:47:48 +00:00 Commented Jul 25, 2020 at 7:47 $\\begingroup$ Let me think about it! When you say \"the negative edges resemble edges in the non-optimal matching\": what does the word \"resemble\" mean here? $\\endgroup$ Mary Sp. –  Mary Sp. 2020-07-26 14:57:11 +00:00 Commented Jul 26, 2020 at 14:57 $\\begingroup$ I should have said negative arcs, because the shortest path problem instance that is generated from the original graph and a matching, consists of directed arcs , whereas the edges in the original graph are undirected. $\\endgroup$ Manfred Weis –  Manfred Weis 2020-07-26 15:18:57 +00:00 Commented Jul 26, 2020 at 15:18 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions graph-theory algorithms See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 3 Bellman-Ford for Matching Problems? 2 Detecting Negative Cycles in Undirected Graphs 0 Undirected Negative Cost Cycle Detection - Can Bellman-Ford Fail? 3 Is it possible to improve the weight of perfect bipartite matchings faster than with Bellman-Ford? 2 What do shortest-path algorithms actually calculate? 1 Acyclic partition of edges in tournaments $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366372, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "graph-theory,algorithms,graph-theory,algorithms",
  "scraped_at": "2026-01-14T04:24:11.853899",
  "answer": ""
}