{
  "id": "q_364038",
  "mathoverflow_id": 364038,
  "url": "https://mathoverflow.net/questions/364038/constructive-factorisation-of-null-homology-map-through-acyclic-complex",
  "title": "at.algebraic topology - Constructive factorisation of null-homology map through acyclic complex",
  "body": "Let $f: C \\rightarrow D$ be a maps of chain complexes on an idempotent complete additive category with all kernel or cokernel (or chain complexes on abelian category). If $f$ induces a null map in homology. By using the derivaded category, there exist a zig-zag $$\\require{AMScd} \\begin{CD} X' @>f'>>W @> >> Y' \\\\ @V \\sim V V && @AA \\sim A \\\\ X @>>f>Y @= Y \\end{CD}$$ where $W$ is acyclic and $X' \\rightarrow X$ and $Y \\rightarrow Y'$ are quasi-isomomorphisms. So here is my question : Is there a way to construct explicitly $X'$ , $W$ and $Y'$ by using only $X$ , $Y$ , the boundaries and cycles of these complexes ? at.algebraic-topology ac.commutative-algebra homological-algebra Share Cite Improve this question Follow asked Jun 24, 2020 at 15:48 MoreauT 69 3 3 bronze badges $\\endgroup$ 4 2 $\\begingroup$ Are you sure that a map that's zero on homology factors through the zero complex (up to homotopy)? Unless I'm mistaken this is equivalent to Freyd's generating hypothesis for your derived category and that's true only under regularity assumptions . $\\endgroup$ Denis Nardin –  Denis Nardin 2020-06-24 16:05:45 +00:00 Commented Jun 24, 2020 at 16:05 3 $\\begingroup$ As @Denis says, it's not true, even for complexes of abelian groups. If it were true then $f$ would be zero in the derived category, but there are usually plenty of nonzero maps in a derived category that induce the null map on homology. $\\endgroup$ Jeremy Rickard –  Jeremy Rickard 2020-06-24 16:35:58 +00:00 Commented Jun 24, 2020 at 16:35 $\\begingroup$ I think you're right. Is it the same for endomorphism (ie. X=Y ) ? $\\endgroup$ MoreauT –  MoreauT 2020-06-24 16:48:29 +00:00 Commented Jun 24, 2020 at 16:48 3 $\\begingroup$ @MoreauT Yup, e.g. for $\\mathbb Z/2 \\oplus \\mathbb Z/2 [1]$ and the map induced by the extension $\\mathbb Z/2 \\to \\mathbb Z/2[1]$ $\\endgroup$ Phil Tosteson –  Phil Tosteson 2020-06-24 18:00:39 +00:00 Commented Jun 24, 2020 at 18:00 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions at.algebraic-topology ac.commutative-algebra homological-algebra See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 5 How do I split a homotopy idempotent? 17 Is such a map null-homotopic? 6 Derivators - diagrams in homotopy category of chain complexes 5 Strøm model structure on nonnegatively graded chain complexes 4 A similar construction to Ext, can we describe it better and does it have any use? 5 Homology of singular chain complex modulo subdivision 3 Left exact functor $F$ preserves quasi-isomorphism between $F$-acyclics $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364038, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "at.algebraic-topology,ac.commutative-algebra,homological-algebra,at.algebraic-topology,ac.commutative-algebra,homological-algebra",
  "scraped_at": "2026-01-14T04:18:19.975679",
  "answer": ""
}