{
  "id": "q_365300",
  "mathoverflow_id": 365300,
  "url": "https://mathoverflow.net/questions/365300/is-there-a-notion-of-symplectic-maps-between-spaces-of-volume-forms-on-phase-spa",
  "title": "dg.differential geometry - Is there a notion of symplectic maps between spaces of volume forms on phase spaces?",
  "body": "For a $n$ dimensional smooth manifold $M$ , I consider the cotangent bundle $T^*M$ with the canonical symplectic form $\\omega$ . A symplectic map $\\phi : T^*M \\to T^* M$ is a map which leaves the symplectic form invariant, i.e. $\\phi^* \\omega = \\omega$ . Question: Is there a notion of symplectic maps between the spaces of volume forms over the phase space $T^*M$ ? edit: In more detail: Let me denote the space of all volume forms over $T^*M$ as $\\Omega^{2n}(T^*M) := \\Gamma( \\Lambda^{2n} (T^*M) )$ (the notation is from John M. Lee's book 'Intro to smooth manifolds'.) Then for a map $\\psi$ which transforms volume forms, i.e. $$\\psi : \\mathrm{\\Omega}^{2n}(T^*M) \\to \\mathrm{\\Omega}^{2n}(T^*M),$$ I am looking for a condition which ensures that $\\psi$ is compatible with the symplectic structure of $T^*M$ ? Example: A symplectic map $\\phi : T^* M \\to T^*M$ implies a map $$\\psi : \\mathrm{\\Omega}^{2n}(T^*M) \\to \\mathrm{\\Omega}^{2n}(T^*M) : \\eta \\mapsto \\phi^* \\eta.$$ Such a map should be compatible for example. But I would expect that there are more maps which are compatible and that not all of them are derived from symplectic maps like in the example. Background: For numerical simulation of Hamiltonian equations, it is good to use symplectic integrators, such as symplectic Euler. However, I am interested in solving Liouville's equations and this raised the question what a corresponding symplectic integrator would be in that case? dg.differential-geometry sg.symplectic-geometry hamiltonian-mechanics Share Cite Improve this question Follow edited Jul 10, 2020 at 12:01 asked Jul 10, 2020 at 10:43 Steffen Plunder 51 8 8 bronze badges $\\endgroup$ 11 2 $\\begingroup$ I suppose you mean by $\\Omega^n(T^*M)$ the $n$-th antisymmetric tensor power of $T^*M$. This is a vector bundle of fiber dimension one over $M$. So the total space has dimension $n+1$. This makes it very unlikely to be symplectic (in ca half of all cases) $\\endgroup$ Stefan Waldmann –  Stefan Waldmann 2020-07-10 10:57:48 +00:00 Commented Jul 10, 2020 at 10:57 1 $\\begingroup$ But $\\Omega^{2n}(T^*M)$ is the space of volume forms on $T^*M$. $\\endgroup$ Ben McKay –  Ben McKay 2020-07-10 11:31:50 +00:00 Commented Jul 10, 2020 at 11:31 1 $\\begingroup$ Is $\\psi$ a vector bundle automorphism of the volume form bundle on $T^*M$? Or is it a map on sections of that bundle? $\\endgroup$ Ben McKay –  Ben McKay 2020-07-10 11:34:25 +00:00 Commented Jul 10, 2020 at 11:34 1 $\\begingroup$ A couple of questions for clarification: First, is it important that the underlying symplectic manifold is the total space of a cotangent bundle? I can't see why you question requires this. Second, since a symplectomorphism preserves the volume form, its induced action on $\\Omega^{2n}$ is the identity. So what does it mean for a self-map on $\\Omega^{2n}$ to be compatible with the symplectic structure? Perhaps I've missed something. $\\endgroup$ Paul Reynolds –  Paul Reynolds 2020-07-10 12:32:30 +00:00 Commented Jul 10, 2020 at 12:32 1 $\\begingroup$ You're correct though, my assertion that a symplectomorphism preserves all volume forms is not right. Perhaps you are interested in the diffeomorphisms that preserve $\\omega^n$, with no further conditions, of which there are many. $\\endgroup$ Paul Reynolds –  Paul Reynolds 2020-07-10 14:24:57 +00:00 Commented Jul 10, 2020 at 14:24  |  Show 6 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions dg.differential-geometry sg.symplectic-geometry hamiltonian-mechanics See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 21 Functoriality of the cotangent bundle 0 Polarisation in a neighbourhood of a Lagrangian submanifold 1 The space of generalized complex structures in sense of N.Hitchin is contractible? 5 Kernel of flux homomorphism (Calabi invariant) for volume-preserving maps on a compact manifold 24 Why are Lagrangian submanifolds called Lagrangian? 2 Extensions to symplectomorphisms 30 Why is there no symplectic version of spectral geometry? 6 A generalization of Gradient vector fields and Curl of vector fields 6 Explicit local normal form symplectomorphism at torus fixed point of a coadjoint orbit $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365300, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "dg.differential-geometry,sg.symplectic-geometry,hamiltonian-mechanics,dg.differential-geometry,sg.symplectic-geometry,hamiltonian-mechanics",
  "scraped_at": "2026-01-14T04:22:04.569576",
  "answer": ""
}