{
  "id": "q_368288",
  "mathoverflow_id": 368288,
  "url": "https://mathoverflow.net/questions/368288/is-the-vietoris-topology-on-compact-subsets-of-mathbb-rn-locally-convex",
  "title": "topological vector spaces - Is the Vietoris topology on compact subsets of $\\mathbb R^n$ locally convex?",
  "body": "The title question says it all really. If the question is negative for compact subsets of $\\mathbb R^n$ , is it affirmative for compact and convex subsets of $\\mathbb R^n$ ? How about for all nonempty subsets of $\\mathbb R^n$ ? If the answer is affirmative, does the result also hold for all locally convex topological vector spaces? gn.general-topology topological-vector-spaces locally-convex-spaces set-valued-analysis Share Cite Improve this question Follow asked Aug 4, 2020 at 9:00 aduh 949 6 6 silver badges 17 17 bronze badges $\\endgroup$ 4 2 $\\begingroup$ Let me know if i misunderstood the question. Take a V shape $K$ on the plane, and engulf it with a thin open set $U$. The set $V=\\{L\\subset U\\}$ is open in the Vietoris topology. Assume that $K\\in W\\subset V$ is convex. But then $(K+K)/2\\in W$. However, $(K+K)/2$ contains the middle between the ends of the V, and so $(K+K)/2$ is not even included in $U$. $\\endgroup$ erz –  erz 2020-08-04 11:44:38 +00:00 Commented Aug 4, 2020 at 11:44 3 $\\begingroup$ I've encountered local convexity only as a property of topological vector spaces. Since the space of compact subsets of $\\mathbb R^n$ isn't naturally a vector space, it's not clear to me what the question means. The comment by @bof uses a reasonable-looking interpretation of \"locally convex\" for this situation, but maybe some other interpretation was intended. $\\endgroup$ Andreas Blass –  Andreas Blass 2020-08-04 12:42:05 +00:00 Commented Aug 4, 2020 at 12:42 4 $\\begingroup$ The hyperspace of compact convex sets indeed has a convexity structure as we can take Minkowski convex combinations $tA+(1-t)B=\\{ta+(1-t)b:a\\in A, b\\in B\\}$ of compact convex sets. So, for the hyperspace of compact convex sets there is sense to speak about the local convexity. It suffices to check that the balls in Hausdorff metric around compact convex sets are convex in the sense of the Minkowski operation (which should be true). $\\endgroup$ Taras Banakh –  Taras Banakh 2020-08-04 14:43:09 +00:00 Commented Aug 4, 2020 at 14:43 $\\begingroup$ I had in mind using Minkowski sums, as Taras Banakh suggested. I don't know why I didn't realize it when I was writing the question, but I guess the subsets should be compact and convex. $\\endgroup$ aduh –  aduh 2020-08-04 22:02:35 +00:00 Commented Aug 4, 2020 at 22:02 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions gn.general-topology topological-vector-spaces locally-convex-spaces set-valued-analysis See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 5 Is every Montel locally convex vector space compactly generated? 7 Closed convex bounded sets are weakly compact for which spaces? 5 Is each locally compact group topology on the permutation group discrete? 5 Is the filtered colimit topology on the space of signed Radon measures linear and locally convex? 7 What locally convex manifolds have $\\Delta$-generated topology? 4 Criteria for the completion of an ultrabornological locally convex vector space to remain (ultra)bornological $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368288, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "gn.general-topology,topological-vector-spaces,locally-convex-spaces,set-valued-analysis,gn.general-topology,topological-vector-spaces,locally-convex-spaces,set-valued-analysis",
  "scraped_at": "2026-01-14T04:27:01.888063",
  "answer": ""
}