{
  "id": "q_363799",
  "mathoverflow_id": 363799,
  "url": "https://mathoverflow.net/questions/363799/on-sum-substack1-leq-d-leq-x-d-r-1-frac-muddw-fracxd-wit",
  "title": "nt.number theory - On $\\sum_{\\substack{1\\leq d\\leq x\\\\(d,r)=1}}\\frac{\\mu(d)}{d}W(\\frac{x}{d})$, with $\\mu(n)$ the M&#246;bius function and $W(x)$ the Lambert $W$ function",
  "body": "I wondered if it is possible to posed a similar question than Question 2 by Olivier Ramaré from [1] (page 231), although the computational evidence that I have for my conjecture is very small. Conjecture. For all $x\\geq 1$ and for all integers $r\\geq 1$ one has that $$0\\leq \\sum_{\\substack{1\\leq d\\leq x\\\\(d,r)=1}}\\frac{\\mu(d)}{d}W(\\frac{x}{d})\\tag{1}$$ where here $\\mu(n)$ denotes the Möbius function and $W(z)$ denotes the main branch of the Lambert $W$ function. As reference I know that Wikipedia has the articles with titles Möbius function and Lambert $W$ function . Question. I would like to know if you can find a counterexample* (an integer) $x$ and its corresponding $r$ , or show what work can be done about the veracity of previous conjecture. Many thanks. *If you are able to find a counterexample easily please try to state/prove an inequality with good mathematical content of the type $C\\leq \\sum_{\\substack{1\\leq d\\leq x\\\\(d,r)=1}}\\frac{\\mu(d)}{d}W(\\frac{x}{d})$ , being this your inequality true for a suitable constant $C$ and $\\forall x\\geq 1$ and $\\forall r\\geq 1$ . If my problem/question is very difficult, after there are some contributions I should consider accepting an available answer. References: [1] Olivier Ramaré, Some elementary explicit bounds for two mollifications of the Moebius function , Funct. Approx. Comment. Math. Volume 49, Number 2 (2013), pp 229-240. nt.number-theory analytic-number-theory asymptotics Share Cite Improve this question Follow asked Jun 22, 2020 at 9:33 user142929 1 $\\endgroup$ 2 $\\begingroup$ I know the reference [1] from Project Euclid . I hope that my Question is clear, interesting and at research level, please feel free to add your feedback in comments. On the other hand as was said my computational evidence is very small, thus please if you can to get easily a counterexample I am looking for an answer for the asterisk question in penultimate paragraph as an alternative question , with the purpose that the post is more interesting. $\\endgroup$ user142929 –  user142929 2020-06-22 09:39:58 +00:00 Commented Jun 22, 2020 at 9:39 $\\begingroup$ I think that my problem is interesting as a comparison to Ramaré's Question 2 that I refer from the first paragraph in page 231 of [1], since the main/principal branch of the Lambert $W$ function is an important function with an asymptotic behaviour related to the logarithm, see the section Asymptotic expansions from the linked article dedicated to the function Lambert $W$. Also are arising, in recent years, articles from the literature about analytic number theory and some branchs of the Lambert $W$. $\\endgroup$ user142929 –  user142929 2020-06-22 15:11:02 +00:00 Commented Jun 22, 2020 at 15:11 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions nt.number-theory analytic-number-theory asymptotics See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 Estimation of a sum involving Moebius function 2 On $\\sum_{\\substack{p\\leq x\\\\p,p+2\\text{ twin primes}}}\\frac{(\\log p)^m}{p}$, on assumption of the first Hardy–Littlewood conjecture 1 On $(\\prod_{\\substack{1\\leq s\\leq X\\\\s\\text{ semiprime}}}s)(\\sum_{\\substack{1\\leq s\\leq X\\\\s\\text{ semiprime}}}\\frac{1}{s})$ as $X\\to\\infty$ 2 Showing that $\\lim_{Q\\to\\infty}\\lim_{N\\to\\infty}\\frac{1}{N\\pi(Q)}\\sum_{n<N}\\left|\\sum_{\\substack{p<Q\\\\p|n}}p-\\sum_{p<Q}1\\right|=0$ 3 On conjectures about the arithmetic function that counts the number of Sophie Germain primes $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363799, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "nt.number-theory,analytic-number-theory,asymptotics,nt.number-theory,analytic-number-theory,asymptotics",
  "scraped_at": "2026-01-14T04:17:52.742763",
  "answer": ""
}