{
  "id": "q_366545",
  "mathoverflow_id": 366545,
  "url": "https://mathoverflow.net/questions/366545/dislocations-and-random-matrix-theory",
  "title": "reference request - Dislocations and Random Matrix Theory",
  "body": "Does anyone have a good reference book that works as a good starting point for an analyst to learn about the connection between Random Matrix Theory and Dislocations ? Thank you for your help. By dislocations , I mean those that are present in materials as defects in their crystalline structure. More specifically, dislocations that form grain boundaries. A more precise question would be, is there literature outlining the way to describe dislocation distributions via random matrix theory? reference-request pr.probability ap.analysis-of-pdes calculus-of-variations textbook-recommendation Share Cite Improve this question Follow edited Jul 26, 2020 at 11:02 asked Jul 25, 2020 at 14:37 spaceman 605 3 3 silver badges 15 15 bronze badges $\\endgroup$ 4 $\\begingroup$ What type of \"dislocations\" are you interested in? Vortices in superdconductors (as in arxiv.org/abs/1603.06287 )? Singularities of complex wave fields (as in core.ac.uk/download/pdf/30807.pdf ). You really want to be more specific for a helpful answer. $\\endgroup$ Carlo Beenakker –  Carlo Beenakker 2020-07-25 16:11:53 +00:00 Commented Jul 25, 2020 at 16:11 $\\begingroup$ Hi @CarloBeenakker, thank you for that remark. Yes, that makes sense. By dislocations, I mean those that form grain boundaries in materials. $\\endgroup$ spaceman –  spaceman 2020-07-26 10:59:06 +00:00 Commented Jul 26, 2020 at 10:59 $\\begingroup$ thank you for the clarification; I am not aware of any application of that type; typical applications to RMT involve some sort of repulsion between the defects, which are then modeled by eigenvalue repulsion; I don't think that grain boundaries \"repel\" in any obvious way, because they are frozen and lack dynamics; perhaps you can inform us where the idea comes from, that RMT might be applicable to grain boundaries? $\\endgroup$ Carlo Beenakker –  Carlo Beenakker 2020-07-26 11:40:18 +00:00 Commented Jul 26, 2020 at 11:40 $\\begingroup$ Not sure if RMT is applicable, but here's a work related spectral graph theory to grain boundary modeling: Johnson, Oliver K., Jarrod M. Lund, and Tyler R. Critchfield. \"Spectral graph theory for characterization and homogenization of grain boundary networks.\" Acta Materialia 146 (2018): 42-54. $\\endgroup$ Piyush Grover –  Piyush Grover 2020-07-26 20:25:00 +00:00 Commented Jul 26, 2020 at 20:25 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request pr.probability ap.analysis-of-pdes calculus-of-variations textbook-recommendation See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 13 Why only three classical matrix ensembles in random matrix theory? 7 Generalising Gelfand's spectral theory 4 Characterizations of the GOE/GUE family of distributions 2 Minimal Support Solutions of a Linear System (Dissertation) 3 Probability of one species reaching zero before the other in a Markov process on a 2d lattice 9 Is there a determinantal point process proof of the Keating-Snaith formula for the cumulants of the log characteristic polynomial of a random matrix? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366545, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,pr.probability,ap.analysis-of-pdes,calculus-of-variations,textbook-recommendation,reference-request,pr.probability,ap.analysis-of-pdes,calculus-of-variations,textbook-recommendation",
  "scraped_at": "2026-01-14T04:24:27.604609",
  "answer": ""
}