{
  "id": "q_364448",
  "mathoverflow_id": 364448,
  "url": "https://mathoverflow.net/questions/364448/the-space-of-rearrangements-of-a-plane-curve",
  "title": "dg.differential geometry - The space of rearrangements of a plane curve",
  "body": "I learned of the paper \"Closing curves by rearranging arcs\" by L. Alese ( arXiv link ) by a post on Reddit and was curious about related questions and generalizations. Here a rearrangement of a curve is where you cut the curve into finitely many arcs and then through rigid plane motions glue the arcs back together so that the tangents at the endpoints match. What does the space of all rearrangements of a curve look like? For straight line segments and circles you get nothing: the curve is the same no matter how you cut and rearrange pieces. For curves with non-constant curvature the possibilities increase. The paper above answers the question \"Does the rearrangement space contain a closed curve?\" My guess is the space is determined by the curvature measure along the curve. This is a signed measure whose integral gives the turning number along the curve; it is possibly singular if there are any sharp turns. It seems like the \"boundary\" or \"completion\" of the rearrangement space is determined by the total variation of the curvature measure in some sense, I'm not sure how to make this precise. Added on: Say you have a finite signed curvature measure $\\kappa$ , defined on the Borel sets of $I=[0,1]$ . The corresponding angle function is $\\theta(t)=\\kappa([0,t])$ and the corresponding curve is $$x(t)=\\int_0^t\\cos(\\theta(s))ds$$ $$y(t)=\\int_0^t\\sin(\\theta(s))ds.$$ A rearrangement of $\\kappa$ is determined by a partition of $I$ into sub intervals $I_1=(0,t_1],I_2=(t_1,t_2],\\ldots,I_k=(t_{k-1},1]$ together with a permutation $\\sigma$ of $\\{1,\\ldots,k\\}$ . This gives a map $P:I\\to I$ defined by rearranging the $I_j$ according to $\\sigma$ and then stacking them back over the interval $I$ , together with saying $P(0)=0$ . For example, with the partition $I_1=(0,\\frac{3}{4}], I_2=(\\frac{3}{4},1]$ and the (cycle notation) permutation $(1 2)$ : $$P(t)=\\begin{cases}t+\\frac{3}{4}, \\text{ if } 0<t\\leq\\frac{1}{4}\\\\t-\\frac{1}{4}, \\text{ if } \\frac{1}{4}<t\\leq 1\\\\ 0, \\text{ if } t=0\\end{cases}.$$ The rearranged curvature measure is defined by $$\\tilde\\kappa(A)=\\kappa(P(A)),$$ and the space of all rearrangements is given by applying this construction over all partitions and all permutations. Starting from a given $\\kappa$ , what does the space of rearrangements look like? dg.differential-geometry curves-and-surfaces Share Cite Improve this question Follow edited Jun 30, 2020 at 6:26 asked Jun 29, 2020 at 19:21 Jess Boling 646 3 3 silver badges 10 10 bronze badges $\\endgroup$ 2 $\\begingroup$ Perhaps it can be useful to link with a question by (supposedly) L. Alese mathoverflow.net/questions/363495/… $\\endgroup$ erz –  erz 2020-06-30 04:54:22 +00:00 Commented Jun 30, 2020 at 4:54 $\\begingroup$ That's exactly the content I saw in the Reddit post. $\\endgroup$ Jess Boling –  Jess Boling 2020-06-30 05:14:56 +00:00 Commented Jun 30, 2020 at 5:14 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions dg.differential-geometry curves-and-surfaces See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 26 Surprising properties of closed planar curves Related 17 Computing the Chern-Simons invariant of $SO(3)$ 4 How many curves can fit on a sphere without intersecting? 2 What's the relationship between the Riemannian metric and Jacobi field? 10 Relating curvature and torsion of a connection to those of a curve 3 Existence and Properties of 3D Curves with unusual 2D $(\\kappa(s),\\tau(s))$ Trajectories 12 A necessary and sufficient condition for a space curve to lie on a ellipsoid 8 Obstructions for the wedge of coordinate differentials to be harmonic 6 Necessary and sufficient curvature condition for a regular planar curve to be simple and closed $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364448, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "dg.differential-geometry,curves-and-surfaces,dg.differential-geometry,curves-and-surfaces",
  "scraped_at": "2026-01-14T04:19:44.352381",
  "answer": ""
}