{
  "id": "q_368687",
  "mathoverflow_id": 368687,
  "url": "https://mathoverflow.net/questions/368687/distributive-lattices-with-periodic-coxeter-matrix",
  "title": "co.combinatorics - Distributive lattices with periodic Coxeter matrix",
  "body": "Let $L$ be a finite distributive lattice and $U$ its incidence matrix with entries $u_{i,j}=1$ iff $i \\leq j$ and $u_{i,j}=0$ else. Then $U^{-1}$ is the Moebius matrix of $L$ and $C_L:=- U^{-1} U^{T}$ is the Coxeter matrix of $L$ . Question: For which $L$ is the Coxeter matrix periodic, that is $C_L^n$ is the identity matrix for some $n$ ? Call such a lattice (or its incidence algebra) periodic. For example any divisor lattice (products of chains) is periodic. For distributive lattices on $r \\geq 2$ points, the number of periodic distributive lattices starts with 1,1,2,3,5,7,11,8,15 for $r \\leq 10$ and oeis finds this : https://oeis.org/A053724 . Question: Is this still true for $r=11$ ? Algebras with periodic coxeter matrix are studied in representation theory of quivers, see for example https://www.sciencedirect.com/science/article/pii/S0024379505001709 and several other articles. One might also ask what the period is for a given lattice. For example for the Boolean lattice of $n$ points it is 3 if n is odd and 6 if n is even. Recall that the free distributive lattice is the lattice of order ideals of the Boolean lattice. Question: For which $n$ is the free distributive lattice on $n$ points periodic and what is the period in case it is? It is periodic with period 4 for $n=1$ , period 10 for $n=2$ and with period 6 for $n=3$ and with period 42 for $n=4$ . Some tests suggest that the lattice of order ideals of a divisor lattice is also periodic. co.combinatorics linear-algebra lattice-theory Share Cite Improve this question Follow edited Aug 9, 2020 at 20:37 asked Aug 9, 2020 at 8:47 Mare 28.3k 7 7 gold badges 26 26 silver badges 117 117 bronze badges $\\endgroup$ 8 1 $\\begingroup$ If these two sequences were equal it would be really strange... $\\endgroup$ Gjergji Zaimi –  Gjergji Zaimi 2020-08-09 18:11:15 +00:00 Commented Aug 9, 2020 at 18:11 $\\begingroup$ @GjergjiZaimi Yes, probably one or two more cases might be enough to rule it out. But sadly I can not generate all distributive lattices with $r=11$ points with SAGE anymore, since SAGE filters those out of all posets which is too big. $\\endgroup$ Mare –  Mare 2020-08-09 18:44:12 +00:00 Commented Aug 9, 2020 at 18:44 $\\begingroup$ Is there a particular significance (e.g. in algebra) to the Coxeter matrix being periodic? $\\endgroup$ Sam Hopkins –  Sam Hopkins ♦ 2020-08-09 19:36:59 +00:00 Commented Aug 9, 2020 at 19:36 1 $\\begingroup$ @SamHopkins I added a reference. $\\endgroup$ Mare –  Mare 2020-08-09 19:38:37 +00:00 Commented Aug 9, 2020 at 19:38 1 $\\begingroup$ Apparently, the sequence begins with $1,1,2,3,5,7,11,8,15,19$, which is not in the OEIS. (I checked periodicity with an upper bound of 1000). $\\endgroup$ Martin Rubey –  Martin Rubey 2020-08-10 13:32:51 +00:00 Commented Aug 10, 2020 at 13:32  |  Show 3 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions co.combinatorics linear-algebra lattice-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 1 Finite fast tests for periodicity of certain matrices Related 5 Product-decomposition of distributive lattices 18 What are the periodic Dyck paths? 13 Permanent of the Coxeter matrix of a distributive lattice 4 Upper bound for an expression for distributive lattices 7 Fixed points for finitary distributive lattices bijection 4 The poset of intervals of the free distributive lattice $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368687, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "co.combinatorics,linear-algebra,lattice-theory,co.combinatorics,linear-algebra,lattice-theory",
  "scraped_at": "2026-01-14T04:28:07.443542",
  "answer": ""
}