{
  "id": "q_369052",
  "mathoverflow_id": 369052,
  "url": "https://mathoverflow.net/questions/369052/on-sums-of-powers-ii",
  "title": "nt.number theory - On Sums of powers II",
  "body": "In my previous question, I asked about nontrivial sums of four powers $a^m+b^n+c^k=d^l$ , and whether the nature of the solutions depend on whether $\\frac{1}{m}+\\frac{1}{n}+\\frac{1}{k}+\\frac{1}{l}$ is bigger, smaller, or equal to 1. This heuristic (based on the Fermat Catalan conjecture, an analogous conjecture on three powers), was shown to have some rather glaring holes, with values of the reciprocal sum being arbitrarily close to 1/2 while still containing solutions. Therefore I propose a new question to repair the hole. My new question is: Is it hard to find nontrivial integer coprime solutions to $\\pm a^m\\pm b^n\\pm c^k=d^{lcm(m,l,k)}$ when $\\frac{1}{m}+\\frac{1}{n}+\\frac{1}{k}+\\frac{1}{lcm(m,l,k)}\\le1$ ? Are there $m,n,k$ for which it is known there are no solutions? Also, I would like to see parametric solutions for the cases where we do know solutions. nt.number-theory algebraic-curves diophantine-equations Share Cite Improve this question Follow edited Aug 14, 2020 at 0:06 asked Aug 13, 2020 at 12:18 Thomas 2,871 17 17 silver badges 31 31 bronze badges $\\endgroup$ 4 $\\begingroup$ This is one case where Roman numerals work better in a title. Gerhard \"Reads 'Powers Of Two' Instead\" Paseman, 2020.08.13. $\\endgroup$ Gerhard Paseman –  Gerhard Paseman 2020-08-13 14:33:03 +00:00 Commented Aug 13, 2020 at 14:33 $\\begingroup$ Fair enough. I've changed it. The point of this question is to avoid the cases that caused an issue last time. $\\endgroup$ Thomas –  Thomas 2020-08-14 00:09:15 +00:00 Commented Aug 14, 2020 at 0:09 $\\begingroup$ Setting $n=3$ in Will's example with exponents $(4,n+3,3n+3,4)$ gives a parametric solution for $(m,n,k)=(4,4,6)$ in the venue of the current question. $\\endgroup$ Max Alekseyev –  Max Alekseyev 2020-08-14 01:57:01 +00:00 Commented Aug 14, 2020 at 1:57 $\\begingroup$ Let $L:=\\mathrm{lcm}(m,n,)$. Then there is always a series of solutions: $$(u^n)^m-(u^m)^n + (v^{L/k})^k = v^L$$ parameterized by integer $u,v$. So, it seems that the question lacks some important restriction. $\\endgroup$ Max Alekseyev –  Max Alekseyev 2020-08-20 17:09:22 +00:00 Commented Aug 20, 2020 at 17:09 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions nt.number-theory algebraic-curves diophantine-equations See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 4 On sums of powers Related 15 Fermat's Bachet-Mordell Equation 1 Rational points on $ \\frac{ x^k-y^k }{ x-y } - (x-y)^{k-2} = 0 $ , $k>3$, genus 0 4 Heuristic for the Fermat-Catalan conjecture 7 Integer solutions of x^n + y^n = z^{n-1} 55 When has the Borel-Cantelli heuristic been wrong? 3 A question regarding Goormaghtigh conjecture 4 On sums of powers 3 The Fermat-Catalan conjecture with signature $(2,n,4)$, $n\\ge4$ $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 369052, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "nt.number-theory,algebraic-curves,diophantine-equations,nt.number-theory,algebraic-curves,diophantine-equations",
  "scraped_at": "2026-01-14T04:28:57.150431",
  "answer": ""
}