{
  "id": "q_366781",
  "mathoverflow_id": 366781,
  "url": "https://mathoverflow.net/questions/366781/measurability-of-infimum-function",
  "title": "measure theory - Measurability of infimum function",
  "body": "In Theorem 14.37 of Variational Analysis by Rockafellar and Wets, it shows that for any normal integrand $f:T\\times \\mathbb{R}\\to\\mathbb{R}$ , the function $p:T\\to \\mathbb{R}$ given by $p(t):=\\inf f(t,⋅)$ is measurable. I am struggling to understand a step of the proof. In particular, it says that, since the closure correspondence: $$ \\text{Cl}R:t\\mapsto \\left\\lbrace \\alpha\\in \\mathbb{R}:p(t)\\leq \\alpha\\right\\rbrace $$ is closed-valued and measurable, then $p$ is measurable. measure-theory calculus-of-variations measurable-functions Share Cite Improve this question Follow asked Jul 28, 2020 at 11:18 Giuliosky 41 3 3 bronze badges $\\endgroup$ 3 $\\begingroup$ I don't have the book. What is $T$ and what is a normal integrand? $\\endgroup$ Dieter Kadelka –  Dieter Kadelka 2020-07-28 13:15:42 +00:00 Commented Jul 28, 2020 at 13:15 $\\begingroup$ Oh sorry, I should have made a more precise answer. $(T,\\mathcal{F})$ is an arbitrary measurable space, while a normal integrand is a function whose epigraphical correspondence is closed-valued and measurable. In particular, $f:T\\times \\mathbb{R}\\to\\mathbb{R}$ is a normal integrand, if the correspondence: $\\Gamma_f:t\\mapsto \\left\\lbrace (x,\\alpha)\\in \\mathbb{R}^2:f(t,x)\\leq \\alpha\\right\\rbrace$ is closed-valued and measurable. $\\endgroup$ Giuliosky –  Giuliosky 2020-07-28 13:18:22 +00:00 Commented Jul 28, 2020 at 13:18 3 $\\begingroup$ @Giuliosky Just rewrite the question making all definitions and terms used clear. Adding explanations in comments is not a good idea since the question itself should be self-contained. $\\endgroup$ Piotr Hajlasz –  Piotr Hajlasz 2020-07-28 13:29:14 +00:00 Commented Jul 28, 2020 at 13:29 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions measure-theory calculus-of-variations measurable-functions See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 2 Are measures of a measurable cardinal measurable? (Edited and Updated Version) 2 Measurability of functions with multiple parameters 4 Measurability of optimal values and solutions 1 Alternative characterization of epi-convergence 2 $\\Psi$ in finite Wiener–Itô Chaos implies existence of continuous representative on neighborhood of Cameron–Martin space? 5 A Borel-measurable function defined on a perfect measure space is Bochner-measurable? 7 Measurable fields of Hilbert spaces with Serre-Swan duality $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366781, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "measure-theory,calculus-of-variations,measurable-functions,measure-theory,calculus-of-variations,measurable-functions",
  "scraped_at": "2026-01-14T04:25:44.501472",
  "answer": ""
}