{
  "id": "q_363237",
  "mathoverflow_id": 363237,
  "url": "https://mathoverflow.net/questions/363237/can-an-orderless-set-of-inner-product-between-n-vectors-determine-unique-structu",
  "title": "mg.metric geometry - Can an orderless set of inner product between N vectors determine unique structure of the vectors?",
  "body": "Suppose we have n vectors {a1,a2,a3,...,an} such that the sum of them is zero vector a1+a2+a3+...+an=0 Now, we compute the inner product of each two vectors of them, i.e. we compute the Gramian matrix of them and take the strictly upper triangular part. Then, we make those inner products into an orderless set. Now, can we determine a unique structure of the vectors from the set? For example, when n=3 it's feasible, Suppose we have 3 vectors {a,b,c} such that a+b+c=0 Then c=-a-b the set of inner products of them is {a.b, a.c, b.c} = {a.b, a.(-a-b), b.(-a-b)} = {a.b, -a^2-a.b, -b^2-a.b} Then we can find a^2 = -(-a^2-a.b+a.b) b^2 = -(-b^2-a.b+a.b) Cos<a,b> = a.b/(|a|*|b|) So we know the length of a and b and the angle between a and b. And by the condition c=-a-b, the structure of the 3 vectors is unique. Even if we don't know the order of set of inner products Suppose they are {k1, k2, k3} We just need to choose anyone of them like k2 And compute i=-(k2+k1) j=-(k2+k3) Cos<i,j>=k2/(Sqrt[i]*Sqrt[j]) Then the structure is determinate and unique. So what if n>3? Note: If one structure can be transformed into the other by reflections, we regard them as same structure mg.metric-geometry matrices inner-product Share Cite Improve this question Follow asked Jun 16, 2020 at 13:50 DNQZ 31 2 2 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions mg.metric-geometry matrices inner-product See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 3 Bringing a (Least Squares Problem) Matrix into Block Upper-triangular Shape via Matrix-reordering 2 How to define and compute the degree of congruence of two rigid polyhedra in same type with knowing vertex coordinates? 4 $O(n^{2-\\epsilon})$ bound on choosing $n$ points on the hypersphere to maximize $\\pm 1$ weighted sum of their $\\binom{n}{2}$ inner products 1 Distribution of inner product of random unit vectors $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363237, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "mg.metric-geometry,matrices,inner-product,mg.metric-geometry,matrices,inner-product",
  "scraped_at": "2026-01-14T04:17:03.657584",
  "answer": ""
}