{
  "id": "q_366807",
  "mathoverflow_id": 366807,
  "url": "https://mathoverflow.net/questions/366807/complex-geometric-interpretation-of-mordell-conjecture",
  "title": "ag.algebraic geometry - Complex Geometric Interpretation of Mordell conjecture",
  "body": "The Mordell conjecture/Falting's Theorem says that any smooth projective curve $X$ of genus $g\\geq 2$ over $\\mathbb{Q}$ has finitely many integer points (using the valuatlive criterion). We can of course apply the analytification functor then the sturcture morphism of $X$ becomes $$X(\\mathbb{C})^{an}\\rightarrow \\text{Spec}(\\mathbb{Z})(\\mathbb{C})^{an}$$ and an integer point corresponds to a section of this morphism. However $\\text{Spec}(\\mathbb{Z})(\\mathbb{C})^{an}$ is just a point, so this is not an interesting geometric object. However, on an intuitive level, the specta of Dedekind domains correspond to $1$ -dimensional curves. My question therefore is if there exists a (complex) geometric interpretation of the Mordell Conjecture? The most naive interpretation I have and can thus hope for this would be that there exist only finitely many maps $$\\mathbb{C}\\rightarrow X(\\mathbb{C})^{an}.$$ Is there anything in that direction? ag.algebraic-geometry complex-geometry arithmetic-geometry algebraic-number-theory algebraic-curves Share Cite Improve this question Follow asked Jul 28, 2020 at 16:35 curious math guy 4,438 10 10 silver badges 36 36 bronze badges $\\endgroup$ 4 $\\begingroup$ it's true that there are finitely many maps from $\\mathbb{C}$ to a closed Riemann surface of genus $g\\geq 2$. Have you read about the Mordell conjecture over function fields? $\\endgroup$ user158636 –  user158636 2020-07-28 16:41:50 +00:00 Commented Jul 28, 2020 at 16:41 $\\begingroup$ @crispr Yes, I'm aware of the function field analogy and the Mordell conjecture in that setting. $\\endgroup$ curious math guy –  curious math guy 2020-07-28 16:47:03 +00:00 Commented Jul 28, 2020 at 16:47 1 $\\begingroup$ I guess my question could be clarified by asking \"What is the complex analogue of a integer point?\" $\\endgroup$ curious math guy –  curious math guy 2020-07-28 16:48:32 +00:00 Commented Jul 28, 2020 at 16:48 $\\begingroup$ possibly something like this mathoverflow.net/q/52419 $\\endgroup$ user158636 –  user158636 2020-07-28 17:02:47 +00:00 Commented Jul 28, 2020 at 17:02 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry complex-geometry arithmetic-geometry algebraic-number-theory algebraic-curves See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 15 Rational curves on varieties of general type Related 2 In Riemann Existence, what is the interpretation of the space of complex-geometric points? 8 On the Geometric Interpretation of the Local Criterion for Flatness 7 When are arithmetic and geometric monodromy equal? 9 Is the analytification functor part of a geometric morphism of topoi? 2 Norm theorem for finite etale morphisms between Dedekind affine schemes 5 Misunderstanding of Hodge conjecture $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366807, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,complex-geometry,arithmetic-geometry,algebraic-number-theory,algebraic-curves,ag.algebraic-geometry,complex-geometry,arithmetic-geometry,algebraic-number-theory,algebraic-curves",
  "scraped_at": "2026-01-14T04:25:49.012706",
  "answer": ""
}