{
  "id": "q_368308",
  "mathoverflow_id": 368308,
  "url": "https://mathoverflow.net/questions/368308/hilbert-scheme-with-essential-generators",
  "title": "ag.algebraic geometry - Hilbert scheme with essential generators",
  "body": "Let $H$ be the Hilbert scheme of finite flat lci subschemes in $\\mathbb{A}^n_k$ of degree $d$ , where $k$ is some field. In other words the set of morphisms from an affine $k$ -scheme $Spec(A)$ to $H$ consists of surjections $A[t_1, \\dots, t_n] \\to B$ (up to the evident notion of isomorphism) with kernel generated by $n$ elements, such that $A \\to B$ is finite locally free of degree d. (One knows that $H$ is smooth of dimension $nd$ .) Let $U \\subset H$ denote the subfunctor consisting of those maps $A[t_1, \\dots, t_n] \\to B$ such that $A[t_1, \\dots, t_{n-1}] \\to B$ is surjective (i.e. the last generator is unnecessary). I believe this defines an open subscheme of $H$ (essentially by Nakayama's lemma). Here is my question : Write $Z \\subset H$ for the (reduced) closed complement of $U$ in $X$ . What can be said about $Z$ ? In particular, what is its codimension? Regarding the title : Naively, $Z$ consists of those maps $A[t_1, \\dots, t_n] \\to B$ such that $A[t_1, \\dots, t_{n-1}] \\to B$ is not surjective. In other words, the last generator is essential. ag.algebraic-geometry Share Cite Improve this question Follow asked Aug 4, 2020 at 13:23 Tom Bachmann 2,011 12 12 silver badges 21 21 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 22 Precise definition of a scheme (Key question: How to define an open subfunctor without resorting to classical scheme theory) 18 Images and monomorphisms of schemes 9 Reference request: is the punctual Hilbert scheme irreducible? 10 Why is Maps(X,Y) an open subfunctor of Hilb(X x Y)? 3 Open covering of the Hilbert functor of points 8 Are open $\\mathbb{G}_m$-invariant subschemes of an affine scheme precisely the homogeneous radical ideals of its coordinate ring? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368308, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,ag.algebraic-geometry",
  "scraped_at": "2026-01-14T04:27:08.674651",
  "answer": ""
}