{
  "id": "q_365254",
  "mathoverflow_id": 365254,
  "url": "https://mathoverflow.net/questions/365254/injective-resolution-of-representable-sheaves",
  "title": "ag.algebraic geometry - Injective resolution of representable sheaves",
  "body": "Let $S$ be a scheme and consider the abelian category $\\mathcal{A}$ of sheaves of abelian groups on the fppf site over $S$ . It is known that $\\mathcal{A}$ has enough injectives. My question is: given a representable sheaf , say $\\mathbb{G}_m$ , I'm wondering if we can explicitly construct the first few terms of an injective resolution that are representable. In other words, can we have an exact sequence of abelian sheaves $1 \\to \\mathbb{G}_m \\to \\mathcal{I}_0 \\to \\mathcal{I}_1 \\to \\mathcal{I}_2$ where $\\mathcal{I}_i$ are representable for $i=0,1,2$ ? ag.algebraic-geometry Share Cite Improve this question Follow asked Jul 9, 2020 at 18:40 Noah 21 2 2 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 48 When are there enough projective sheaves on a space X? 8 Sheaves of $\\mathbb Z$-modules = sheaves of abelian groups 4 Representability of sheaves of groups 7 How to characterize flasque sheaves in more functorial way? 2 Injective resolution for right derived functor 3 fppf-extension of algebraic groups is an algebraic group 6 Extensions of algebraic groups and extensions of fpqc sheaves $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365254, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,ag.algebraic-geometry",
  "scraped_at": "2026-01-14T04:21:06.265855",
  "answer": ""
}