{
  "id": "q_364339",
  "mathoverflow_id": 364339,
  "url": "https://mathoverflow.net/questions/364339/uniform-position-for-multiple-components",
  "title": "ag.algebraic geometry - Uniform position for multiple components",
  "body": "(Modified from https://math.stackexchange.com/questions/3730261/uniform-position-theorem-for-reducible-varieties/3730457#3730457 ) The uniform position theorem states (roughly) that a general hyperplane section meets an irreducible degree $d$ curve $C \\subset \\mathbb{P}^r$ at $d$ points with any $r$ of them being independent (e.g. see general/uniform position theorems around section III.1 in vol. I of \"Geometry of Algebraic Curves\"). Is there a version of this when we remove the \"irreducible\" condition? For example, what happens if we consider points coming from some collection of disjoint irreducible curves? Note that this excludes cases such as some large number of curves lying in some hyperplane (or others similar to what was mentioned in the MSE link). This seems plausible for many cases, but I'm not sure how to put this into a coherent statement and irreducibility seems to be an important part of proving this theorem. In principle, one could imagine applying the theorem to each irreducible component and taking an intersection of some finite number of open sets (see link on top). However, it seems like this intersection may be empty (e.g. in the \"degenerate\" examples in the second paragraph). Also, are the counterexamples of the kind mentioned above the only ones possible? ag.algebraic-geometry Share Cite Improve this question Follow asked Jun 28, 2020 at 13:15 modnar 521 3 3 silver badges 9 9 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 5 general position lemma for tangent lines of an algebraic curve 1 a net of quadrics and the corresponding intersection 0 Uniform position property and general hyperplanes 6 Plane curves through a given collection of points 2 Uniform position principle 3 Universal hyperplane section and nondegeneracy of general hyperplane section $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364339, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,ag.algebraic-geometry",
  "scraped_at": "2026-01-14T04:18:49.096830",
  "answer": ""
}