{
  "id": "q_363262",
  "mathoverflow_id": 363262,
  "url": "https://mathoverflow.net/questions/363262/examples-of-strictification-of-a-weak-category-obtained-from-a-generalisation-of",
  "title": "ag.algebraic geometry - Examples of strictification of a weak category obtained from a generalisation of a strict category",
  "body": "I have made the following observation (hopefully a correct one) when reading the paper Orbifolds as stacks : They start with the strict $2$ -category category of Lie groupoids, functors, natural transformations between functors. After realising (I think so) the rigid ness, and that it is not of interesting nature, they construct a weak $2$ -category of Lie groupoids, bibundles and isomorphism of bibundles. Then, they consider to embed this weak $2$ -category into a strict $2$ -category of Stacks. So, we start with a strict $2$ -category, realise that it is difficult to work with, embedd this in a weak $2$ -category and then strictify it to get a strict $2$ -category. Surprisingly, this strict $2$ -category is “interesting“ and “good enough to work on”. Are there other “interesting” strict $2$ -categories obtained from strictification of a weak $2$ -category? Are there other “interesting” strict $2$ -categories obtained from strictification of a weak $2$ -category obtained from “generalising” a strict $2$ -category? ag.algebraic-geometry dg.differential-geometry ct.category-theory lie-groupoids 2-categories Share Cite Improve this question Follow asked Jun 16, 2020 at 18:29 Praphulla Koushik 6,223 3 3 gold badges 29 29 silver badges 74 74 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry dg.differential-geometry ct.category-theory lie-groupoids 2-categories See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 2 Weak colimits of weak and strict presheaves in groupoids 6 Compare three 2-categories of (Lie) groupoids 14 Are strict $\\infty$-categories localized at weak equivalences a full subcategory of weak $\\infty$-categories? 5 Morita equivalence of Lie groupoids 5 In what sense bibundles are called as generalized morphisms 2 Composition of bibundles 7 Which free strict $\\omega$-categories are also free as weak $(\\infty,\\infty)$-categories? 6 What is the appropriate notion of weakly equivalent or Morita equivalent categories internal to a category of generalized smooth spaces? 3 Morita equivalence of Lie groupoids and isomorphism of differentiable stacks $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363262, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,dg.differential-geometry,ct.category-theory,lie-groupoids,2-categories,ag.algebraic-geometry,dg.differential-geometry,ct.category-theory,lie-groupoids,2-categories",
  "scraped_at": "2026-01-14T04:10:36.032827",
  "answer": ""
}