{
  "id": "q_363684",
  "mathoverflow_id": 363684,
  "url": "https://mathoverflow.net/questions/363684/a-complex-analytic-interpretation-of-multiplicity-on-the-special-fiber-of-a-flat",
  "title": "ag.algebraic geometry - A complex analytic interpretation of multiplicity on the special fiber of a flat family",
  "body": "Let $X$ be a variety over $\\mathbb C$ and $\\pi: X\\to \\Delta$ be a flat morphism over the unit disk $\\Delta=\\{z:|z|<1\\}$ . Let $Z$ be a component of $X_0=\\pi^{-1}(0)$ . The multiplicity of $Z$ is defined as the order of vanishing of $\\pi^*(t)$ on $Z$ , where $t$ is the local coordinate of $0\\in\\Delta$ . I'm trying to understand the multiplicity through a complex analytic point of view, via the following way. Let $p\\in Z$ be a general point (in particular, $p$ is a smooth point of $Z$ and does not meet other components of $X_0$ ). Let $\\Delta_p$ is a holomorphic disk in $X$ which is transversal to $Z$ at $p$ . Then the restriction $$\\pi|_{\\Delta_p}:\\Delta_p\\to \\Delta$$ is identified with $z\\mapsto z^m$ for some $m\\ge 1$ . Question: Is it true that $m$ coincides with multiplicity of $Z$ in general? My motivating example is the family of plane curves $X=\\{y^2-tx=0\\}\\subset \\mathbb C^2_{[x,y]}\\times \\Delta$ , take $p=(1,0,0)$ and $\\Delta_p=\\{(1,t,t^2):t\\in \\Delta\\}$ which is 2-to-1 to $\\Delta$ , so the degree coincides with the multiplicity of $\\{y^2=0\\}$ . Also the degree is not dependent on the choice of $p$ (except at $p=[0,0,0]$ where the total space is singular) and choice of normal disk. This leads to the construction in my question as above, and I think the answer should be true. However, I haven't seen such a complex analytic description in any reference before. Is that true? I would appreciate it if anyone can show me proof or reference. p.s., My original question was posted on MSE here but I received no comment/answer so far. ag.algebraic-geometry complex-geometry several-complex-variables Share Cite Improve this question Follow edited Jun 21, 2020 at 3:32 asked Jun 21, 2020 at 3:25 AG practitioner 1,843 1 1 gold badge 14 14 silver badges 19 19 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry complex-geometry several-complex-variables See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 Is complex analytic extension of real-analytic diffeomorphism a diffeomorphism ? 2 Does a generic curve inside the space of curves with a node at a specific point have only finitely many nodes? 2 General position argument 2 Flatness of a morphism of complex analytic spaces 11 Large Complex Structure Limit of Calabi-Yau family and uniqueness of limit 3 Subset of a complex manifold whose intersection with every holomorphic curve is analytic $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363684, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,complex-geometry,several-complex-variables,ag.algebraic-geometry,complex-geometry,several-complex-variables",
  "scraped_at": "2026-01-14T04:17:45.919793",
  "answer": ""
}