{
  "id": "q_364590",
  "mathoverflow_id": 364590,
  "url": "https://mathoverflow.net/questions/364590/determining-the-irreducible-invariant-subspaces-of-a-permutation-action-by-compu",
  "title": "ag.algebraic geometry - Determining the irreducible invariant subspaces of a permutation action by computing eigenspaces of a matrix",
  "body": "Let $\\Sigma\\subseteq\\mathrm{Sym}(n)$ be a permutation group on $N:=\\{1,...,n\\}$ . My goal is to determine the irreducible invariant subspaces of the permutation action of $\\Sigma$ on $\\Bbb R^n$ , and I wonder whether the following technique always works. Consider the element-wise action of $\\Sigma$ on the subsets $\\{i,j\\}\\subseteq N$ for $i,j\\in N$ . Let $o(i,j)$ denote the orbit of $\\{i,j\\}$ w.r.t. this action, and let $\\mathcal O(\\Sigma)$ denote the set of all these orbits. Now let $R:= \\Bbb R[\\,x_o\\!\\mid\\! o\\in\\mathcal O(\\Sigma)\\,]$ be the polynomial ring over $\\Bbb R$ with one variable $x_o$ for each orbit, and consider the matrix $M\\in R^{n\\times n}$ with components $ M_{ij} = x_{o(i,j)}$ . Question : Is is true that that the eigenspaces of this matrix $M$ are exactly the irreducible invariant subspaces of the permutation action of $\\Sigma$ on $\\Bbb R^n$ ? The matrix is symmetric, and thus the eigenspaces are real and mutually orthogonal. Each eigenspace is indeed $\\Sigma$ -invariant, but is it also irreducible? I have applied this idea computationally and it never failed me. In practice, I do not use variables $x_o$ , but some algebraically independent number (or just some random numbers). But does it work always? ag.algebraic-geometry gr.group-theory rt.representation-theory group-actions invariant-theory Share Cite Improve this question Follow asked Jul 1, 2020 at 16:07 M. Winter 14.7k 3 3 gold badges 31 31 silver badges 83 83 bronze badges $\\endgroup$ 2 2 $\\begingroup$ The orbits of $G$ on pairs $\\{x,y\\}$ of points in the domain are called orbitals. The matrices associated with the orbitals span the centralizer algebra. The matrix $M$ in your question is somehow a generic element of the centraliser algebra. Thinking about the permutation representation with respect to a basis in which it is a direct sum of irreducible representations, you can work out an explicit description of the centraliser algebra - the books of Wielandt or Cameron, both called \"Permutation groups\", should have details. $\\endgroup$ Padraig Ó Catháin –  Padraig Ó Catháin 2020-07-01 16:44:29 +00:00 Commented Jul 1, 2020 at 16:44 $\\begingroup$ If the answer to your precise question is not 'yes' then some minor modification should be true, though note the orbital matrices are not always symmetric. $\\endgroup$ Padraig Ó Catháin –  Padraig Ó Catháin 2020-07-01 16:46:52 +00:00 Commented Jul 1, 2020 at 16:46 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry gr.group-theory rt.representation-theory group-actions invariant-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 12 Suggestion for framing a course in Representation theory + Spectral graph theory Related 37 When are the eigenspaces of the Laplacian on a compact homogeneous space irreducible representations? 3 Checking smoothness of the components of a highly symmetric scheme via quotient? 14 If an equivariant map is smooth on diagonal matrices, is it smooth everywhere? 4 Which groups can be reconstructed from a single invariant subspace? 11 Generalized root systems and reflection groups 6 Centralizer of a cyclic subgroup within the group algebra $\\mathbb{C} S_N$ of the symmetric group 6 Is there a known classification of regular multiplicity-free permutation groups? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364590, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,gr.group-theory,rt.representation-theory,group-actions,invariant-theory,ag.algebraic-geometry,gr.group-theory,rt.representation-theory,group-actions,invariant-theory",
  "scraped_at": "2026-01-14T04:19:53.286365",
  "answer": ""
}