{
  "id": "q_368270",
  "mathoverflow_id": 368270,
  "url": "https://mathoverflow.net/questions/368270/notion-of-distance-between-linear-programs",
  "title": "oc.optimization and control - Notion of distance between linear programs",
  "body": "Consider the linear programming problem \\begin{align} \\max_{x}&~c^Tx \\\\~s.t.~~a^Tx &\\leq B~,~0\\leq x_i \\le1 \\end{align} where $c$ and $a$ are $n \\times 1$ given non-negative vectors. $B$ is a positive constant (call it \"Budget Constraint\") and $x_i$ 's are required to be in the interval $[0,1]$ (call it \"Box Constraint\"). Assume that the problem is always feasible. This is the mathematical formulation of an engineering problem we are trying to solve. Typically $n$ runs into tens of thousands for our problem. Let the dual variable corresponding to Budget Constraint be $\\lambda$ and the dual variables ( $n$ of them) corresponding to Box constraints be $\\alpha_i$ . What is important for us is the nature of $\\lambda$ itself. Now, consider a slightly noisy version of the above LP problem \\begin{align} \\max_{x,\\tilde{x}}&~c^Tx + \\tilde{c}^T\\tilde{x} \\\\~s.t.~~a^Tx + \\tilde{a}^T\\tilde{x}&\\leq B~,~0\\leq x_i \\le1~,~0\\leq \\tilde{x}_i \\le1 \\end{align} where $\\tilde{c}$ and $\\tilde{a}$ are non-negative $m \\times 1$ vectors. Typically $m <<n$ and is often in hundreds. Let $\\lambda_n$ denote the corresponding dual variable for Budget Constraint. In practice, we have often observed that $\\lambda$ is close to $\\lambda_n$ . Intuitively, the problems seems to be close to each other depending on the nature of the additional terms. Is there some literature which studies the notion of distance between such linear programs? We could only find literature that studies LP problems with noisy versions of $c$ and $a$ and not in terms of a number of variables. Our actual problem is a combination of both where the dimensionality, as well as the co-efficents, are noisy. Any pointers would be appreciated. linear-algebra oc.optimization-and-control convex-optimization nonlinear-optimization linear-programming Share Cite Improve this question Follow edited Aug 4, 2020 at 3:32 asked Aug 4, 2020 at 3:24 dineshdileep 1,421 10 10 silver badges 18 18 bronze badges $\\endgroup$ 5 1 $\\begingroup$ Why not consider the first LP as one with an expanded number of variables $\\{x,\\tilde{x}\\}$ and setting some coefficients appropriately to zero? And then the second LP can be studied in the light of perturbation analysis of the first LP. Hope I got your question right. $\\endgroup$ DSM –  DSM 2020-08-04 06:01:56 +00:00 Commented Aug 4, 2020 at 6:01 $\\begingroup$ @DSM Can you please point to references like that? $\\endgroup$ dineshdileep –  dineshdileep 2020-08-04 23:56:12 +00:00 Commented Aug 4, 2020 at 23:56 $\\begingroup$ What I mentioned is just an extension of the variable space (so that the two LPs in your question are comparable), and the usual ideas in LP. You might want to look any standard references (Bertsimas) for perturbation/sensitivity analysis. As far as 'distance between LPs' is concerned, I have not come across such an idea. $\\endgroup$ DSM –  DSM 2020-08-05 02:42:46 +00:00 Commented Aug 5, 2020 at 2:42 $\\begingroup$ @DSM most of such references assume that a small noise is added to a set of coefficients whereas in my case, they are literally zeroed out. Also, let's say $m$ is a random variable in itself, only very small in its values compared to $n$. Thus, the count of additional terms that can appear is randomized. Thus, I am not interested in a fixed $n + m$ which then reduces to $n$ variable LP via perturbation. I am interested in set of all LPs with $n+m$ variables and any notion of distance of them to the $n$ variable LP. $\\endgroup$ dineshdileep –  dineshdileep 2020-08-05 05:28:51 +00:00 Commented Aug 5, 2020 at 5:28 $\\begingroup$ Okay. I think I did not note the random perturbation in the number of variables. $\\endgroup$ DSM –  DSM 2020-08-07 04:40:24 +00:00 Commented Aug 7, 2020 at 4:40 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions linear-algebra oc.optimization-and-control convex-optimization nonlinear-optimization linear-programming See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 3 How to minimize the Bregman divergence on a convex hull spanned from a set of vectors? 8 Optimization problem with determinant as objective 1 How good is the LP relaxation? 0 Sub optimal algorithm for linear programming 0 Fractional values in linear programming 1 Optimality gap between a joint linear program and decoupled sub programs 0 Constrained linear optimization problem on $C^1$ $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368270, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "linear-algebra,oc.optimization-and-control,convex-optimization,nonlinear-optimization,linear-programming,linear-algebra,oc.optimization-and-control,convex-optimization,nonlinear-optimization,linear-programming",
  "scraped_at": "2026-01-14T04:26:52.810830",
  "answer": ""
}