{
  "id": "q_364032",
  "mathoverflow_id": 364032,
  "url": "https://mathoverflow.net/questions/364032/projective-objects-for-compact-po-spaces",
  "title": "ct.category theory - Projective objects for compact po-spaces",
  "body": "Let us consider the following definition: a compact po-space is a pair $(X,\\leq)$ where $X$ is a compact space and $\\leq$ is an order, closed on $X^2$ . Then, we can consider the category $KPoSp$ whose objects are compact po-spaces and whose morphisms are increasing continuous functions. Moreover, let us denote by $KHaus$ the category of compact Hausdorff spaces with continuous functions. It is known that the projective objects in $KHaus$ are the compact Hausdorff spaces which are extremally disconnected , in the sense that the closure of an open set is also open. (I have it from section 7 of Stone duality and Gleason covers through de Vries duality ). I would like to know if there is somewhere a similar result for the category $KPoSp$ ? ct.category-theory gn.general-topology boolean-algebras Share Cite Improve this question Follow edited Jun 24, 2020 at 16:04 asked Jun 24, 2020 at 13:59 Bijco 21 5 5 bronze badges $\\endgroup$ 7 1 $\\begingroup$ Are the objects of $KPoSp$ assumed to be Hausdorff? If not, I'd think one should first ask what are the projective objects in the category of compact (not-necessarily-Hausdorff) spaces. Also, what exactly is meant by \"projective\"? Probably you mean \"object which has the left lifting property with respect to certain maps\", but which maps? Surjections? Epimorphisms? Quotient maps? Finally, is $\\leq$ assumed to be a poset structure or just a preorder? $\\endgroup$ Tim Campion –  Tim Campion 2020-06-24 14:17:09 +00:00 Commented Jun 24, 2020 at 14:17 $\\begingroup$ For the definition of \"projective\", I must admit I don't know the kind of map I'm looking for (surjective maps would be perfect, but I can be satisfied with epimorphisms). The objects of $KPoSp$ are indeed Hausdorff. This is a consequence of $\\leq$ closed. Finally, yes we have a poset structure (the relation between compact po-spaces and Priestley spaces is similar to the one between compact Hausdorff and Stone spaces, if it can help.) $\\endgroup$ Bijco –  Bijco 2020-06-24 15:58:04 +00:00 Commented Jun 24, 2020 at 15:58 1 $\\begingroup$ Presumably you want to first show every compact pospace is a quotient of a Priestley space and then look at injective distributive lattices. Did you look in Johnstone's stone spaces or the compendium of continuous lattices? $\\endgroup$ Benjamin Steinberg –  Benjamin Steinberg 2020-06-24 16:31:33 +00:00 Commented Jun 24, 2020 at 16:31 1 $\\begingroup$ I suspect that surjections are not what you want -- they lead to \"too few\" projective objects (and epimorphisms will be, if anything, worse in this regard). For instance, for $P$ to have the left lifting property against the bijection $f: \\{0,1\\} \\to \\{0 < 1\\}$ (where $\\{0,1\\}$ has the discrete ordering) is a very strong requirement. In particular, if $P$ is totally disconnected and has the left lifting property with respect to $f$, then I believe the order on $P$ must be discrete. So perhaps you want \"projective\" to mean the left lifting property with respect to quotient maps. $\\endgroup$ Tim Campion –  Tim Campion 2020-06-24 18:44:59 +00:00 Commented Jun 24, 2020 at 18:44 $\\begingroup$ On the other hand, I'm not sure I'd expect there to be a well-behaved notion of \"projective\" even in the category $Pos$ of posets without a topology -- generally I expect \"projective\" to be well-behaved in \"algebraic\" categories (by which I mean roughly: monadic over $Set$ or monadic over $Set^S$ for some set $S$), which $Pos$ is not. Analogously, I don't think there's a good notion of \"projective object\" in the category $Cat$ of categories. $\\endgroup$ Tim Campion –  Tim Campion 2020-06-24 18:51:36 +00:00 Commented Jun 24, 2020 at 18:51  |  Show 2 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ct.category-theory gn.general-topology boolean-algebras See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 37 Reference for the Gelfand duality theorem for commutative von Neumann algebras 1 F-spaces and points whose complements are C*-embedded 6 Is the absolute of a compact space the projective limit of the Stone-Čech compactifications of its open dense subsets? 9 Stone-Čech boundary is not extremally disconnected 3 Existence of a quasi-open (a.k.a semi-open) map into a Cantor cube 4 Must US extremally disconnected spaces be sequentially discrete? 2 Complete CCC Boolean algebras (or Stonean spaces) 26 Why are extremally disconnected spaces so hard to give examples of? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364032, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ct.category-theory,gn.general-topology,boolean-algebras,ct.category-theory,gn.general-topology,boolean-algebras",
  "scraped_at": "2026-01-14T04:18:15.481581",
  "answer": ""
}