{
  "id": "q_368435",
  "mathoverflow_id": 368435,
  "url": "https://mathoverflow.net/questions/368435/mod-n2-evaluation-of-a-polynomial-defined-by-first-n-1-roots",
  "title": "nt.number theory - Mod $N^2$ evaluation of a polynomial defined by first $N-1$ roots",
  "body": "Given a prime $N$ and integer $g$ , where $g$ is able to generate the multiplicative subgroup $(\\mathbb{Z}/N^2\\mathbb{Z})^*$ , I am interested in any results simplifying or evaluating $f\\in (\\mathbb{Z}/N^2\\mathbb{Z})[x]$ where $$f(x) := \\prod_{k=0}^{N-2} (x-g^k)$$ I know that this polynomial in $\\mathbb{Z}/N\\mathbb{Z}[x]$ is equivalent to $(x^N-1)$ because they are both monic polynomials of the same degree with the same roots. Similarly in $\\mathbb{Z}/N^2\\mathbb{Z}[x]$ , $$\\prod_{k=0}^{N(N-1)-1} (x-g^k)=(x^{N(N-1)}-1)$$ I have tried generating a few small examples of this product but have not seen an obvious pattern emerge. This polynomial also seems different from cyclomatic polynomials because the roots are close to each other rather than separated by by a gcd relation. Ideally, I want to evaluate $f(x)$ , but I am also curious what research has been done on these partial products. My preliminary searches have failed to find a name for this polynomial much less any results, so any information would be informative. Note: This equation and question are very similar to the second quantity asked about in https://math.stackexchange.com/questions/3398653/polynomial-whose-roots-are-some-of-the-nth-roots-of-unity . But not much by way of follow up has been given for possible ways to evaluate or simplify the polynomial nt.number-theory ac.commutative-algebra polynomials roots-of-unity Share Cite Improve this question Follow edited Aug 6, 2020 at 8:13 YCor 67.5k 5 5 gold badges 203 203 silver badges 301 301 bronze badges asked Aug 6, 2020 at 5:56 Richard G. 11 1 1 bronze badge $\\endgroup$ 4 $\\begingroup$ When you say \"evaluating $f$\", do you mean computing the coefficients of $f$, or computing $f(\\alpha)$ for $\\alpha$ in $\\mathbb{Z}/N^2\\mathbb{Z}$ (or some $\\mathbb{Z}/N^2\\mathbb{Z}$-algebra)? $\\endgroup$ Ben Smith –  Ben Smith 2020-08-07 12:03:47 +00:00 Commented Aug 7, 2020 at 12:03 $\\begingroup$ The latter, computing $f(\\alpha)$. $\\endgroup$ Richard G. –  Richard G. 2020-08-07 22:21:34 +00:00 Commented Aug 7, 2020 at 22:21 $\\begingroup$ Pollard has an algorithm which can be used to evaluate $f(x)$ in $O(\\sqrt{N})$ operations in $\\mathbb{Z}/N^2\\mathbb{Z}$. Pollard's paper (\"Theorems on factorization and primality testing\") is not available freely online, but there's a convenient description of the algorithm in Section 2.1 of Bostan's \"Computing the N-th Term of a q-Holonomic Sequence\" . $\\endgroup$ Ben Smith –  Ben Smith 2020-08-10 10:08:19 +00:00 Commented Aug 10, 2020 at 10:08 $\\begingroup$ Thank you. That is a noticeable improvement over just calculating all the terms! $\\endgroup$ Richard G. –  Richard G. 2020-08-11 23:16:18 +00:00 Commented Aug 11, 2020 at 23:16 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions nt.number-theory ac.commutative-algebra polynomials roots-of-unity See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 25 Monic polynomial with integer coefficients with roots on unit circle, not roots of unity? 4 Bounding roots of a polynomial by coefficients 4 counting complex roots which are root of unity times a real number 1 Sum of negative roots of a $5^{th}$ degree monic polynomial 7 Polynomials with roots on, outside but not inside the unit circle 0 Sufficient conditions for ensuring that a monic polynomial in $\\mathbf{Z}[x]$ possesses exclusively simple roots $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368435, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "nt.number-theory,ac.commutative-algebra,polynomials,roots-of-unity,nt.number-theory,ac.commutative-algebra,polynomials,roots-of-unity",
  "scraped_at": "2026-01-14T04:28:00.686540",
  "answer": ""
}