{
  "id": "q_368809",
  "mathoverflow_id": 368809,
  "url": "https://mathoverflow.net/questions/368809/can-an-infty-action-on-a-derived-affine-scheme-by-an-affine-group-scheme-alwa",
  "title": "Can an $\\infty$-action on a derived affine scheme by an affine group scheme always be strictified?",
  "body": "Let $X$ be an affine derived scheme, say $X = \\operatorname{Spec} A$ , for $A$ a simplicial commutative ring. Let $G$ be an affine group scheme (classical), say $G = \\operatorname{Spec}B$ , and let an $\\infty$ -action of $G$ on $X$ be given in the form of a simplicial diagram $X \\leftleftarrows X \\times G \\cdots$ in the $\\infty$ -category of derived schemes. This diagram corresponds to a cosimplicial diagram $D$ of the form $A \\rightrightarrows A \\otimes B \\cdots$ in the $\\infty$ -category of simplicial commutative rings. Say that we can strictify $D$ if it is equivalent to a strictly commutative diagram $D'$ in the model category of simplicial commutative rings such that $D'$ corresponds to a levelwise coaction of $B$ on a simplicial commutative ring $A'$ . In other words, we can strictify $D$ if we can, up to equivalence, assume that the equivalences and homotopies which exhibit $D$ as a coaction of $B$ on $A$ are in fact isomorphisms and identities. The question is: can we always strictify $D$ ? I suspect the answer is: no, not always, but we can for certain $G$ . For example, the answer is yes for $G = \\mathbb{G}_m$ . I hope to find a counterexample to see that it does not work for general $G$ . derived-algebraic-geometry Share Cite Improve this question Follow asked Aug 10, 2020 at 14:42 Maanroof 213 1 1 silver badge 4 4 bronze badges $\\endgroup$ 2 $\\begingroup$ Since it works for $\\pi_0A$, have you tried working up the Postnikov tower of $A$ and comparing obstructions at each stage? $\\endgroup$ Jon Pridham –  Jon Pridham 2020-08-10 18:05:36 +00:00 Commented Aug 10, 2020 at 18:05 $\\begingroup$ In characteristic $0$, another way to approach it would be to look for obstructions as you work up the lower central series of the pro-unipotent radical of $G$, since strictification should work for pro-reductive groups. $\\endgroup$ Jon Pridham –  Jon Pridham 2020-08-11 16:28:00 +00:00 Commented Aug 11, 2020 at 16:28 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions derived-algebraic-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 19 Is it always possible to write a scheme as a colimit of affine schemes? 7 Reference: the category of derived affine schemes is extensive 4 Classical schemes as derived schemes are discrete valued 2 Constructing a quasi-coherent sheaf on a derived scheme/stack as a compatible family $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368809, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "derived-algebraic-geometry,derived-algebraic-geometry",
  "scraped_at": "2026-01-14T04:28:20.923576",
  "answer": ""
}