{
  "id": "q_366137",
  "mathoverflow_id": 366137,
  "url": "https://mathoverflow.net/questions/366137/permutations-with-bounded-displacement-on-a-circle",
  "title": "co.combinatorics - Permutations with bounded displacement on a circle",
  "body": "I am interested in references to results on permutations $\\sigma$ of $\\{0,\\ldots,n-1\\}$ satisfying $\\text{min}\\{ \\sigma(i)-i\\text{ (mod } n),i-\\sigma(i) \\text{ (mod } n) \\} \\leq k$ for some $k$ for all $i$ . I don't know if there is a common term for these, so I settled for the \"bounded displacement\" in the title. I was only able to find two related topics, but both with the linear order, without the \"mod $n$ \" part. These are the band permutations and probabilistic results about them, concerned with random walks (and relaxing the \"all $i$ \" assumption to just \"most $i$ \"), discussed in this video , and the enumeration problem for permutations with bounded drop (bounding the value of $i-\\sigma(i)$ instead) inspired by sorting problems, and solved in this paper . It also seems like such permutations might arise with Schreier graphs, but I was unable to find any references, nor analogues of the previous two on the circle. I am not primarily concerned with counting these permutations (but will be happy to see that too). Ideally, I would like to see dynamical results about such a permutation of a discrete set, or about quantities invariant or bounded under such permutation acting on $\\mathbb{R}^n$ , since this is the context we encountered them in. co.combinatorics discrete-dynamical-systems Share Cite Improve this question Follow edited Jul 20, 2020 at 21:25 asked Jul 20, 2020 at 20:06 lemon314 323 4 4 silver badges 12 12 bronze badges $\\endgroup$ 3 $\\begingroup$ Given the last paragraph, arxiv.org/abs/1301.4736 might be related. $\\endgroup$ Ville Salo –  Ville Salo 2020-07-20 21:23:59 +00:00 Commented Jul 20, 2020 at 21:23 $\\begingroup$ Let $f_k(n)$ be the number of such permutations. By the technique used to prove Proposition 4.7.10 of Enumerative Combinatorics , vol. 1, second ed., if we interpret $f_k(n)$ suitably for small $n$ then $\\sum_{n\\geq 0}f_k(n)x^n=-xQ_k'(x)/Q_k(x)$ for some polynomial $Q_k(x)$. $\\endgroup$ Richard Stanley –  Richard Stanley 2020-07-20 22:32:03 +00:00 Commented Jul 20, 2020 at 22:32 $\\begingroup$ It would be great if you could add this to findstat.org. (I'm on a cellphone right now) here is code: def statistic(pi): n=len(pi) return max(min((e-1-i)%n,(i-e+1)%n) for i,e in enumeate(pi)) $\\endgroup$ Martin Rubey –  Martin Rubey 2020-07-21 07:07:35 +00:00 Commented Jul 21, 2020 at 7:07 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions co.combinatorics discrete-dynamical-systems See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 19 How can I generate random permutations of [n] with k cycles, where k is much larger than log n? 14 Equivalence relations on permutations and pattern avoidance 12 Cyclic Permutations - but not what you think 22 3D generalizations of permutations, RSK correspondence, contingency tables, etc. 5 Analogy between Integers and Permutations 21 Are there enough additive permutations? 7 Decorated permutations and subset permutations 1 Named sets of permutations $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366137, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "co.combinatorics,discrete-dynamical-systems,co.combinatorics,discrete-dynamical-systems",
  "scraped_at": "2026-01-14T04:23:46.842401",
  "answer": ""
}