{
  "id": "q_365505",
  "mathoverflow_id": 365505,
  "url": "https://mathoverflow.net/questions/365505/equivariant-splitting-of-loop-space-of-a-suspension",
  "title": "at.algebraic topology - Equivariant splitting of loop space of a suspension",
  "body": "It is well known, e.g. by Cohen's \"A model for the free loop space of a suspension\", that there is a stable splitting of the free loop space $\\mathcal{L} \\Sigma X $ of the suspension $\\Sigma X $ given by $$ \\Sigma^{\\infty} \\mathcal{L} X \\simeq \\bigoplus_{n>1} \\Sigma^{\\infty}(S^1_+ \\wedge_{C_n} X^n) $$ where $C_n$ is the cyclic group of order $n$ , and $S^1_+ \\wedge_{C_n} X^n$ is the $S^1$ -space induced by the inclusion of groups $C_n \\to S^1$ and viewing $X^n$ as a $C_n$ -space. I would like to know if this can be promoted to an $S^1$ -equivariant splitting, at least in the case when $X$ is an $k$ -sphere. There seems to be some equivariance going on, as the map is induced by a map (at the level of spaces) $$ X^n \\to \\mathcal{L}X $$ which is equivariant with respect to the $C_n$ -action on the left, and the $C_n$ -action on the right obtained by restricting the $S^1$ action. Any input would be greatly appreciated! at.algebraic-topology homotopy-theory loop-spaces equivariant-homotopy Share Cite Improve this question Follow asked Jul 12, 2020 at 22:40 user237334 131 2 2 bronze badges $\\endgroup$ 1 $\\begingroup$ The following article, which you probably have seen, might be related jstor.org/stable/2374740 $\\endgroup$ user51223 –  user51223 2020-07-18 18:34:35 +00:00 Commented Jul 18, 2020 at 18:34 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions at.algebraic-topology homotopy-theory loop-spaces equivariant-homotopy See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 9 Infinite loop space maps into or out of BAut(F_n) 11 co-$A_\\infty$ spaces 19 When does the free loop space fibration split? 7 Computing the equivariant cohomology of a specific $(\\mathbb{Z}/2\\mathbb{Z})^2$-space 8 Is the homology of $\\Omega^2\\Sigma^2X$ free as a Gerstenhaber algebra? 16 Mapping a loop space to quaternionic projective space 7 Suspension spectrum functor 8 Circle action on free loop space of a classifying space $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365505, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "at.algebraic-topology,homotopy-theory,loop-spaces,equivariant-homotopy,at.algebraic-topology,homotopy-theory,loop-spaces,equivariant-homotopy",
  "scraped_at": "2026-01-14T04:22:22.565956",
  "answer": ""
}