{
  "id": "q_368990",
  "mathoverflow_id": 368990,
  "url": "https://mathoverflow.net/questions/368990/reference-request-diffusion-approximation-to-the-radiative-transport",
  "title": "ap.analysis of pdes - Reference request: diffusion approximation to the radiative transport",
  "body": "I'm looking for a good, modern reference for the diffusion approximation to the radiative transport problem. I'm aware of the text of Dautray and Lions, as well as the monograph by Bensoussan, Lions, and Papanicolaou, but these are a bit dated and difficult to read. My motivation is studying the (in)stability of the inverse radiative transport problem. More specifically, I am hoping to better understand the estimate in pages 8-10 in the following paper of H.K. Zhao. reference-request ap.analysis-of-pdes inverse-problems Share Cite Improve this question Follow asked Aug 12, 2020 at 19:08 Phil 123 8 8 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request ap.analysis-of-pdes inverse-problems See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 7 Time reversibility of Stratonovich Diffusion: Reference Request 1 Reference request: Spectral analysis of advection diffusion PDE 4 Classical theory for the incompressible Euler equation (reference request) 3 Reference request: Original source of Yosida approximation 17 Reference request: the theory of currents $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368990, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,ap.analysis-of-pdes,inverse-problems,reference-request,ap.analysis-of-pdes,inverse-problems",
  "scraped_at": "2026-01-14T04:28:48.134684",
  "answer": ""
}