{
  "id": "q_363174",
  "mathoverflow_id": 363174,
  "url": "https://mathoverflow.net/questions/363174/what-are-the-corners-of-this-polytope",
  "title": "linear programming - What are the corners of this polytope?",
  "body": "Let $f$ be a non-negative function on the positive integers such that $f(s+t)\\geq f(s) + f(t)$ for all $s,t\\in\\mathbb{Z}^+$ . Consider the polytope consisting of all $x\\in \\mathbb{R}^n$ such that $$\\sum_{i\\in S} x_i \\geq f(|S|)$$ for all subsets $S\\subseteq \\{1,\\dots,n\\}$ . My question is: is there a compact description of the corners of this polytope? My conjecture is that the corners simply correspond to permutations $\\sigma$ where one sets $x_{\\sigma(1)} = f(1)$ , $x_{\\sigma(2)} = f(2) - f(1)$ , $x_{\\sigma(3)} = f(3) - f(2)$ , and so on. linear-programming polytopes Share Cite Improve this question Follow asked Jun 15, 2020 at 22:59 Bob Mullins 11 1 1 bronze badge $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions linear-programming polytopes See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 5 Continuous Linear Programming: Estimating a Solution 2 Design constraint systems over the reals 2 Optimization problem whose cardinality never exceeds 7 for some reason 1 Derive a vertex representation of a permutohedron from its linear-inequalities form 2 Counting the number of pair of d-uplets with upper bounded distance $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363174, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "linear-programming,polytopes,linear-programming,polytopes",
  "scraped_at": "2026-01-14T04:10:27.053903",
  "answer": ""
}