{
  "id": "q_364817",
  "mathoverflow_id": 364817,
  "url": "https://mathoverflow.net/questions/364817/questions-related-to-compact-complex-curves-symmetric-products-and-linear-indep",
  "title": "ag.algebraic geometry - Questions related to compact complex curves, symmetric products and linear independence",
  "body": "Let $X$ be a compact complex curve and let $L$ be a very ample line bundle over $X$ . Denote by $C_n( X )$ the configuration space of $n$ (ordered) distinct points on $X$ . Given distinct points $z_1$ , ..., $z_n$ on $X$ , so that they form an element in $C_n( X )$ , let $$p_1 = [ (z_2, ... ,z_n) ],$$ $$p_2 = [ (z_1, z_3, ..., z_n) ],$$ $$\\vdots$$ $$p_n = [ (z_1, z_2, ..., z_{n-1}) ]$$ in the symmetric product $\\operatorname{Sym}^{n-1}X$ of n-1 copies of X. Note that on the product $X^{n-1}$ of $n-1$ copies of $X$ , one can pullback $L$ using the first projection map, and so on, then pullback $L$ using the ( $n-1$ )-st projection map, and then tensor all these line bundles together. This defines a line bundle on $X^{n-1}$ , which descends to a line bundle on $\\operatorname{Sym}^{n-1}X$ . Let us denote the resulting line bundle, say, by $\\operatorname{Sym}^{n-1}( L )$ . Question 1: if $L$ is very ample, is $\\operatorname{Sym}^{n-1}( L )$ also very ample? (I would think so) If this is indeed the case, then $\\operatorname{Sym}^{n-1}( L )$ induces an embedding from $\\operatorname{Sym}^{n-1}X$ into a complex projective space, namely $$PH^0(\\operatorname{Sym}^{n-1}X, \\operatorname{Sym}^{n-1}( L ))^*,$$ the projectivization of the dual of the space of holomorphic sections of $\\operatorname{Sym}^{n-1}( L )$ ). Let us denote this embedding by $f$ . Question 2: Is it true that $f(p_1)$ , ..., $f(p_n)$ are linearly independent, as points in complex projective space? I have a feeling this is true. I also ask similar questions if $p_1,\\ldots,p_n$ are instead defined by: $$p_1 = [(z_1,\\ldots,z_1)],$$ $$p_2 = [(z_2,\\ldots,z_2)],$$ $$\\vdots$$ $$p_n = [(z_n,\\ldots,z_n)]$$ in $\\operatorname{Sym}^{n-1}X$ . I know that the answers to my questions are yes in the case where $X = P^1(\\mathbb{C})$ and $L = \\mathcal{O}(1)$ . Indeed, the linear independence statement amounts to the fact that the Lagrange basis (related to Lagrange interpolation) is linearly independent (so indeed a basis). And for the modified $p_i$ , this amounts to the well known fact that $n$ distinct points on a rational normal curve of degree $n-1$ in $P^{n-1}(\\mathbb{C})$ are linearly independent, itself equivalent to the non-vanishing of a Vandermonde determinant, from an algebraic point of view. I wonder if my statements still hold if $X$ is any compact complex curve of genus $g$ and if $L$ is any very ample line bundle on $X$ . ag.algebraic-geometry riemann-surfaces Share Cite Improve this question Follow edited Jul 6, 2020 at 20:58 asked Jul 4, 2020 at 10:07 Malkoun 5,387 17 17 silver badges 36 36 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry riemann-surfaces See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 12 A question on deformations of Theta divisor in the Jacobian of a complex curve 5 Hilbert scheme of points on a surface 4 Equations for points to lie on a rational normal curve 4 Proximity of solutions to system of degree two polynomials 3 Deformation Theoretic Interpretation of $H^1(C,T_C(-2p))$ 0 How to classify a plane complex curve? 4 Simple Closed Hyperbolic Geodesics on Punctured Spheres $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364817, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,riemann-surfaces,ag.algebraic-geometry,riemann-surfaces",
  "scraped_at": "2026-01-14T04:20:20.248778",
  "answer": ""
}