{
  "id": "q_364695",
  "mathoverflow_id": 364695,
  "url": "https://mathoverflow.net/questions/364695/an-analogue-of-noethers-problem-for-non-rational-varieties",
  "title": "ag.algebraic geometry - An analogue of Noether&#39;s Problem for non-rational varieties",
  "body": "For the sake of simplicity, let $\\mathsf{k}$ be algebraically closed and of zero characteristic. Varieties are irreducible. The (linear) Noether's Problem (which goes back to the early 1910's in Burnside's and Noether's work on invariants) is the following: let $V$ be a finite dimensional vector space, and $G \\subset GL(V)$ a finite group. When is the variety $V/G$ rational?. Now this problem is intrinsically very nice and has a miriad of applications to moduli questions (cf. C. Böhning https://arxiv.org/abs/0904.0899; J-L. Colliot-Thélène, J-J. Sansuc, The rationality problem for fields of invariants under linear algebraic groups MR2348904 ); PI-algebras (E. Formanek, The polynomial identities and invariants of n×n matrices, MR1088481); the inverse Galois problem (D. Saltman, Groups acting on fields: Noether’s problem, MR810657); etc. It is also interesting that the group actions that give a positive solution to Noether's Problem are very rich in nature. Some questions closely related to this Problem have arisen in my research, and I wonder if they are adressed in some paper, or anyone knows something about then. I thought about these questions, but I could only think of examples coming from elliptic curves (such as multiplication by $[n]$ map), but these are, to my taste, a little bit too 'simple'. (Q1): Let $X$ be a smooth projective curve of genus at least 1. What are the finite groups $G$ of $Aut_\\mathsf{k} \\, X$ such that $X/G$ is a smooth projective curves of the same genus? (Q2): Let $X$ be a non-rational variety and $G$ a finite group of $Aut_\\mathsf{k} \\, X$ . When $X/G$ is birationally equivalent to $X$ itself? Edit Both questions were already answered in the comments. The questions were not difficult in the end. ag.algebraic-geometry algebraic-curves birational-geometry invariant-theory Share Cite Improve this question Follow edited Jul 2, 2020 at 21:46 asked Jul 2, 2020 at 21:06 jg1896 3,766 12 12 silver badges 29 29 bronze badges $\\endgroup$ 8 2 $\\begingroup$ (Q1): If $X$ is a smooth projective curve, and $G$ a finite group acting on it, then $X/G$ is smooth projective curve. Using Riemann-Hurwitz formula one shows that Q1 can only hold when $X$ has genus $0$ (always) or genus $1$. $\\endgroup$ Evgeny Shinder –  Evgeny Shinder 2020-07-02 21:25:28 +00:00 Commented Jul 2, 2020 at 21:25 3 $\\begingroup$ For Q1, doesn't Riemann-Hurwitz imply that if genus is $>1$, the group has to be trivial? For the second, isn't it possible to take $X=Y\\times\\mathbb{P}^1$ for a non-stably rational $Y$ and take any finite subgroup of automorphisms of $\\mathbb{P}^1$, acting on the second factor? $\\endgroup$ Mohan –  Mohan 2020-07-02 21:25:55 +00:00 Commented Jul 2, 2020 at 21:25 $\\begingroup$ Thank you both. You properly answer my questions. $\\endgroup$ jg1896 –  jg1896 2020-07-02 21:44:58 +00:00 Commented Jul 2, 2020 at 21:44 1 $\\begingroup$ Q2 maybe becomes more interesting if you ask for X general type, rather than X non-rational... it's not immediately clear to me whether there should be an easy counterexample. $\\endgroup$ dhy –  dhy 2020-07-02 22:58:23 +00:00 Commented Jul 2, 2020 at 22:58 2 $\\begingroup$ @dhy Don’t general type varieties only have finitely many rat’l self-maps? It seems to me a general type example is thus impossible (bc iterating a self-map of positive degree would give infinitely many self-maps). $\\endgroup$ Daniel Litt –  Daniel Litt 2020-07-02 23:27:25 +00:00 Commented Jul 2, 2020 at 23:27  |  Show 3 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry algebraic-curves birational-geometry invariant-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 6 Elliptic curves over finite fields 9 Picard group of $\\mathfrak{M}_g$ 6 Rationality of the moduli space of genus g curves 11 Invariant theory in universal algebra 5 Generalizations of Chevalley–Shephard–Todd's Theorem? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364695, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,algebraic-curves,birational-geometry,invariant-theory,ag.algebraic-geometry,algebraic-curves,birational-geometry,invariant-theory",
  "scraped_at": "2026-01-14T04:20:02.225366",
  "answer": ""
}