{
  "id": "q_364043",
  "mathoverflow_id": 364043,
  "url": "https://mathoverflow.net/questions/364043/image-of-morphism-of-locally-of-finite-type-has-a-closed-point",
  "title": "ag.algebraic geometry - Image of morphism of locally of finite type has a closed point?",
  "body": "Let $S$ be finite dimensional locally Noetherian regular scheme. Let $f \\colon X \\rightarrow S$ be locally of finite type. Then $f(X) \\subset S $ contains a closed point of $S$ ? If it does, I'd like to know the proof. ag.algebraic-geometry Share Cite Improve this question Follow asked Jun 24, 2020 at 17:00 tukudani 81 6 6 bronze badges $\\endgroup$ 1 7 $\\begingroup$ Consider the case that $S$ is the spectrum of a DVR, and $X$ the spectrum of its field of fractions. $\\endgroup$ Angelo –  Angelo 2020-06-24 17:03:13 +00:00 Commented Jun 24, 2020 at 17:03 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 7 finite surjective l.c.i morphism is flat 9 Confusing definitions in Liu's Algebraic geometry and arithmetic curves? 25 When is an irreducible scheme quasi-compact? 8 Is a flat, locally finite type morphism open? 1 Condition for a morphism of stacks to be locally of finite type 1 Is finite union of locally closed subscheme, a scheme 0 Factorize a morphism into a morphism locally of finite type and a quasi-compact morphism $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364043, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,ag.algebraic-geometry",
  "scraped_at": "2026-01-14T04:18:22.182611",
  "answer": ""
}