{
  "id": "q_364543",
  "mathoverflow_id": 364543,
  "url": "https://mathoverflow.net/questions/364543/can-a-generic-rope-exert-the-same-force-as-a-rope-with-loops",
  "title": "co.combinatorics - Can a generic rope exert the same force as a rope with loops?",
  "body": "This is a spin-off of my previous question . I will take a moment to reintroduce the notation. The problem concerns elastic \"ropes\" in $\\mathbb{R}^3$ , which are modeled as sequences of points $\\gamma=(x_1,x_2,\\dots,x_m)$ . A rope is supported on the union of line segments $$ S(\\gamma) := \\bigcup_{j=1}^{m-1} \\overline{x_jx_{j+1}} \\subset\\mathbb{R}^3. $$ The $j$ -th segment of the rope has direction $$ \\tau_j := \\frac{x_{j+1} - x_j}{|x_{j+1}-x_j|}, $$ and the force $F_\\gamma$ associated to the rope $\\gamma$ is described by the vector-valued measure $$ F_\\gamma := \\sum_{j=1}^{m-1} \\tau_j (\\delta_{x_{j+1}} - \\delta_{x_j}). $$ This time I am curious about \"generic\" ropes $\\gamma$ . We say that $\\gamma$ is generic if the points $\\{x_1,x_2,\\dots,x_m\\}$ are in general position. That is, the points are all distinct, no three are collinear, and no four are coplanar. In particular, no two of the line segments $\\overline{x_jx_{j+1}}$ and $\\overline{x_kx_{k+1}}$ intersect except when $j=k+1$ or vice versa (so there are no loops in $S_\\gamma$ ). Question : Suppose that $\\gamma$ and $\\gamma'$ are two ropes with the same force, so that $F_\\gamma = F_{\\gamma'}$ . If $\\gamma$ is generic, does it follow that $\\gamma'$ is also generic? What I believe I can show is that, if $\\gamma'$ is not generic, it must have at least three loops. I would also be curious if there was a reasonable strengthening of the \"generic rope\" condition that satisfied this conjecture. So what I am really after is something like the question below. Question' Is there a set $S$ of \"good ropes\" that can be described explicitly with the following properties: For two ropes $\\gamma,\\gamma'$ with $\\gamma\\in S$ and $F_\\gamma=F_{\\gamma'}$ , $\\gamma'$ is guaranteed not to have any self-intersections (that is, $S(\\gamma')$ has no loops). The set $S$ is \"generic\" or at least \"dense\". For example, I am happy to consider only ropes that do not have any corners with angle $2\\pi/3$ , if that were to help at all. co.combinatorics discrete-geometry Share Cite Improve this question Follow edited Jul 1, 2020 at 3:53 asked Jun 30, 2020 at 22:05 felipeh 452 2 2 silver badges 9 9 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions co.combinatorics discrete-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 3 Problem about two elastic ropes in equilibrium Related 2 A question on Lusztig's `graph with automorphism' construction? 3 How many points are in such set with the same norm-2 8 Can two non-equivalent polytopes of same dimension have the same graph? 3 Problem about two elastic ropes in equilibrium $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364543, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "co.combinatorics,discrete-geometry,co.combinatorics,discrete-geometry",
  "scraped_at": "2026-01-14T04:19:48.823829",
  "answer": ""
}