{
  "id": "q_366113",
  "mathoverflow_id": 366113,
  "url": "https://mathoverflow.net/questions/366113/gelfand-kirillov-dimension-for-non-associative-algebras",
  "title": "reference request - Gelfand-Kirillov dimension for non-associative algebras",
  "body": "Let $A$ be any finitely generated algebra - non necessarely unital neither associative - over a base field $k$ . Let us denote the product $*$ . Suppose $A$ is finitely generated by $S$ , and introduce $A_1 = span \\langle S \\rangle$ if $A$ is not unital; $A_1 = span \\langle S \\rangle + k$ if it is unital. Let $A_n = A_{n-1} + \\sum_{v+u=n} A_u * A_v$ . The Gelfand-Kirillov dimension of $A$ is: $GK \\, A = lim \\, sup_{\\, n \\mapsto \\infty} \\frac{log \\, dim A_n}{log \\, n}$ . This invariant is thoroughly studied for associative algebras, such as in the classic book of Krause and Lenagan, [ Growth of algebras and Gelfand-Kirillov dimension (revised edition) ] . The Gelfand-Kirillov dimension for Lie algebras has also been considered for Lie algebras by V. Petrogradsky and others (cf. Krause and Lenagan [ op. cit. ] , Section 12.1). For Jordan algebras, I've found references in: C. Martinez, [ Gelʹfand-Kirillov dimension in Jordan algebras , MR1329537 ] (this paper also has one result on the Gelfand-Kirillov dimension of alternative algebras). C. Martinez, E. Zelmanov, [ Jordan algebras of Gelʹfand-Kirillov dimension one , MR1375577 ] In am interested in References for the Gelfand-Kirillov dimension of general non necessarely unital neither associative algebras; in particular, for the Gelfand-Kirillov dimension of alternative and Malcev algebras. The only work I know of that discuss things is this generality is Ufnarovskij [ Combinatorial and asymptotic methods in algebra , Algebra, VI, 1–196, Encyclopaedia Math. Sci., 57 MR1060321 ] , but it is somewhat outdated for this pourpuse. Any comments or references on this subject are very much welcomed. reference-request ra.rings-and-algebras non-associative-algebras Share Cite Improve this question Follow asked Jul 20, 2020 at 15:45 jg1896 3,766 12 12 silver badges 29 29 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request ra.rings-and-algebras non-associative-algebras See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 24 A matrix algebra has no deformations? 5 Gelfand-Kirillov dimension of generalized Weyl algebras 6 Integer Gelfand-Kirillov dimension 7 Survey of recent developments of the Gelfand-Kirillov dimension $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 366113, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,ra.rings-and-algebras,non-associative-algebras,reference-request,ra.rings-and-algebras,non-associative-algebras",
  "scraped_at": "2026-01-14T04:23:40.102917",
  "answer": ""
}