{
  "id": "q_365481",
  "mathoverflow_id": 365481,
  "url": "https://mathoverflow.net/questions/365481/logical-axioms-used-in-the-construction-of-counterexamples-to-isp",
  "title": "fa.functional analysis - Logical axioms used in the construction of counterexamples to ISP",
  "body": "In many cases, some problems are either solved in an affirmative way, or in a negative way. However, in some cases it turns out that some logical axioms lead to a proof of a certain statement, while other axioms can lead to the construction of counterexamples. A well known example is the Whitehead problem: using the axiom of constructibility $V=L$ , every Whitehead group can be shown to be free; using Martin's axiom and the negation of CH, examples of non-free Whitehead groups can be constructed. Now suppose that we can prove (maybe under ZFC?) that the invariant subspace problem (ISP) holds for all infinite dimensional complex Banach spaces. Then, this would mean that the construction of the counterexamples by, for instance, Enflo and Read, involves different axioms from the ones in the supposed proof. So my question is: which logical axioms have been used in the constructions by Enflo and Read that show the existence of operators with no nontrivial invariant subspaces for some non reflexive Banach spaces? fa.functional-analysis lo.logic banach-spaces operator-theory Share Cite Improve this question Follow asked Jul 12, 2020 at 16:46 Manuel Norman 1,195 2 2 gold badges 8 8 silver badges 13 13 bronze badges $\\endgroup$ 3 3 $\\begingroup$ I am almost certain that Read's construction on $\\ell_1$ works in ZFC and I am reasonably confident that Enflo's does. Note that the ISP is only interesting for separable Banach spaces, and is in some sense really a statement about separable subalgebras of B(E), so I do not see any reason to expect independence from ZFC $\\endgroup$ Yemon Choi –  Yemon Choi 2020-07-12 22:51:49 +00:00 Commented Jul 12, 2020 at 22:51 3 $\\begingroup$ Put it this way: if I want to \"suppose that we can prove (maybe under ZFC?) that the invariant subspace problem (ISP) holds for all infinite dimensional complex Banach spaces\" I think it would just be quicker for me to suppose 1=0 (ex falso quodlibet) $\\endgroup$ Yemon Choi –  Yemon Choi 2020-07-12 22:52:57 +00:00 Commented Jul 12, 2020 at 22:52 $\\begingroup$ Thank you very much! $\\endgroup$ Manuel Norman –  Manuel Norman 2020-07-13 06:22:00 +00:00 Commented Jul 13, 2020 at 6:22 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions fa.functional-analysis lo.logic banach-spaces operator-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 2 About logical axioms of propositional logic. 23 Nice algebraic statements independent from ZF + V=L (constructibility) 4 Martingale-cotype vs cotype on super-reflexive spaces 16 What (classes of) Banach spaces are known to have Schauder basis? 2 A question about consistent fragments of formalized mathematical theories with Natural Deduction 3 Can a non-free Whitehead group embed as a discrete subgroup of a normed space? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365481, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "fa.functional-analysis,lo.logic,banach-spaces,operator-theory,fa.functional-analysis,lo.logic,banach-spaces,operator-theory",
  "scraped_at": "2026-01-14T04:22:20.322269",
  "answer": ""
}