{
  "id": "q_365906",
  "mathoverflow_id": 365906,
  "url": "https://mathoverflow.net/questions/365906/roots-of-determinant-of-matrix-with-polynomial-entries-a-generalization",
  "title": "reference request - Roots of determinant of matrix with polynomial entries — a generalization",
  "body": "For $1 \\le i, j \\le k$ , consider $\\rho_{ij}$ which are equal to either zero or one such that $\\rho_{ii}=1$ and $\\rho_{ij}=0$ if and only if $\\rho_{ji}=0$ . How to find the zeros of the determinant of the following matrix? $$\\begin{bmatrix} g_1(x) & -\\rho_{12}f_1(x) & \\cdots & -\\rho_{1,k}f_1(x) \\\\ -\\rho_{21}f_2(x) & g_2(x) & \\cdots & -\\rho_{2,k}f_2(x) \\\\ \\vdots & \\vdots & \\ddots & \\vdots \\\\ -\\rho_{k1}f_k(x) & -\\rho_{k2}f_k(x) & \\cdots &g_k(x) \\end{bmatrix}$$ where $f_i$ s are $g_i$ s are complex polynomials. When all the $\\rho_{ij}=1$ , I have got the answer in MO already at Roots of determinant of matrix with polynomial entries . The present question is a more general case. I am not sure whether there is any direct answer to this question. I am looking for some reference where similar kinds of problems ars discussed. reference-request matrices polynomials determinants zeroes Share Cite Improve this question Follow edited Jul 18, 2020 at 10:17 Rodrigo de Azevedo 2,653 3 3 gold badges 18 18 silver badges 37 37 bronze badges asked Jul 18, 2020 at 1:29 GA316 1,329 11 11 silver badges 26 26 bronze badges $\\endgroup$ 1 1 $\\begingroup$ You can get an inequality using this . $\\endgroup$ Rodrigo de Azevedo –  Rodrigo de Azevedo 2020-07-18 12:11:28 +00:00 Commented Jul 18, 2020 at 12:11 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request matrices polynomials determinants zeroes See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 2 Roots of determinant of matrix with polynomial entries Related 5 Determinant of block tridiagonal matrices 11 Determinant of a certain Vandermonde matrix 2 The structure of the $n$-th power of a special matrix 8 Determinant of a matrix having diagonal and subdiagonal entries zero 11 yet another determinant and inverse of a matrix 6 Is there a formula for the determinant of a block matrix of this kind? 4 A (bi)alternant formula for Wronskian $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365906, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,matrices,polynomials,determinants,zeroes,reference-request,matrices,polynomials,determinants,zeroes",
  "scraped_at": "2026-01-14T04:25:10.302558",
  "answer": ""
}