{
  "id": "q_365295",
  "mathoverflow_id": 365295,
  "url": "https://mathoverflow.net/questions/365295/nullity-of-the-linking-matrix-of-a-framed-link-l-equals-the-first-betti-number",
  "title": "at.algebraic topology - Nullity of the linking matrix of a framed link $L$ equals the first betti number of the manifold obtained by surgery on $L$",
  "body": "I have asked this on mathstackexchange as well. I'm not necessarily asking for a proof, just a hint or a point to the right direction (although I'm not saying that a proof isn't welcome). I'm studying Witten invariants and I have come across a statement that most books agree that it's not hard to see. Anyway this is the question and my progress so far. Let $L$ be a framed link of $m$ components and $(L_i,f_i)$ be the component-framing pair. The linking matrix $A=[a_{i,j}]$ where $a_{i,i}=f_i$ and $a_{i,j}=lk(L_i,L_j)$ when $i\\ne j$ . I have read that this matrix is a presentation matrix for the first homology group $H_1(M; \\Bbb Z)$ and that the nullity of $A$ is equal to the first betti number of $M$ , where $M$ is the 3-manifold obtained from $S^3$ by surgery on $L$ . Can someone explain this fact to me or point me to a proof or a reference? EDIT: I am reading Nicolaescu's Reidemeister Torsion of 3-manifolds p.77 and there I made some progress but I have some question's as well. Suppose the $c_i$ are the meridians of the solid tori we glue back on the link complement $E$ to obtain $M$ . This means that we send $c_i \\to f_iμ_i + λ_i$ , where $μ_i, λ_i$ are the meridians and longitudes in the regular neighbourhood of $L$ . It is clear to me that $μ_i$ form a basis for $H_1(E)$ and taking $K$ to be the free abelian generated by the $c_i$ 's and sending them to $f_iμ_i + λ_i$ we have a morphism $K \\to H_1(E)$ with matrix the linking matrix mentioned above. There Nicolaescu says that by taking the natural map $a:H_1(E) \\to H_1(M)$ we complete the presentation as this map is onto. Here is when it's unclear to me. By $a$ I guess he means the map that sends $μ_i $ in $E$ to $μ_i $ in $M$ . If this is the case then I don't understand why it's onto and while it's clear to me that the $f_iμ_i + λ_i$ 's will be in the kernel because now they bound a disk in $M$ I don't see why they should generate it. at.algebraic-topology gt.geometric-topology knot-theory Share Cite Improve this question Follow asked Jul 10, 2020 at 9:15 Amontillado 101 5 5 bronze badges $\\endgroup$ 2 $\\begingroup$ Hello Amontillado. It appears that you asked this question on math.SE less than 24 hours ago, and I think you should give more time for people to reply there. You could also include the link in your question. Also, I don't think that this question is appropriate here (but I'm very biased). $\\endgroup$ Marco Golla –  Marco Golla 2020-07-10 12:04:06 +00:00 Commented Jul 10, 2020 at 12:04 $\\begingroup$ That's ok, If there is a problem I will delete the question. It's that recently I have not been getting a lot of answers from SE and I was wondering if someone here could help me. $\\endgroup$ Amontillado –  Amontillado 2020-07-10 12:19:47 +00:00 Commented Jul 10, 2020 at 12:19 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions at.algebraic-topology gt.geometric-topology knot-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 11 Do the results of (1/n)-surgery determine the link?... 2 Induced Map on Sp(2g,Z) is surjective 13 Fox differential calculus and the Alexander invariant of a link 11 Relation between the Alexander module of a link and intermediate free abelian covers 3 Linking number a complete invariant of link homotopy 1 Signature/nullity function for a link obtained by parallel pushoffs of a knot? 7 What are these 3-manifolds from surgery? 10 What are the possible linking matrices of a quasi-positive link? 10 Presentations of mapping class groups in dimension $3$ $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365295, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "at.algebraic-topology,gt.geometric-topology,knot-theory,at.algebraic-topology,gt.geometric-topology,knot-theory",
  "scraped_at": "2026-01-14T04:21:08.510137",
  "answer": ""
}