{
  "id": "q_365726",
  "mathoverflow_id": 365726,
  "url": "https://mathoverflow.net/questions/365726/continuity-of-conformal-grafting-wrt-the-infinite-type-surface",
  "title": "gt.geometric topology - Continuity of conformal grafting, wrt the (infinite type) surface",
  "body": "Say I have two closed hyperbolic surfaces $X,Y$ and a smooth, $(1+\\epsilon)$ -bilipschitz map $f : X \\to Y$ for some small $\\epsilon$ . Pick a simple closed curve $c \\subset X$ , and let $X',Y'$ be the results of `length t conformal grafting' along $c$ and $f(c)$ , respectively. (Namely, we cut $X$ along $c$ , patch in a Euclidean annulus of length $t$ , and then uniformize to get another hyperbolic surface, and we do something similar on $Y$ to get $Y'$ .) Then $X',Y'$ are also metrically close, since you can use $f$ to construct a quasiconformal map from one to the other that has small dilatation, and nearly conformal hyperbolic surfaces are nearly isometric. (Essentially since you can take limits and use that conformal maps $D \\to D$ are hyperbolic isometries.) So what if I now have infinite type surfaces? Let's say $(X,x),(Y,y)$ are two pointed hyperbolic surfaces (possibly infinite type) that are close, meaning that for some large $R$ , there are subsets $A\\subset X$ and $B\\subset Y$ containing the $R$ -balls around $x$ and $y$ , and a $(1+\\epsilon)$ -bilipschitz map $f : A \\to B$ with $f(x)=y$ , for some small $\\epsilon$ . Say I do length $t$ conformal grafting on some curve $c$ that's close to $x$ , and on its $f$ -image in $Y$ . Are the resulting surfaces $X',Y'$ close, in the sense that large hyperbolic neighborhoods around their basepoints are close? You can construct quasiconformal maps between $A \\cup \\text{ (annulus)}$ and $B \\cup \\text{(annulus)}$ using $f$ , just like before, but the problem I have is saying that the these sets contain large radius hyperbolic balls around the basepoints after uniformization . Any thoughts on this from the grafting gurus? Thanks in advance. gt.geometric-topology mg.metric-geometry hyperbolic-geometry conformal-geometry quasiconformal Share Cite Improve this question Follow edited Jul 15, 2020 at 19:22 asked Jul 15, 2020 at 19:15 biringer 552 2 2 silver badges 10 10 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions gt.geometric-topology mg.metric-geometry hyperbolic-geometry conformal-geometry quasiconformal See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 20 Finding Constant Curvature Metrics on Surfaces without full power of Uniformization 18 A question about the proof of Mostow rigidity 4 Pseudoanosov mapping torus and length of curves. 5 Adding segments to an annulus - a question regarding the conformal modulus 2 Euclidean length of hyperbolic geodesics for annuli with bounded geometry $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365726, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "gt.geometric-topology,mg.metric-geometry,hyperbolic-geometry,conformal-geometry,quasiconformal,gt.geometric-topology,mg.metric-geometry,hyperbolic-geometry,conformal-geometry,quasiconformal",
  "scraped_at": "2026-01-14T04:22:49.504301",
  "answer": ""
}