{
  "id": "q_365751",
  "mathoverflow_id": 365751,
  "url": "https://mathoverflow.net/questions/365751/mean-curvature-for-codimension-1",
  "title": "reference request - mean curvature for codimension $&gt;1$?",
  "body": "The mean curvature of a hypersurface in a Riemannian manifold is defined to be the trace of the second fundamental form. I was curious, does the notion of mean curvature generalise to higher codimension objects, if so how is this defined? If not, how come this notion does not make much sense in higher codimensions? Any reference or explanation is appreciated, thank you. reference-request dg.differential-geometry riemannian-geometry curvature Share Cite Improve this question Follow asked Jul 16, 2020 at 6:27 Johnny T. 3,773 1 1 gold badge 17 17 silver badges 32 32 bronze badges $\\endgroup$ 3 5 $\\begingroup$ It is defined as the trace of the second fundamental form, but the second fundamental form is normal bundle valued. And usually you scale by the inverse of the dimension of the submanifold. $\\endgroup$ Sebastian –  Sebastian 2020-07-16 06:52:37 +00:00 Commented Jul 16, 2020 at 6:52 $\\begingroup$ Thank you. do you happen to have reference by any chance? $\\endgroup$ Johnny T. –  Johnny T. 2020-07-16 07:15:49 +00:00 Commented Jul 16, 2020 at 7:15 3 $\\begingroup$ Chapter 5.C in the Riemannian geometry book of Gallot-Hulin-Lafontaine. $\\endgroup$ Sebastian –  Sebastian 2020-07-16 08:46:00 +00:00 Commented Jul 16, 2020 at 8:46 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request dg.differential-geometry riemannian-geometry curvature See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 5 The mean curvature of a hypersurface 26 Intuition for mean curvature 15 Scalar curvature notion for Cartan connections 2 Limited expansion of mean curvature of geodesic spheres 2 Curvature of singular Riemannian metric 6 Quantitative upper bound on mean curvature of an isometric embedding 0 Handling degenerate planes in pseudo-Riemannian geometry: impact on sectional curvature and comparison theorems $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365751, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,dg.differential-geometry,riemannian-geometry,curvature,reference-request,dg.differential-geometry,riemannian-geometry,curvature",
  "scraped_at": "2026-01-14T04:22:54.281148",
  "answer": ""
}