{
  "id": "q_368931",
  "mathoverflow_id": 368931,
  "url": "https://mathoverflow.net/questions/368931/counting-the-number-of-simple-labelled-bipartite-graphs-with-edges-su",
  "title": "enumerative combinatorics - Counting the number of simple labelled bipartite graphs &#119866;&#119899;,&#119898; with &#119896; edges such that &#119889;1 vertices have degree 1",
  "body": "I have tried to count the number of simple labelled bipartite graphs $G_{n,m}$ with $k$ edges such that $d_1$ vertices have degree 1. Has this problem been studied? So far the only related paper I found shows a generating function to count all simple labelled graphs where monovalent vertices are represented by u: $M(u,x) = \\sum_{k \\geq 0} \\frac{x^k}{k!}2^{{k\\choose 2}}(e^{ux})^{k}e^{u^2x^2/2}$ This paper also has some results on bipartite graphs, but as I'm not familiar with generating functions, I don't know how to adapt these results to my original problem. Any help would be appreciated. enumerative-combinatorics generating-functions bipartite-graphs Share Cite Improve this question Follow edited Aug 12, 2020 at 6:04 asked Aug 12, 2020 at 5:39 Helene 21 2 2 bronze badges $\\endgroup$ 2 1 $\\begingroup$ do you want any bipartite graphs or connected bipartite graphs? $\\endgroup$ vidyarthi –  vidyarthi 2020-08-12 09:24:24 +00:00 Commented Aug 12, 2020 at 9:24 $\\begingroup$ any bipartite graphs $\\endgroup$ Helene –  Helene 2020-08-12 23:33:39 +00:00 Commented Aug 12, 2020 at 23:33 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions enumerative-combinatorics generating-functions bipartite-graphs See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 10 Counting non-isomorphic graphs with prescribed number of edges and vertices 21 A strange sum over bipartite graphs 7 How many $40$-vertex cubic bipartite graphs have determinant $\\pm 3$? 2 Two from cubic subgraph hardness 5 Bipartite graph with exactly one perfect matching $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368931, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "enumerative-combinatorics,generating-functions,bipartite-graphs,enumerative-combinatorics,generating-functions,bipartite-graphs",
  "scraped_at": "2026-01-14T04:28:36.644046",
  "answer": ""
}