{
  "id": "q_365703",
  "mathoverflow_id": 365703,
  "url": "https://mathoverflow.net/questions/365703/secondary-operations-in-hp",
  "title": "reference request - Secondary operations in $H^*P$",
  "body": "I would be very grateful for any answer to this or pointing at a reference. Let $P$ be the infinite dimensional real projective space and $\\Phi_{j,j}$ be the Adams operation based on the Adem relation for $Sq^{2^j}Sq^{2^j}$ . I wonder what are the known examples of computing the action of these operations on $H^*P$ . More specifically, I would like to know the action of this operation on $H^{2^{j+1}}P$ . From the Hopf invariant one result, I can read off that the action of $\\Phi_{j,j}$ for small values of $j$ is trivial. But, how can I understand the other ones? reference-request at.algebraic-topology Share Cite Improve this question Follow edited Jul 16, 2020 at 9:20 asked Jul 15, 2020 at 14:59 user51223 3,253 17 17 silver badges 25 25 bronze badges $\\endgroup$ 3 1 $\\begingroup$ Maybe try John Harper's book Secondary Cohomology Operations pg. 147 onwards. Especially Pr. 5.3.5. $\\endgroup$ Tyrone –  Tyrone 2020-07-15 23:17:24 +00:00 Commented Jul 15, 2020 at 23:17 $\\begingroup$ @Tyrone Thank you for reminding of the book. I will take a look! $\\endgroup$ user51223 –  user51223 2020-07-16 07:37:32 +00:00 Commented Jul 16, 2020 at 7:37 $\\begingroup$ @Tyrone I like to add that the aforementioned Proposition in your comment is about evaluation of $\\phi_{0,j}$. But, thanks for reminding of this and of the book. $\\endgroup$ user51223 –  user51223 2020-07-18 14:33:07 +00:00 Commented Jul 18, 2020 at 14:33 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request at.algebraic-topology See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 6 Image of J splitting 9 Infinite families in stable homotopy groups 9 \"Standard arguments\" in Mahowald's eta_j paper 8 Generalization of Hopf invariant 7 Relation between cohomology operations and the Adams spectral sequence 9 Adams-Hilton for $ \\Omega \\mathbb{CP}^2$ $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365703, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,at.algebraic-topology,reference-request,at.algebraic-topology",
  "scraped_at": "2026-01-14T04:22:47.255264",
  "answer": ""
}