{
  "id": "q_365843",
  "mathoverflow_id": 365843,
  "url": "https://mathoverflow.net/questions/365843/boundary-differences-in-two-graphs",
  "title": "co.combinatorics - Boundary differences in two graphs",
  "body": "Let $\\Gamma, \\Xi$ be two graphs with the same set of vertices $V$ with $n$ elements. Assume $\\Gamma$ is connected. Write $\\Gamma\\cup \\Xi$ (or $\\Gamma\\cap \\Xi$ ) for the graph whose set of edges is the union (or, correspondingly, the intersection) of the sets of edges of $\\Gamma$ and $\\Xi$ . Given $S\\subset V$ , write $\\partial_\\Gamma S$ for the set of all $v\\in V\\setminus S$ such that there is a $w\\in S$ for which $\\{v,w\\}$ is an edge in $\\Gamma$ . Under what conditions is it the case that there must be a subset $S\\subset V$ such that (a) $S$ is connected in $\\Gamma \\cup \\Xi$ and (b) $\\partial_\\Gamma S\\setminus (\\partial_{\\Gamma\\cap \\Xi} S)$ is large? (\"Large\" here may mean \"having at least $\\epsilon n$ elements\".) The \"conditions\" I'm looking for here would be local. For instance, for $\\Xi$ an empty graph, it is enough to require the degree of every vertex in $\\Gamma$ to be $\\geq 3$ . (See Existence of connected component with large boundary? ) co.combinatorics graph-theory extremal-graph-theory extremal-combinatorics Share Cite Improve this question Follow asked Jul 17, 2020 at 9:46 H A Helfgott 22.1k 4 4 gold badges 49 49 silver badges 143 143 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions co.combinatorics graph-theory extremal-graph-theory extremal-combinatorics See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 3 Existence of connected component with large boundary? Related 8 Which graphs embedded in surfaces have symmetries acting transitively on vertex-edge flags? 3 Existence of connected component with large boundary? 2 Connected sets with a large boundary in a privileged set 6 Existence of connected set with large edge boundary 9 Minimum number of edges in a certain graph $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 365843, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "co.combinatorics,graph-theory,extremal-graph-theory,extremal-combinatorics,co.combinatorics,graph-theory,extremal-graph-theory,extremal-combinatorics",
  "scraped_at": "2026-01-14T04:23:14.957411",
  "answer": ""
}