{
  "id": "q_36071",
  "mathoverflow_id": 36071,
  "url": "https://mathoverflow.net/questions/36071/how-to-partially-uniformize-a-deck-by-partial-shuffles",
  "title": "pr.probability - How to partially uniformize a deck by partial shuffles?",
  "body": "This question is a variant of a previous one ; it was originally a posed as an edit of this former question, but I came to think it could be more suitable to pose it anew. Assume I have a deck of cards that I would like to shuffle. Unfortunately, the deck is so big that I cannot hold it entirely in my hands. Let's say that the deck contains M cards, and that the operation I can perform are: 1. cut (deterministically) a deck into any number of sub-decks, without looking at the cards but remembering for all i where the i-th card from top of the original deck has been put; 2. gather several decks into one deck in any order (but assume that we do not intertwin the various decks, nor change the order inside any of them); 3. shuffle any deck of at most n cards. Assume moreover that such a shuffle consist in applying an unknown random permutation drawn uniformly. Due to arithmetic arguments, it is not possible to achieve uniform distribution over all permutations of the original deck by such shuffles (see David Speyer's answer to the question above). However, one can can consider partial uniformity as follows. Call a random permutation of $\\{1,\\ldots,M\\}$ $r$-uniform if the law of $((a_1),\\ldots,(a_r))$ is uniform for all tuples $(a_1,\\ldots,a_r)$ of $\\{1,\\ldots,M\\}$. Then, what is the maximal such $r$ that can be achieved by a process as described above? Given a $r$, how many shuffles are needed to achieve $r$-uniformity? Note that this measure of uniformity makes sense for the game Race for the galaxy, since some subsets of cards play well together, and one wants to break the artificial weight given when playing a game to the event that such cards are close. Here is a first thing one can say: if $M=2n$ and $n$ is even, then it is possible to achieve $1$-uniformity in $4$ partial shuffles. Simply cut the deck in two equal sub-decks, shuffle both, gather them, divide the result into a sub-deck containing the first and third quarters and another containing the second and fourth quarters, shuffle both, and gather them. At the end, each individual card has random distribution. pr.probability Share Cite Improve this question Follow edited Apr 13, 2017 at 12:58 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Aug 19, 2010 at 10:50 Benoît Kloeckner 14.7k 1 1 gold badge 64 64 silver badges 110 110 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions pr.probability See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 76 Does War have infinite expected length? 3 Random generation of subsets using conditional probabilities 15 How to shuffle a deck by parts? 1 Expected position of a card in a deck after repeating a procedure 15 Card game / options pricing / Brownian bridge question 13 Probability of having a \"perfect\" game of Set 18 Does erosion mix faster than a riffle shuffle? 8 Geometry description of the GSR riffle shuffle model 2 Worst-case number of single-card insertions to force Player 1 to be the unique winner in Texas Hold’em $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 36071, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "pr.probability,pr.probability",
  "scraped_at": "2026-01-14T04:10:49.519290",
  "answer": ""
}