{
  "id": "q_364034",
  "mathoverflow_id": 364034,
  "url": "https://mathoverflow.net/questions/364034/stewarts-formula-in-plane-geometry",
  "title": "Stewart&#39;s formula in plane geometry",
  "body": "In his book \"Plane geometry and its groups\", H. Guggenheimer proves the Stewart's formula: If $A$ , $B$ , and $C$ are collinear, then for any point $Ρ$ in the plane $$ PA^2 BC + PB^2 CA + PC^2 AB + AB . BC . CA = 0. $$ and states that Stewart's formula [...], in principle, solves all computational problems in plane geometry. What does he mean ? How do we solve all computational problems in plane geometry using that formula? I understand that, for example, formulas given by the Gram determinant of the inner product of vectors are fundamental in the sense that two sets of vectors can be deduced from each other using an isometry if and only if these Gram determinants are the same, and this statement can be interpreted in terms of Invariant Theory. But I fail to find such an interpretation to Stewart's formula. What is the justification to his bold statement? mg.metric-geometry plane-geometry Share Cite Improve this question Follow asked Jun 24, 2020 at 14:08 coudy 20.2k 5 5 gold badges 82 82 silver badges 142 142 bronze badges $\\endgroup$ 3 1 $\\begingroup$ It possibly just means that many problems reduce to finding the fifth member of the set $\\{PA,PB,PC,AB,AC\\}$ given that other four are known. Another interpretation is that Stewart's formula is universal in a philosophical sense: it is an equivalent substitute to Cartesian coordinates, which are universal in the usual sense. $\\endgroup$ Fedor Petrov –  Fedor Petrov 2020-06-24 14:32:02 +00:00 Commented Jun 24, 2020 at 14:32 1 $\\begingroup$ can't you say the same about Pythagoras? (since Pythagoras --> law of cosines --> Stewart) $\\endgroup$ Carlo Beenakker –  Carlo Beenakker 2020-06-24 17:02:38 +00:00 Commented Jun 24, 2020 at 17:02 $\\begingroup$ mathoverflow.net/questions/234184/… $\\endgroup$ Đào Thanh Oai –  Đào Thanh Oai 2020-06-26 02:05:20 +00:00 Commented Jun 26, 2020 at 2:05 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions mg.metric-geometry plane-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 6 Relation of some Euclidean geometry theorems and more conjecture generalizations Related 3 Finding the union of N random circles arbitrarily (or conspiratorially) placed on a two-dimensional surface 7 Computer power in plane geometry 11 Geometric interpretation of matrix minors 6 Delaunay triangulations and convex hulls 27 Definition of area 9 There is no arcwise isometry from a high dimensional manifold into a low dimensional manifold 2 Checking planar convexity of 4 points with Stewart's formula 9 Possible new theorem in plane geometry encompassing 5 famous geometry theorems 3 Generalization of some plane geometry theorems $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364034, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "mg.metric-geometry,plane-geometry,mg.metric-geometry,plane-geometry",
  "scraped_at": "2026-01-14T04:18:17.734905",
  "answer": ""
}