{
  "id": "q_363839",
  "mathoverflow_id": 363839,
  "url": "https://mathoverflow.net/questions/363839/are-positivity-for-forms-and-that-for-currents-consistent-when-talking-about-smo",
  "title": "complex geometry - Are positivity for forms and that for currents consistent when talking about smooth forms?",
  "body": "Let $X$ be a complex manifold and $\\theta$ a smooth $(1,1)$ -form on $X$ . (1) If $\\theta>0$ in the sense of currents, then can we deduce that $\\theta>0$ in the sense of forms? (2) If $\\theta>0$ in the sense of forms, then can we deduce that $\\theta>0$ in the sense of currents? complex-geometry geometric-measure-theory Share Cite Improve this question Follow asked Jun 22, 2020 at 15:20 jack lion 391 2 2 silver badges 7 7 bronze badges $\\endgroup$ 1 1 $\\begingroup$ You should be more specific about what you mean by \"> 0\" for currents and forms. Do you mean > 0 as in strictly positive? In that case I would interpret \"> 0 in the sense of currents\" as \\theta >= \\epsilon \\omega for some smooth strictly positive (1,1)-form \\omega and \\epsilon > 0, and if \\theta is smooth, then then it is trivial that these notions of positivity are equal. If you mean \"> 0\" as in non-negative, then there are positive and strongly positive (k,k) forms and currents, but for a smooth (1,1)-form, all these notions of positivity coincide. $\\endgroup$ Richard Lärkäng –  Richard Lärkäng 2020-06-23 08:39:34 +00:00 Commented Jun 23, 2020 at 8:39 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions complex-geometry geometric-measure-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 2 Positivity of forms 2 Is a certain composition of harmonic forms again harmonic? 9 Different notions of convergence of complex subvarieties 4 normal form of currents? 12 Bott Chern cohomology via currents 1 Bott-Chern cohomology for singular complex spaces $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 363839, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "complex-geometry,geometric-measure-theory,complex-geometry,geometric-measure-theory",
  "scraped_at": "2026-01-14T04:17:57.214597",
  "answer": ""
}