{
  "id": "q_364074",
  "mathoverflow_id": 364074,
  "url": "https://mathoverflow.net/questions/364074/how-to-combine-two-d-degenerate-subgraphs-into-a-d-degenerate-graph",
  "title": "co.combinatorics - How to combine two $d$-degenerate subgraphs into a $d$-degenerate graph?",
  "body": "A graph is $d$ -degenerate if every its subgraph has a vertex of degree at most $d$ . Suppose that $G$ is a graph and $G_1,G_2$ are two subgraphs of $G$ that are $d$ -degenerate. Is there any way to efficiently decide whether the subgraph induced by $V(G_1)\\cup V(G_2)$ is still $d$ -degenerate? Furthermore, if $|V(G_1)\\cap V(G_2)|$ is bounded by a constant, then is there any sufficient / necessary condition mainly relative to the structures of $G_1$ and $G_2$ so that $V(G_1)\\cup V(G_2)$ induces a $d$ -degenerate graph? In order to make my quesion more precise, I expain it by an example when $d=1$ . Let $S=V(G_1)\\cap V(G_2)$ . If $|S|=1$ , then it is trivial that $V(G_1)\\cup V(G_2)$ induces a $1$ -degenerate graph (forest)? If $|S|\\geq 2$ , we just need to test the following for each pair of non-adjacent vertices $u,v\\in S$ , and then can decide whether $V(G_1)\\cup V(G_2)$ induces a forest. ( $\\star$ ) whether $u,v$ are in a same tree-componment of $G_1$ , and meanwhile in a same tree-componment of $G_2$ ? if the answer is YES for some pair of $u$ and $v$ , then there is a $(u,v)$ -path in $G_1$ , and another $(u,v)$ -path in $G_2$ , impying the existence of a cycle in $G$ , and thus $V(G_1)\\cup V(G_2)$ does not induce a forest; if the answer is NO for every pair of $u$ and $v$ , then $V(G_1)\\cup V(G_2)$ induces a forest. Therefore, while deciding whether $V(G_1)\\cup V(G_2)$ induces a forest, we do not much care about vertices in $V(G_1)\\setminus S$ and $V(G_2)\\setminus S$ , and just need to test the \"local structure\" of vertices in $S$ . So my previous question, in other words, is whether we can do something similar for $d\\geq 2$ , i.e, how to decide whether $V(G_1)\\cup V(G_2)$ induces a $d$ -degenerate graph just based on the \"local structure\" of vertices in $V(G_1)\\cap V(G_2)$ . co.combinatorics graph-theory Share Cite Improve this question Follow edited Jun 25, 2020 at 15:25 asked Jun 25, 2020 at 1:54 Xin Zhang 1,210 6 6 silver badges 11 11 bronze badges $\\endgroup$ 4 2 $\\begingroup$ Can you precise what you mean by \"efficiently decide\"? Deciding if a graph is $d$-degenerate is easy, no? It suffices to remove any vertex of degree at most d and then check inductively if the remaining graph is d-degenerate (and if at any point the graph under consideration has minimum degree $>d$ then the answer is negative). $\\endgroup$ Louis Esperet –  Louis Esperet 2020-06-25 09:12:45 +00:00 Commented Jun 25, 2020 at 9:12 $\\begingroup$ Thanks for your comments. I edited my question and described what I mean by \"efficiently decide\". Actually, I want to decide whether $V(G_1)\\cup V(G_2)$ induces a $d$-degenerate graph only based on the \"local structure\" of vertices in $V(G_1)\\cap V(G_2)$, without testing the existence of a $d$-degenerate ordering of $V(G_1)\\cup V(G_2)$. $\\endgroup$ Xin Zhang –  Xin Zhang 2020-06-25 13:08:02 +00:00 Commented Jun 25, 2020 at 13:08 $\\begingroup$ It's easy to write down examples where the union is or is not $d$-degenerate that have no edges between vertices in the intersection. Does that answer the question? $\\endgroup$ Ben Barber –  Ben Barber 2020-06-26 09:39:02 +00:00 Commented Jun 26, 2020 at 9:39 $\\begingroup$ Many thanks but I don't quite undertand your answer. Actually, I want to have an algorithm to decide whether the union is or is not $d$-degenerate that just uses the information of the intersection. So I think examples are not enough for me... $\\endgroup$ Xin Zhang –  Xin Zhang 2020-06-26 13:18:38 +00:00 Commented Jun 26, 2020 at 13:18 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions co.combinatorics graph-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 1 Non-toroidality of a simple graph 2 Partition of a graph into subgraphs with small maximum degree 1 A combinatorial identity on even spanning subgraphs in the Erdös-Renyi random graph with relations to the Ising model 3 Chromatic number of a family of graphs 1 Covering a connected bounded-degree bipartite graph with connected subgraphs $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364074, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "co.combinatorics,graph-theory,co.combinatorics,graph-theory",
  "scraped_at": "2026-01-14T04:19:35.407874",
  "answer": ""
}