{
  "id": "q_364462",
  "mathoverflow_id": 364462,
  "url": "https://mathoverflow.net/questions/364462/notation-question-bigraded-direct-sum-of-graded-objects",
  "title": "at.algebraic topology - Notation question: bigraded direct sum of graded objects",
  "body": "In some work I'm doing I have two graded modules $M$ and $N$ (graded on $\\mathbb Z$ , say) and need to take, not the usual direct sum, but the bigraded sum consisting of all $M_p \\oplus N_q$ (so graded on $\\mathbb Z \\oplus \\mathbb Z$ ). For the graded sum I would simply write $M\\oplus N$ . Before I make up a notation for the bigraded sum, is there an already existing notation that anyone has used or seen? I'm not sure what tags to include on this question, feel free to criticize. I've tried to tag the communities that might have run into this before. at.algebraic-topology ac.commutative-algebra homological-algebra notation Share Cite Improve this question Follow edited Jun 29, 2020 at 22:01 RobPratt 5,784 1 1 gold badge 16 16 silver badges 27 27 bronze badges asked Jun 29, 2020 at 21:33 Steve Costenoble 2,152 1 1 gold badge 13 13 silver badges 23 23 bronze badges $\\endgroup$ 1 $\\begingroup$ I would denote this $\\boxtimes$, the external tensor product. If you treat graded objects as weight decomposition of some $\\mathbb{G}_m$ action, then this bigraded sum is indeed the external tensor product of two representations of $\\mathbb{G}_m$ as a representation of $\\mathbb{G}_m \\times \\mathbb{G}_m$. I don't know if anyone have used this notation, though. $\\endgroup$ Grisha Papayanov –  Grisha Papayanov 2020-07-03 04:20:31 +00:00 Commented Jul 3, 2020 at 4:20 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions at.algebraic-topology ac.commutative-algebra homological-algebra notation See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 55 Bizarre operation on polynomials 6 Names of noncompact riemannian symmetric spaces? 6 Krull-Schmidt Analogue for Complete / Graded Rings 3 Metabolic vs stably metabolic 7 On describing a sort of \"well-behaved\" subgroups of a free abelian group 6 If a quotient ring is a projective module then the ideal is principal 8 Global to local principle for f.g. $\\mathbb{Z}[x]$ modules 3 Hilbert's Syzygy Theorem in the bigraded case $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 364462, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "at.algebraic-topology,ac.commutative-algebra,homological-algebra,notation,at.algebraic-topology,ac.commutative-algebra,homological-algebra,notation",
  "scraped_at": "2026-01-14T04:19:46.583126",
  "answer": ""
}