{
  "id": "q_368257",
  "mathoverflow_id": 368257,
  "url": "https://mathoverflow.net/questions/368257/on-the-dual-version-of-an-isomorphism-of-spectral-sequence-term-from-cartan-and",
  "title": "reference request - On the dual version of an isomorphism of spectral sequence term (from Cartan and Eilenberg)",
  "body": "I'm trying to take spectral sequences as a black box for application in commutative algebra and I admit that I haven't really gone through (or understand) all the proofs of all the isomorphisms between various terms of a spectral sequence and respective cohomologies assuming some term of the sequences are zero. So in this post, my question is about the dual (homology) version of Proposition 5.6 (c) , Chapter XV, of Homological algebra by Cartan & Eilenberg. Let me first recall (for the case $r=2$ only) that it says that: if $E_2^{p,q}$ is a spectral sequence converging to $ H^{p+q}$ and we have $E_2^{u,v}=0$ for $u+v=n-1, u\\le p-2 $ and for $u+v=n, u<p$ and for $u+v=n+1, u\\ge p+2$ and for $u+v=n, u>p$ , then we have an isomorphism $E_2^{p,n-p}\\cong H^n$ . Now my question is: What is the dual version of this result (for first quadrant spectral sequence $E^2_{p,q}$ and $H_n$ ) ? My naive idea: Since $E^2_{p,q}=E_2^{-p, -q}$ and $H_n=H^{-n}$ , so if I just change all the $u,v,n,p,q$ in the conditions to it's negative and then rewrite the conditions, then do I get a valid dual result ? Thanks reference-request ac.commutative-algebra homological-algebra spectral-sequences Share Cite Improve this question Follow edited Aug 5, 2020 at 7:38 YCor 67.5k 5 5 gold badges 203 203 silver badges 301 301 bronze badges asked Aug 3, 2020 at 22:34 sdey 672 1 1 gold badge 7 7 silver badges 9 9 bronze badges $\\endgroup$ 2 $\\begingroup$ I think it is better to understand the main definitions and theorems you don't need the proofs. $\\endgroup$ ali –  ali 2020-08-05 07:59:37 +00:00 Commented Aug 5, 2020 at 7:59 $\\begingroup$ the conditions in the theorem means that all the boundary maps coming to or going out of $E^{p,n-p}$ are zero and also all other elements on the diagonal $u+v=n$ are zero. just look at the definition of the boundary map in homology and rewrite the conditons $\\endgroup$ ali –  ali 2020-08-05 08:10:17 +00:00 Commented Aug 5, 2020 at 8:10 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request ac.commutative-algebra homological-algebra spectral-sequences See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 3 Convergence of right half-plane spectral sequence bounded on the right 6 cohomology version of Cartan-Leray spectral sequence that deduces cup product 13 Relating two different approaches to the Atiyah-Hirzebruch Spectral Sequence 4 Grading in Eilenberg-Moore spectral sequence 6 Leray spectral sequence and pullbacks 7 Two cohomology Cartan-Leray spectral sequences? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 368257, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,ac.commutative-algebra,homological-algebra,spectral-sequences,reference-request,ac.commutative-algebra,homological-algebra,spectral-sequences",
  "scraped_at": "2026-01-14T04:27:53.953022",
  "answer": ""
}