{
  "id": "q_37566",
  "mathoverflow_id": 37566,
  "url": "https://mathoverflow.net/questions/37566/cohomology-of-zariski-neighborhoods",
  "title": "ag.algebraic geometry - Cohomology of Zariski neighborhoods",
  "body": "Do there exist smooth compact (=complete) connected complex algebraic varieties $X\\subset Y$ and a Zariski neighborhood $U$ of $X$ in $Y$ such that the image of $H^{\\ast}(U,\\mathbf{Z})$ in $H^{\\ast}(X,\\mathbf{Z})$ under the restriction map is different from the image of $H^*(Y,\\mathbf{Z})$? Remark: if one considers the rational cohomology instead of the integral one, the answer is no by Hodge theory: if a class on $X$ comes from a class on $U$, it is the restriction of a class of the \"right\" weight and hence it extends from $U$ to any smooth compactification, in particular to $Y$. In this argument it is important that cohomology maps induced by regular maps of algebraic varieties are strictly compatible with the weight filtrations: if a weight $k$ class in the target is in the image, then it is the image of a weight $k$ class. The motivation behind the above question is to understand whether or not the same holds for the integral weight filtrations, which can be defined as the Leray filtrations induced by the open embedding in a compactification as the complement of a divisor with normal crossings, see Weight filtration over the integers . The above is in a sense the simplest possible situation when strictness may fail. I.e., if the answer to the above question is positive, this would imply that the integral cohomology mappings are not necessarily strictly compatible with the weight filtrations. If the answer is negative, then I would be very interested to know the answer to the same question with \"algebraic\" replaced with \"complex analytic\" and \"Zariski neighborhood\" replaced with \"an open set whose complement can be blown up to a divisor with normal crossings\". ag.algebraic-geometry hodge-theory weights gt.geometric-topology Share Cite Improve this question Follow edited Apr 13, 2017 at 12:58 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Sep 3, 2010 at 1:11 algori 24.5k 3 3 gold badges 106 106 silver badges 164 164 bronze badges $\\endgroup$ 2 $\\begingroup$ This is a very interesting question! A remark: the image of $H^*(Y)$ in $H^*(U)$ only depends on $U$; I could explain why. $\\endgroup$ Mikhail Bondarko –  Mikhail Bondarko 2010-09-04 22:32:27 +00:00 Commented Sep 4, 2010 at 22:32 $\\begingroup$ Mikhail -- thanks. This image is just the set of all classes that have the \"right\" weight. Over the rationals this is just Hodge theory and I think I know how to prove it over the integers as well. $\\endgroup$ algori –  algori 2010-09-04 23:01:37 +00:00 Commented Sep 4, 2010 at 23:01 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry hodge-theory weights gt.geometric-topology See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 27 Mixed Hodge structure on the rational homotopy type 3 Does the (torsion) Zariski cohomology of a (singular) hyperplane section of a smooth projective variety vanish (in small degrees)? 2 Leray spectral sequence for lowest weight part of a smooth morphism 2 Second lowest weight piece of the cohomology of an algebraic variety 1 dimension of compact support cohomology 5 mixed Hodge structure on Cohomology with compact support 3 what is the definition of Hodge structure of geometric origin 1 Cohomology of singular curves $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 37566, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,hodge-theory,weights,gt.geometric-topology,ag.algebraic-geometry,hodge-theory,weights,gt.geometric-topology",
  "scraped_at": "2026-01-14T04:10:51.863591",
  "answer": ""
}