{
  "id": "q_40169",
  "mathoverflow_id": 40169,
  "url": "https://mathoverflow.net/questions/40169/complexity-of-a-variant-of-the-mandelbrot-set-decision-problem",
  "title": "np - Complexity of a variant of the Mandelbrot set decision problem?",
  "body": "This is a modified version of a question posted on StackExchange TCS. Mandelbrot set is defined using the complex equation $P_c (z)=z^2 +c$ where $c$ is a complex number. Let us define $M=${$(c,k,r) |$ In the sequence $P_c (0),P_c (P_c (0)), P_c (P_c (P_c (0)))...$ of first $k$ complex numbers, there is a subset $T$ of complex numbers such that the sum of the real parts $\\gt$ $r.k$ and the sum of imaginary parts $\\gt$ $r.k$} where $r$ is real number and $k$ is an integer in unary. Here is a geometric interpretation, since each $P_c^i(0)$ is a vector in 2D, we want to find the maximum size square obtainable by the summation of a subset of two dimensional vectors. Is there an efficient algorithm in the real computing model (i.e the Blum-Shub-Smale model) for deciding set $M$ or is it $NP$-complete ? EDIT: Is there any NP-complete problem related to Mandelbrot set? computational-complexity np fractals Share Cite Improve this question Follow edited Apr 13, 2017 at 12:32 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Sep 27, 2010 at 15:54 Mohammad Al-Turkistany 3,035 26 26 silver badges 35 35 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions computational-complexity np fractals See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 19 Area of the boundary of the Mandelbrot set ? 9 one-dimensional (sort of) tilings 13 Analysis of the boundary of the Mandelbrot set 14 Bounds for constructing $n!$ with additions, subtractions, and multiplications starting from $1$ 9 Complexity of the Mandelbrot set on rationals 1 Can the Mandelbrot set be designed through inequalities? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 40169, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "computational-complexity,np,fractals,computational-complexity,np,fractals",
  "scraped_at": "2026-01-14T04:10:11.359691",
  "answer": ""
}