{
  "id": "q_41896",
  "mathoverflow_id": 41896,
  "url": "https://mathoverflow.net/questions/41896/multi-variate-secant-method-for-solving-fx-0",
  "title": "ca.classical analysis and odes - Multi-variate secant method for solving $F(x)=0$",
  "body": "The secant method for solving an equation $F(x)=0$ in one variable is much older than Newton's one. Recall that given two iterates $x_{k-1}$ and $x_k$, it provides an update $x_k$ by taking the intersection of the chord joining the graph points $(x_{k-1},F(x_{k-1}))$ and $(x_k,F(x_k))$, with the horizontal axis $y=0$. The intersection is $(x_k,0)$. Students are taught that this method is convergent in the following sense, that if $F$ is ${\\mathcal C}^2$ at $\\hat x$, if $F(\\hat x)=0$ and $F'(\\hat x)\\ne0$, and if $x_0,x_1$ are close enough to $\\hat x$, then the sequence converges towards $\\hat x$. In addition, the error $e_k:=|x_k-\\hat x|$ satisfies $e_{k+1}\\le{\\rm cst}\\cdot e_ke_{k-1}$ for some constant. This ensures that $e_k\\le\\rho^{\\omega^k}$ for some $\\rho< 1$ and $\\omega=\\frac{1+\\sqrt{5}}{2}$ the golden ratio. This order is optimal, as seen on the example of a quadratic polynomial $F$. The following is a natural generalization to $n\\ge2$ variables. Now, $F:B(\\hat x;r) \\rightarrow {\\mathbb R}^n$ is a vector field. Given $n+1$ iterates $x_{k-n},\\ldots,x_{k-1},x_k$, we determine $x_{k+1}$ as the point $x\\in{\\mathbb R}^n$ such that $(x,0)$ is the intersection of the horizontal space ${\\mathbb R}^n\\times 0$, with the $n$-dimensional affine space spanned by the graph points $(x_j,F(x_j))$. Question . Is this method classical ? Does there exist a reference ? Do we know convergence ? Order ? Remark . Unlike the one-variable case, the algorithm can stop in finite time, when the affine space spanned by graph points does not intersect the horizontal space. Thus we expect convergence only for reasonnable initial data $(x_0,\\ldots,x_n)$. ca.classical-analysis-and-odes na.numerical-analysis rootfinding Share Cite Improve this question Follow edited Dec 20, 2018 at 13:30 Federico Poloni 20.5k 2 2 gold badges 84 84 silver badges 125 125 bronze badges asked Oct 12, 2010 at 11:29 Denis Serre 53.1k 10 10 gold badges 153 153 silver badges 316 316 bronze badges $\\endgroup$ 4 4 $\\begingroup$ It seems that the book [J. Ortega and W. Rheinboldt, Iterative Solution of Nonlinear Equations in Several Variables, SIAM, Philadelphia, PA, 2000] (avaliable at google books) discusses the multivariate method. $\\endgroup$ Wadim Zudilin –  Wadim Zudilin 2010-10-12 11:38:07 +00:00 Commented Oct 12, 2010 at 11:38 $\\begingroup$ I do not have access to this book (actually a reprint of a 1970 edition) here. Google scholar provides some scattered pages, which leave me uncomfortable whether the book really deals with this version of secant method. I'll come back when I know more about this. $\\endgroup$ Denis Serre –  Denis Serre 2010-10-12 12:58:31 +00:00 Commented Oct 12, 2010 at 12:58 4 $\\begingroup$ On page 198 of Ortega-Rheinboldt it says \"Although the $n+1$-point sequential secant method requires the least amount of computation per step, it will be shown in Chapter 11 that the method is prone to unstable behavior and that no satisfactory convergence results can be given. In contrast, the two-point methods will be shown to retain the essential properties of Newton's method and, in particular, satisfactory local convergence theorems will be obtained for them in section 11.2\". Chapters 9-11 are devoted to convergence and local convergence theorems for various iterative processes. $\\endgroup$ Gjergji Zaimi –  Gjergji Zaimi 2010-10-12 23:33:12 +00:00 Commented Oct 12, 2010 at 23:33 $\\begingroup$ @Gjergji. This is clear and it answers my question. Thanks to Wadim for having pointed the reference. I have asked our library to purchase the book. $\\endgroup$ Denis Serre –  Denis Serre 2010-10-13 05:21:47 +00:00 Commented Oct 13, 2010 at 5:21 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ca.classical-analysis-and-odes na.numerical-analysis rootfinding See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 1 Finding regions where multi-variate polynomials are positive 8 error estimates for multi-dimensional Riemann sums 2 Valid use of Laplace's method? 2 Radius of the ball where the inverse of Lipschitz maps exists 3 root solving without analytic derivative 9 An extrapolation method 0 Multi-variate Picard-Lindelöf? Convergence of analytic PDEs (w/ commutative partial derivatives & value at a base point) $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 41896, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ca.classical-analysis-and-odes,na.numerical-analysis,rootfinding,ca.classical-analysis-and-odes,na.numerical-analysis,rootfinding",
  "scraped_at": "2026-01-14T04:10:54.098116",
  "answer": ""
}