{
  "id": "q_45526",
  "mathoverflow_id": 45526,
  "url": "https://mathoverflow.net/questions/45526/finding-set-of-tree-decompositions-to-cover-all-pairs-of-vertices",
  "title": "statistical physics - finding set of tree decompositions to cover all pairs of vertices",
  "body": "I first asked this on cstheory.SE but got no reply. Let $P(X_i=x)$ represent probability that randomly chosen proper $q$-coloring of an $L\\times L$ square grid contains color $x$ at position $i$. How do you efficiently compute $P(X_{i}=X_{j})$ for every pair $(i,j)$? Fastest known method for counting $q$-proper colorings on grids uses tree decomposition. To extend it to this problem, one needs a set of tree decompositions so that every pair of vertices is contained in some bag. Is anything known about this problem? Motivation: this is essentially two-point correlation function of Potts model, but also correlation function of self-avoiding walks and few other \"all-pairs\" problems face the same issue statistical-physics computational-complexity graph-theory graph-colorings Share Cite Improve this question Follow edited Apr 13, 2017 at 12:32 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Nov 10, 2010 at 5:52 Yaroslav Bulatov 2,394 21 21 silver badges 45 45 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions statistical-physics computational-complexity graph-theory graph-colorings See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 6 Software for Tree-Decompositions 55 The \"sensitivity\" of 2-colorings of the d-dimensional integer lattice 1 Is this measure related to treewidth? 4 Finding a vertex of least distance to all other vertices in a graph 11 Do you know a faster algorithm to color planar graphs? 13 Chromatic number of the plane and phase transitions of Potts models 2 Find a minimum set of paths that cover all pairs of dependent vertices 2 $n^2$-Grid $3n$-Coloring Game: Can we color a n-square grid with 3n colors s. t. we can't select n colors to get an histogram with $\\Theta(n^2)$ area? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 45526, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "statistical-physics,computational-complexity,graph-theory,graph-colorings,statistical-physics,computational-complexity,graph-theory,graph-colorings",
  "scraped_at": "2026-01-14T04:11:01.114522",
  "answer": ""
}