{
  "id": "q_45115",
  "mathoverflow_id": 45115,
  "url": "https://mathoverflow.net/questions/45115/tubular-neighborhood-growth-of-zero-set-of-polynomial-of-bounded-degree-in-the-t",
  "title": "ag.algebraic geometry - Tubular neighborhood growth of zero set of polynomial of bounded degree in the torus",
  "body": "This question is related to my related post: Volume growth of tubular neigbhorhood of critical values of an algebraic/differentiable map The setting here is as follows: Let $p: \\mathbb{R}^{2k} \\to \\mathbb{R}$ be a polynomial of maximum degree $d$. What can one say about the volume growth of the tubular neighborhood $T_\\epsilon(p^{-1}(0)) \\cap \\mathbb{T}^k$ in $\\mathbb{T}^k$, where $\\mathbb{T}^k$ is imbedded in $\\mathbb{R}^{2k}$ in the obvious way? I.e., each two dimensions of $\\mathbb{R}^{2k}$ accommodates one copy of $\\mathbb{T}^1$. In some sense, I want to understand the $k-1$-dimensional volume of the zero set of $p$. Note the bound on volume growth does not have to be sharp at all. If one can show it's polynomial in $d$ I am already very happy. So I found a paper by Hassler Whitney on elementary structures of real algebraic varieties, as well as some estimates on metric entropy of critical values of algebraic maps by Yomdin. ag.algebraic-geometry mg.metric-geometry geometry Share Cite Improve this question Follow edited Apr 13, 2017 at 12:58 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Nov 6, 2010 at 23:08 John Jiang 4,496 27 27 silver badges 49 49 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry mg.metric-geometry geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 volume growth of tubular neigbhorhood of critical values of an algebraic/differentiable map 36 Special values of L-functions as periods 2 The Tubular Neighborhood of a Closed Geodesic 1 Rational points of non-rational curves 3 Bounding the number of critical points in a Lefschetz pencil 6 Sliding through a curvature-bounded tube: Maximum volume? 5 Weyl tube formula for manifolds with boundary 18 Known configurations maximizing the volume of the convex hull of n points on the unit sphere $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 45115, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,mg.metric-geometry,geometry,ag.algebraic-geometry,mg.metric-geometry,geometry",
  "scraped_at": "2026-01-14T04:10:58.589076",
  "answer": ""
}