{
  "id": "q_47622",
  "mathoverflow_id": 47622,
  "url": "https://mathoverflow.net/questions/47622/induced-groupoid-schemes",
  "title": "ag.algebraic geometry - Induced groupoid schemes",
  "body": "This is a more direct version of this question , which was perhaps a bit obtuse. This is a more elementary formulation. Recall that for a groupoid scheme (or indeed any internal groupoid) $X = (X_1 \\rightrightarrows X_0)$ and a map $Y \\to X_0$, on can define a new groupoid scheme $X[Y]$ with objects $Y$ and arrows $Y\\times_{X_0} X_1 \\times_{X_0} Y$. This latter scheme exists (unless I'm horribly mistaken), but we need to check whether the groupoid $X[Y]$ has the same properties as $X$. For example, consider the following properties of $X$ (where I am pulling adjective out of a hat that I have heard of - I am not an algebraic geometer): $(s,t):X_1 \\to X_0 \\times X_0$ is quasi-separated, separated, quasi-compact, flat or any other adjective you can think of. More generally we say property 1 holds for $X$ (for a class $P$ of maps). $s$ and $t$ are etale, smooth, unramified, flat, finite fibres, have local sections over a cover from any of the usual Grothendieck topologies. More generally we say property 2 holds for $X$ (for a given class of maps). Now clearly if $P$ is a property of a map that is stable under pullback, then if property 1 holds for $X$ then it holds for $X[Y]$ by definition. But what about property 2? I know that in the analogous case of topological groupoids, if $P$ is 'local homeomorphisms', then property 2 holding for $X$ implies it for $X[Y]$, but I don't know enough alg. geom. to claim this for etale maps and groupoid schemes. In general, for what classes of maps of schemes do we know that property 2 holding for $X$ implies it for $X[Y]$? ag.algebraic-geometry schemes Share Cite Improve this question Follow edited Apr 13, 2017 at 12:58 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Nov 29, 2010 at 1:24 David Roberts ♦ 37k 13 13 gold badges 143 143 silver badges 388 388 bronze badges $\\endgroup$ 2 $\\begingroup$ I don't think that 2) is as well behaved, even in the smooth setting. For example, given any orbifold, one can find a Lie groupoid $\\G$ presenting it such that the source and target maps are proper, however, this property is not stable under Morita-equivalence. In general, one can only claim that the map in 1) is proper. $\\endgroup$ David Carchedi –  David Carchedi 2010-11-29 02:11:29 +00:00 Commented Nov 29, 2010 at 2:11 $\\begingroup$ It is not as well behaved, as you say, but I'm sure there are non-trivial examples. Given an atlas $p:X \\to \\mathcal{X}$ of a stack $\\mathcal{X}$ (algebraic or topological or otherwise), where $p$ is in some class $P$, then $s,t:X \\times_{\\mathcal{X}} X \\to X$ are in class $P$, and this should have some sort of stability under forming the induced groupoid. $\\endgroup$ David Roberts –  David Roberts ♦ 2010-11-29 02:48:04 +00:00 Commented Nov 29, 2010 at 2:48 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry schemes See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 8 Is there a good notion of `Separated Stack'? 10 Exactly how is 'the diagonal is representable' used for algebraic stacks... 7 Categories internal to schemes and subschemes of invertible arrows 15 What are the local properties of schemes preserved under global sections? 6 Explicit description of the stack associated to a groupoid 5 The biggest class of schemes which the reduction principle holds $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 47622, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,schemes,ag.algebraic-geometry,schemes",
  "scraped_at": "2026-01-14T04:11:07.862548",
  "answer": ""
}