{
  "id": "q_49614",
  "mathoverflow_id": 49614,
  "url": "https://mathoverflow.net/questions/49614/flatness-of-a-homogeneous-quasi-coherent-sheaf-on-the-formal-plane-from-flatness",
  "title": "ag.algebraic geometry - Flatness of a homogeneous quasi-coherent sheaf on the formal plane from flatness on lines through the origin?",
  "body": "(This is a follow-up to a previous question ; as often happens, I didn't include enough hypotheses, so I'm asking a new, more-likely-to-be-true question). Consider the formal plane $\\operatorname{Spec}\\mathbb C[[t,h]]$, and let $\\mathcal F$ be a quasi-coherent sheaf which is graded for the grading on $\\mathbb C[[t,h]]$ where both $t$ and $h$ have degree 1 ( EDIT: by which I mean that it is the completion of a graded $\\mathbb C[t,h]$-module). Now assume that $\\mathcal F$ is flat over infinitely many lines through the origin of the form $t=ah$ for $a\\in \\mathbb C$ ( EDIT : by which I mean that there are infinitely many complex numbers $a\\in \\mathbb C$ such that the pullback to the subscheme $\\operatorname{Spec} \\mathbb C[[t,h]]/(t-ah)$ is free as a module over $\\mathbb C[[t,h]]/(t-ah)$). Can we conclude that $\\mathcal F$ is flat? For coherent sheaves, I think I can see an argument by comparing dimensions of residues (if the dimension of the residue at the closed point is the same as at the generic points of infinitely lines, it also must be the same as that at the generic point), but of course, that doesn't make sense for quasi-coherent sheaves. Is there some better argument, or can the behavior of these modules be more pathological than I realize? I'd really appreciate a pointer toward a reference, as well (or at least guidance on where to look for it). ag.algebraic-geometry ac.commutative-algebra flatness quasi-coherent-modules power-series Share Cite Improve this question Follow edited Apr 13, 2017 at 12:57 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Dec 16, 2010 at 8:28 Ben Webster 45.6k 13 13 gold badges 134 134 silver badges 264 264 bronze badges $\\endgroup$ 2 6 $\\begingroup$ What do you mean by saying that ${\\mathcal{F}}$ is flat over a line? And what do you mean by saying that it is graded? Usually people consider graded modules over graded rings and a graded ring is a direct SUM of its graded components, while $C[[t,h]]$ is a direct PRODUCT. Does it mean that the module is completion of a graded module over $C[t,h]$? $\\endgroup$ Sasha –  Sasha 2010-12-16 09:18:17 +00:00 Commented Dec 16, 2010 at 9:18 $\\begingroup$ Minor nitpick: I think the standard name is \"formal polydisk\" instead of \"formal plane\". $\\endgroup$ S. Carnahan –  S. Carnahan ♦ 2010-12-17 20:04:58 +00:00 Commented Dec 17, 2010 at 20:04 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ag.algebraic-geometry ac.commutative-algebra flatness quasi-coherent-modules power-series See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 1 Flatness on the formal plane from flatness on lines through the origin? 0 Generic rank of a coherent sheaf on a projective variety vs. generic rank on the cone 11 Can flatness be specified by a natural coherent sheaf? 21 Cohomologically trivial stacks 1 flatness in the category of quasi coherent sheaves 7 When are direct products exact in the category of quasi-coherent sheaves? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 49614, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ag.algebraic-geometry,ac.commutative-algebra,flatness,quasi-coherent-modules,power-series,ag.algebraic-geometry,ac.commutative-algebra,flatness,quasi-coherent-modules,power-series",
  "scraped_at": "2026-01-14T04:11:10.096353",
  "answer": ""
}