{
  "id": "q_50671",
  "mathoverflow_id": 50671,
  "url": "https://mathoverflow.net/questions/50671/quotient-of-two-laplace-integrals-2",
  "title": "ca.classical analysis and odes - Quotient of two Laplace integrals (2)",
  "body": "In one attempt to prove a probability theorem (of K.L. Chung and P. Erdős, 1951) using analytic argument, I try to prove the following Let $\\varphi(x)$ and $\\psi(x)$ be two complex-valued continuous functions on $[a,b]$, and let $f(x)$ be a complex-valued continuously differentiable function on $[a,b]$. Suppose that $|f(x)|$ has an absolute maximum at an interior point, say $\\xi$, of the interval, and $f'(\\xi)=0$. Then \\begin{equation}\\label{eq3} \\lim_{n\\to\\infty}\\frac{\\int_a^b\\varphi(x)[f(x)]^ndx}{\\int_a^b\\psi(x)[f(x)]^ndx}=\\frac{\\varphi(\\xi)}{\\psi(\\xi)}. \\end{equation} Remark 1: This is true for $f(x)\\in C^2$, by Laplace's method. Remark 2: Michael has given a counter example without the assumption $f'(\\xi)=0$. This is a good example. Please see in the origin version of the problem: Quotient of two Laplace integrals This problem is still open. Thank you. ca.classical-analysis-and-odes asymptotics Share Cite Improve this question Follow edited Apr 13, 2017 at 12:58 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Dec 29, 2010 at 18:40 LI Yutian 93 4 4 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions ca.classical-analysis-and-odes asymptotics See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 How to do asymptotics for integrals? 6 Quotient of two Laplace integrals 4 Quantitative Weierstrass Approximation and Paley-Wiener for the Laplace Transform 2 an identity between two elliptic integrals 1 Two trigonometric integrals: looking for a transformation 4 Asymptotic behavior of weighted sums involving the fractional part function $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 50671, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "ca.classical-analysis-and-odes,asymptotics,ca.classical-analysis-and-odes,asymptotics",
  "scraped_at": "2026-01-14T04:11:14.574331",
  "answer": ""
}