{
  "id": "q_51706",
  "mathoverflow_id": 51706,
  "url": "https://mathoverflow.net/questions/51706/homomorphism-between-the-set-of-n-flats-in-rm-to-some-manifold",
  "title": "at.algebraic topology - Homomorphism between the set of n-flats in $R^m$ to some manifold",
  "body": "I am unaware of what the formal definition of \"limit\" is for a sequence of flats, but for the purpose of this question her is the definition of limit that I am using: Consider a sequence $s_1, s_2, s_3,$ etc. where $s_i$ is a flat of $R^m$ for all $i$. We will say that $lim_{n\\to\\infty}s_n=S$ if and only if for any point $p$ on $S$ and any positive value $\\epsilon$, there exists a sufficiently large number $b$ such that if $x>= b$, the minimum distance between $p$ and $s_x$ will be no greater than $\\epsilon$. Here is my question: 1) Does there exist a homomorphism between the set of all n-flats in $R^m$ to some manifold, for all n and m, and 2) If so, to what manifold? This question is partially motivated by a different question I asked earlier, where it was established that the set of all lines in a plane could not be continuously and bijectively represented by the set of all points in the plane, because the set of lines in a plane is homomorphic to an open mobius strip. Continuous bijective way of representing a line on a plane Note: I know very little topology, so I would appreciate it if people provided links if they refer to even \"well known\" theories. at.algebraic-topology Share Cite Improve this question Follow edited Apr 13, 2017 at 12:58 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jan 10, 2011 at 22:27 yrudoy 445 2 2 silver badges 7 7 bronze badges $\\endgroup$ 5 $\\begingroup$ I think you want the Grassmannian of n-planes in m-space. Wikipedia provides some background. $\\endgroup$ Hugh Thomas –  Hugh Thomas 2011-01-10 23:11:13 +00:00 Commented Jan 10, 2011 at 23:11 $\\begingroup$ @hugh Thomas This is close, but the grasmannian is related to linear subspaces, not the set of all flats of a certain dimension. So, any flat that doesn't pass through the origin would be excluded. $\\endgroup$ yrudoy –  yrudoy 2011-01-10 23:23:48 +00:00 Commented Jan 10, 2011 at 23:23 3 $\\begingroup$ If you want affine subspaces of dimension n in R^m, you can fix a copy Z of R^m inside R^{m+1} which doesn't pass through the origin. Now \\cap Z provides a map from an open subset of the Grassmannian of n+1-dimensional linear subspaces of R^{m+1}, to n-dimensional affine subspaces of Z=R^m. $\\endgroup$ Hugh Thomas –  Hugh Thomas 2011-01-11 00:44:51 +00:00 Commented Jan 11, 2011 at 0:44 $\\begingroup$ @hugh Thomas: I agree that you can use this approach to show that the answer to my question is \"an open subset of the Grassmannian of n+1-dimensional linear subspaces of R^{m+1}\", but I don't believe this uniquely identifies a manifold. $\\endgroup$ yrudoy –  yrudoy 2011-01-11 15:21:23 +00:00 Commented Jan 11, 2011 at 15:21 1 $\\begingroup$ The space of n-flats in $R^m$ is sometimes called an affine Grassmannian. Wikipedia gives two different definitions for this term, one of which seems to be what you want. The affine Grassmannian in this sense contains the ordinary Grassmannian and is a vector bundle over it, so it is a manifold but it is not homeomorphic to a euclidean space since it has the same homology and homotopy groups as the ordinary Grassmannian, and many of these groups are nontrivial, starting with the fundamental group. $\\endgroup$ Allen Hatcher –  Allen Hatcher 2011-01-11 16:37:34 +00:00 Commented Jan 11, 2011 at 16:37 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions at.algebraic-topology See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 3 Homology of Surfaces with Holes 3 Moise's Theorem and the Fundamental Domain of a $3$-Manifold 8 What information can one recover from the induced map on homology? 1 When is the class of functions between sets a set? 7 Topological invariance of Stiefel-Whitney classes for open smooth manifolds 6 Relationship between the holonomy pseudogroup and holonomy homomorphism (foliation) $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 51706, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "at.algebraic-topology,at.algebraic-topology",
  "scraped_at": "2026-01-14T04:11:19.056146",
  "answer": ""
}