{
  "id": "q_52506",
  "mathoverflow_id": 52506,
  "url": "https://mathoverflow.net/questions/52506/g-m-cohomology-of-a-motif-that-corresponds-to-a-stack",
  "title": "motives - $G_m$-cohomology of a motif (that corresponds to a stack?)",
  "body": "As in the question For a G-variety, what could one say about the motif of the corresponding simplicial variety I am in the following situation: $G$ is an algerbraic group, and X is a smooth $G$-variety. Then the simlicial variety whose terms are $G^i\\times X$ yields a 'complex of varieties' $\\dots\\to G\\times G\\times X\\to G\\times X\\to X$; next I obtain a Voevodsky's motivic complex $C$. Next, I want to compute the (Zariski) cohomology of $C$ with coefficients in $G_m$. How could one do this? David Ben-Zvi wrote that this is the motif of the stack $X/G$. I don't know anything about stacks, so I would like to know whether this helps. For example, can one prove that $H^2(C,G_m)$ vanishes? motives stacks cohomology picard-group ag.algebraic-geometry Share Cite Improve this question Follow edited Apr 13, 2017 at 12:58 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Jan 19, 2011 at 12:11 Mikhail Bondarko 17.5k 4 4 gold badges 37 37 silver badges 106 106 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions motives stacks cohomology picard-group ag.algebraic-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 12 Finiteness conditions on simplicial sheaves/presheaves 10 Stable motivic cohomology with finite coefficients? 3 For a G-variety, what could one say about the motif of the corresponding simplicial variety 14 Are two conjectural descriptions of the motivic t-structure (via cohomology and via affine varieties) known to be equivalent? 14 Motivic cohomology vs. K-theory for singular varieties 7 What's a (infinity-) semi-stack? 11 How to think about infinite generatedness of motivic cohomology 4 What is the local structure of a general Artin stack? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 52506, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "motives,stacks,cohomology,picard-group,ag.algebraic-geometry,motives,stacks,cohomology,picard-group,ag.algebraic-geometry",
  "scraped_at": "2026-01-14T04:11:21.292447",
  "answer": ""
}