{
  "id": "q_56913",
  "mathoverflow_id": 56913,
  "url": "https://mathoverflow.net/questions/56913/mapping-from-x-to-s4",
  "title": "at.algebraic topology - Mapping from $X$ to $S^4$",
  "body": "I asked this question previously on stackexchange ( https://math.stackexchange.com/questions/18668/mapping-from-x-to-s4 ) but could not get a solution. Any help is appreciated. The question is (Topology II: homotopy and homology: classical manifolds): Show that the quotient space $X = S^2 \\times S^2 / [(x_1,x_2) \\sim (Rx_1,Rx_2)]$ where R is the reflection in the equatorial plane, is homeomorphic to $S^4$. I am still in the process of learning topology and I really don't think I can prove this result. I apologize in advance if this is trivial, but it will be of great help if someone could provide a homeomorphism. I would really like to use the mapping of $X$ to $S^4$ in my work. I did manage to get a mapping from $S^1 \\times S^2 / [(x_1, x_2) \\sim (Rx_1,Rx_2)]$ to $S^3$, but I am having trouble extending the result to $S^2 \\times S^2$ Thank you. at.algebraic-topology Share Cite Improve this question Follow edited Apr 13, 2017 at 12:19 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Feb 28, 2011 at 17:55 Srikanth 31 2 2 bronze badges $\\endgroup$ 4 2 $\\begingroup$ This sounds like a hw problem. $\\endgroup$ John Klein –  John Klein 2011-02-28 18:02:27 +00:00 Commented Feb 28, 2011 at 18:02 $\\begingroup$ As I mentioned in my post, I apologize if it is a simple hw problem. I am materials science student and I came across this problem in my research. As it happens it is an exercise problem in the book I mentioned. I tried my best (with the little knowledge I have), but could not get a mapping. $\\endgroup$ Srikanth –  Srikanth 2011-02-28 18:11:01 +00:00 Commented Feb 28, 2011 at 18:11 7 $\\begingroup$ Think of it this way : $S^2$ is the collection of two $2$-disks glued along the equator. In $S^2\\times S^2$, we therefore have four copies of $D_2\\times D_2$. The relations you have tells you that you basically end up with two copies of $D_2\\times D_2$ which have $S^3$ as a boundary and the relations (the ones left over) tell you to glue these two boundaries, thereby giving $S^4$. $\\endgroup$ Somnath Basu –  Somnath Basu 2011-02-28 19:09:58 +00:00 Commented Feb 28, 2011 at 19:09 $\\begingroup$ @Somnath. Thanks. I think I understand it. I actually did the similar thing when showing $S^1×S^2/E$ to be equivalent to $S^3$. I didn't realize it though. Thanks for your help. I will try to figure out the exact mapping now. – Srikanth 0 secs ago $\\endgroup$ Srikanth –  Srikanth 2011-02-28 19:27:13 +00:00 Commented Feb 28, 2011 at 19:27 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions at.algebraic-topology See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 8 the hopf invariant of the hopf construction 10 Different definitions of the linking number 7 The symmetric square of a sphere 9 Alternate proofs of the undecidability of the homeomorphism problem for finite simplicial complexes $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 56913, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "at.algebraic-topology,at.algebraic-topology",
  "scraped_at": "2026-01-14T04:11:28.002658",
  "answer": ""
}