{
  "id": "q_56578",
  "mathoverflow_id": 56578,
  "url": "https://mathoverflow.net/questions/56578/what-is-the-bottom-of-a-directed-complete-partial-order-of-groups",
  "title": "gr.group theory - What is the bottom of a directed-complete partial order of groups?",
  "body": "Given a directed-complete partial order of finitely presented groups, I want to say that the free group is the bottom, but I don't think that is right. Can anyone say what is a typical bottom in a directed-complete partial order of groups? Furthermore, are the finitely presentable groups the finite or compact elements? gr.group-theory lattice-theory Share Cite Improve this question Follow edited Jun 6, 2016 at 8:30 Martin Sleziak 4,813 4 4 gold badges 39 39 silver badges 42 42 bronze badges asked Feb 24, 2011 at 23:27 Ben Sprott 1,289 14 14 silver badges 26 26 bronze badges $\\endgroup$ 16 4 $\\begingroup$ You should probably clarify what you mean by a typical dcpo of groups. Otherwise the bottom can be anything you want: just take the dcpo {G}... $\\endgroup$ François G. Dorais –  François G. Dorais 2011-02-24 23:32:37 +00:00 Commented Feb 24, 2011 at 23:32 1 $\\begingroup$ Also, signatures (and greetings) aren't really necessary on MO. A signature is automatically attached to your posts. $\\endgroup$ François G. Dorais –  François G. Dorais 2011-02-24 23:34:35 +00:00 Commented Feb 24, 2011 at 23:34 2 $\\begingroup$ What does \"dcpo\" mean? $\\endgroup$ aaron –  aaron 2011-02-25 00:08:28 +00:00 Commented Feb 25, 2011 at 0:08 2 $\\begingroup$ Well, it's maximal if you think that a subgroup is greater than the group... which seems like an odd convention. $\\endgroup$ HJRW –  HJRW 2011-02-25 06:01:09 +00:00 Commented Feb 25, 2011 at 6:01 1 $\\begingroup$ @SeanLawton your change to the title has actually made it incorrect. One should speak of a DCPO of groups, not of \"DCPO groups\". Moreover, why not insert the definite or indefinite article before the word \"bottom\" if you feel these changes are so necessary as to warrant bumping this question ? $\\endgroup$ Yemon Choi –  Yemon Choi 2016-06-04 14:02:18 +00:00 Commented Jun 4, 2016 at 14:02  |  Show 11 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions gr.group-theory lattice-theory See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 11 Conjugating a subgroup of a group into a proper subgroup of itself 20 The word problem for fundamental groups of smooth projective varieties 11 Partial word orders on groups 19 What finitely presented groups embed into $\\operatorname{GL}_2$? 7 Does the inner automorphism group of the fundamental group of a closed aspherical manifold always have an element of infinite order? 2 Relativisation of Higman's embedding theorem 7 Are finitely discriminable groups the compact elements of the poset of marked groups? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 56578, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "gr.group-theory,lattice-theory,gr.group-theory,lattice-theory",
  "scraped_at": "2026-01-14T04:11:25.762698",
  "answer": ""
}