{
  "id": "q_60901",
  "mathoverflow_id": 60901,
  "url": "https://mathoverflow.net/questions/60901/projecting-the-unit-cube-onto-subspaces-of-dimension-at-least-2",
  "title": "oc.optimization and control - Projecting the unit cube onto subspaces of dimension at least $2$",
  "body": "This is an updated revision of a recent question where I asked: Given a set $S$ of non-zero vectors in $\\mathbb{R}^n,$ and a subspace $L,$ consider $f(S,L)=\\max_{s \\in S}\\frac{\\|Ps\\|_2}{\\|s\\|_2}$ where $Ps$ is the orthogonal projection of $s$ onto $L.$ Specifically, consider the set $X$ consisting of the $2^n-1$ (nonzero) vectors with all coordinates $0$ or $1$. For each $n$ and $d<n$, what is the minimum over all $d$-dimensional subspaces of $f(X,L)?$ Call this minimum $m_{n,d}.$ I amend the question to ask specifically about $d>1$ as the answers given for the previous question all concerned the case $d=1.$ Together they pretty well completed that case. The gist for $d=1$ (see that question for details) is that for $n=5$ it is optimal to take the span of the vector $v_5=(1,\\sqrt(2)-1,\\sqrt{3}-\\sqrt{2}; 1-\\sqrt{2},-1)$ and that the vectors where the maximum ratio is obtained are $(1,0,0,0,0), (1,1,0,0,0), (1,1,1,0,0), (0,0,0,0,1)$ and $(0,0,0,0,1).$ (A basis of $\\mathbb{R}^5.$) For other values of $n$ a similar construction is used, breaking in the exact middle for even $n$. This gives the exact value of $m_{n,1}.$ It is not an attractive expression but $m_{n,1}=O(\\frac{1}{\\sqrt{\\log n}}).$ I won't attempt to make that more precise but it should be possible. A few comments: Call a class of vectors in $\\mathbb{R}^n$ good if the projection of $X$ onto any one of them is $O(\\frac{1}{\\sqrt{\\log n}})$. Examples include these variations of $v_n$: Not switching from positive to negative exactly in the middle (or at all). Replacing some of the entries (the middle ones or the negative ones) by 0. Replacing $v_n$ with $v_t$ for some smaller $t$ padded by 0's on one or both sides. etc. For a dimension $d$ subspace to be good (with the obvious definition) requires every vector in $L$ to be good. So one can think of various ways to do this starting with a basis of good vectors. Perhaps this can show that $m_{N,d}\\approx m_{n,1}$ for $N=nd$ or $N=nd+r$ with $r<d.$ These vague constructions hint at ways to have $f(X,L)$ small with several vectors $x$ attaining the maximum. It should be possible to have a basis or perhaps even a set of $nd$ vectors in $X$ attain the maximum by starting with a good example and then perturbing the subspace so as to reduce this maximum ratio (while keeping it constant on these vectors) and raising it on some other vectors until the set attaining the maximum is enlarged. This is not linear programing but it reminds me of it and duality might be useful.(see the previous question for slightly more details.) oc.optimization-and-control linear-algebra Share Cite Improve this question Follow edited Apr 13, 2017 at 12:57 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Apr 7, 2011 at 7:45 Aaron Meyerowitz 30.4k 2 2 gold badges 50 50 silver badges 106 106 bronze badges $\\endgroup$ Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions oc.optimization-and-control linear-algebra See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 8 Projecting the unit cube onto subspaces 8 Projecting the unit cube onto a (very special) subspace 17 Minimizing the excursion of a sum of unit vectors 2 Maximum dimension of an isotropic subspace in a quadratic space 9 I want to find a smooth section of the map from the Stiefel manifold to the Grassmanian manifold $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 60901, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "oc.optimization-and-control,linear-algebra,oc.optimization-and-control,linear-algebra",
  "scraped_at": "2026-01-14T04:11:34.694494",
  "answer": ""
}