{
  "id": "q_60191",
  "mathoverflow_id": 60191,
  "url": "https://mathoverflow.net/questions/60191/maximum-of-a-function-on-d-dimensional-convex-compact-sets",
  "title": "co.combinatorics - Maximum of a function on $d-$dimensional convex compact sets",
  "body": "Let $\\mathcal C_d$ denote the set of all $d-$dimensional convex compact subsets with barycenter at the origin of the $d$-dimensional Euclidean space $\\mathbb E^d$. Given an element $C\\in\\mathcal C_d$ with boundary $\\partial C$, define $\\Sigma_0\\subset \\partial C$ by $\\Sigma_0=\\partial C\\cap(-\\partial C)$. The complement $\\partial C\\setminus \\Sigma_0$ is open and can be partitioned into two open subsets $\\Sigma_\\pm$ defined by $$\\Sigma_-=\\lbrace P\\in\\partial C\\vert -P\\in\\mathrm{Int}(C)\\rbrace$$ and $$\\Sigma_+=\\lbrace P\\in \\partial C\\vert -P\\not\\in C\\rbrace\\ .$$ Set $\\rho(C)=\\mathrm{Area}(\\Sigma_+)/\\mathrm{Area}(\\Sigma_-)$ (using the convention $\\rho(C)=1$ if $\\Sigma_+=\\Sigma_-=\\emptyset$ which happens exactly if $C$ is centrally symmetric) where $\\mathrm{Area}(\\Sigma_\\pm)$ is the $(d-1)$ dimensional area. The function $\\rho:\\mathcal C_d\\longrightarrow [1,\\infty)$ is invariant under the action of the linear group on $\\mathcal C_d$ and is bounded. What is its maximal value (and on which convex sets is it achieved)? Added: My argument for the invariance under the linear group is flawed. I am also no longer sure that $\\rho$ is bounded (my proof used invariance under the linear group). (Added after a moments thought: One remedy is to replace $\\rho(C)$ by $\\mathrm{Vol}(C)/\\mathrm{Vol}(C\\cap(-C))$ which is obviously invariant under linear transformations and which is bounded.) A probably naive guess for the maximum is the value of $\\rho$ on a simplex. In dimension $2$, one gets $\\rho(\\Delta)=2$ if $\\Delta\\in\\mathcal C_2$ is a triangle and in dimension $3$ one gets $\\rho(\\Delta)=3$ for $\\Delta$ a simplex in $\\mathcal C_3$. I ignore the value of $\\rho$ on simplices of dimension $\\geq 4$ (question Name of a polytope is motivated by the computation of these values). A similar invariant which has perhaps been studied is obtained by considering $\\lambda_C=\\max_L_+\\mathrm{length}(L_+\\cap C)/\\mathrm{length}((-L_+)\\cap C)$ where the maximum is over the set of all half-lines rooted at the origin. The invariant $\\lambda(C)$ is also bounded and invariant under the action of the linear group on $\\mathcal C_d$. (Here I am sure since this is obvious.) co.combinatorics convex-polytopes convex-geometry Share Cite Improve this question Follow edited Apr 13, 2017 at 12:57 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Mar 31, 2011 at 14:08 Roland Bacher 18.5k 3 3 gold badges 49 49 silver badges 117 117 bronze badges $\\endgroup$ 1 $\\begingroup$ You probably have already seen this, but for anyone else happening across this question, you probably want to look for papers about John's ellipsoids. In particular, look for papers by Keith Ball. I took a course from him a few years ago about this stuff which I don't remember as much of as I would like. However, one thing we did do was show that the simplex was, in some rigorous sense, the \"least centrally symmetric\" convex body, which agrees with your naive assessment. $\\endgroup$ Aubrey da Cunha –  Aubrey da Cunha 2011-03-31 18:18:36 +00:00 Commented Mar 31, 2011 at 18:18 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions co.combinatorics convex-polytopes convex-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 4 Diameter of a metric on orbits under affine bijections of $n-$dimensional convex compact sets 8 Listing lattice points in a simplex 7 Maximal volume of a simplex inscribed in a spherical cap 8 Monge-Ampère measures and Kazarnovskii pseudovolume 6 Volume ratio of general $\\ell_p$ balls and surfaces 3 Are cyclic orbitopes of permutahedra necessarily simplicies? 3 Is every (not necessarily PL-) triangulation of a manifold pure, non-branching and strongly-connected? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 60191, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "co.combinatorics,convex-polytopes,convex-geometry,co.combinatorics,convex-polytopes,convex-geometry",
  "scraped_at": "2026-01-14T04:11:32.471057",
  "answer": ""
}