{
  "id": "q_75891",
  "mathoverflow_id": 75891,
  "url": "https://mathoverflow.net/questions/75891/does-regularity-of-a-d-module-for-an-unusual-filtration-imply-regularity-for-the",
  "title": "rt.representation theory - Does regularity of a D-module for an unusual filtration imply regularity for the usual one?",
  "body": "One definition of regular D-modules on affine space is that a D-module is regular if it has a filtration compatible with the order filtration on differential operators whose associated graded is reduced as a coherent sheaf, that is, its annihilator is a radical ideal. But, differential operators on affine space have a lot of filtrations. For example, if I look at $\\mathbb{A}^n$ and choose $n$ positive integers $a_i$ , I can define a filtration of the following form: we let $x_i$ lie in $D^{-a_i}$ and $\\partial_i$ in $D^{1+a_i}$ and extend the filtration to the rest of the differential operators in the obvious way. Not all D-modules have good filtrations with respect to this filtration, but some do (for example, any homogeneous with respect to the action of $\\mathbb{C}^*$ with weights $a_i$ ). Does the condition of having a filtration compatible with this one whose associated graded is reduced as a coherent sheaf, that is, its annihilator is a radical ideal have an interesting consequences? Most importantly, does it imply regularity in the usual sense given above? For that matter, has this filtration been studied by anyone? Is there any literature on it? I'll note, if I let the $a_i$ 's be negative, regularity definitely isn't preserved by this change of filtration: there are regular D-modules whose Fourier transforms aren't regular. rt.representation-theory ra.rings-and-algebras differential-operators d-modules Share Cite Improve this question Follow edited Jun 15, 2020 at 7:27 Community Bot 1 2 2 silver badges 3 3 bronze badges asked Sep 19, 2011 at 22:22 Ben Webster 45.6k 13 13 gold badges 134 134 silver badges 264 264 bronze badges $\\endgroup$ 2 $\\begingroup$ Ben, I am confused about your definition of regularity. If you take the D-module generated by $e^x$ on ${\\mathbb A}^1$ it obviously has a filtration such that the associated graded is the structure sheaf of the zero section in the cotangent bundle and it is not regular. What am I missing? $\\endgroup$ Alexander Braverman –  Alexander Braverman 2011-09-20 22:49:49 +00:00 Commented Sep 20, 2011 at 22:49 $\\begingroup$ Do you mean that the $D$-module is regular on ${\\mathbb A}^n$ without infinity? In this case I would be interested to see the proof of your original statement. In any case if you take your $D$-module to be $exp(1/x)$ on ${\\mathbb A}^1$ and set $deg(x)=-1$ and $deg(d)=2$ then you can define a filtration $M_i$ to be generated over functions by all $p(x)exp(1/x)$ where $p(x)$ is a polynomial in $x^{-1}$ of degree $\\leq i$ and I think it gives a counterexample. $\\endgroup$ Alexander Braverman –  Alexander Braverman 2011-09-20 23:23:16 +00:00 Commented Sep 20, 2011 at 23:23 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions rt.representation-theory ra.rings-and-algebras differential-operators d-modules See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 14 On the definition of regularity 1 existence of global good filtration for D-modules? 8 Poisson structure on the cotangent bundle 3 Koszul complex of a $\\mathcal{D}$-module 5 Quotient of the algebra of differential operators by an ideal generated by functions 4 Singular support in Bezrukavnikov's equivalence $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 75891, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "rt.representation-theory,ra.rings-and-algebras,differential-operators,d-modules,rt.representation-theory,ra.rings-and-algebras,differential-operators,d-modules",
  "scraped_at": "2026-01-14T04:12:08.420312",
  "answer": ""
}