{
  "id": "q_89807",
  "mathoverflow_id": 89807,
  "url": "https://mathoverflow.net/questions/89807/minimum-solid-angle-and-aspect-ratio-of-an-n-simplex",
  "title": "mg.metric geometry - Minimum solid angle and aspect ratio of an $n$-simplex",
  "body": "In computational geometry and other fields, it is of interest to have degeneracy measures for shapes of simplices, which quantitatively seperate the regular simplex from degenerate simplices. In two dimensions, two such shape measures are the minimum angle of a triangle and its aspect ratio, i.e. the quotient of the radii of insphere and circumsphere. While many of these shape measures naturally generalize to higher dimensions, and are documented in literature for arbitrary dimension, I haven't found any source which relates the minimum solid angle of a simplex with any such shape measure in arbitrary dimensions. It is \"obvious\" that simplices with small solid angles at the corner vertices are degenerate, but I haven't found any source on this literature. Question or reference request: Can you relate the minimum solid angle of a $d$-dimensional simplex with its aspect ratio for arbitrary $d$? A possible answer would generalize Theorem 6.1 of \"A. Liu and B. Joe. Relationship between tetrahedron shape measures, BIT, 34 (1994)\" which states: For any tetrahedron $T$ we have $\\sqrt{3}/24 \\rho^2 \\leq \\sigma_{\\min} \\leq (2/(3^{1/4})) \\sqrt{\\rho}$, where $\\sigma_{\\min}$ is the minimum solid angle of $T$ and $\\rho$ denotes the aspect ratio of $T$. mg.metric-geometry convex-polytopes euclidean-geometry Share Cite Improve this question Follow edited Apr 30, 2019 at 0:04 Martin Sleziak 4,813 4 4 gold badges 39 39 silver badges 42 42 bronze badges asked Feb 28, 2012 at 22:58 shuhalo 5,613 1 1 gold badge 30 30 silver badges 49 49 bronze badges $\\endgroup$ 5 1 $\\begingroup$ Of course you cannot have an equality relating $\\sigma_{\\min}$ to $\\rho$ because you could fix $\\sigma_{\\min}$ (say, in a \"needle\" tetrahedron) while varying $\\rho$. So are you asking for tighter bounds than provided by Liu-Joe? Do they say the bounds are not tight? $\\endgroup$ Joseph O'Rourke –  Joseph O'Rourke 2012-02-29 01:40:16 +00:00 Commented Feb 29, 2012 at 1:40 $\\begingroup$ I conjecture he is asking for this in arbitrary dimension... $\\endgroup$ Igor Rivin –  Igor Rivin 2012-02-29 03:35:45 +00:00 Commented Feb 29, 2012 at 3:35 $\\begingroup$ Well, I have corrected an error. Of course, the quotient is insphere to circumsphere, not the other way around. - Any falsification of this, which I don't believe to be true, would pose some conceptual problems in computational geometry for higher dimensions, so this question is indeed motivated. And yes, I am asking for this in arbitrary dimension. I made it explicit in the text body. $\\endgroup$ shuhalo –  shuhalo 2012-02-29 10:40:32 +00:00 Commented Feb 29, 2012 at 10:40 $\\begingroup$ @Martin & @Igor: OK, I see the question now. Thanks. $\\endgroup$ Joseph O'Rourke –  Joseph O'Rourke 2012-02-29 11:13:34 +00:00 Commented Feb 29, 2012 at 11:13 $\\begingroup$ See Boris Bukh's question, Angle of a regular simplex . $\\endgroup$ Joseph O'Rourke –  Joseph O'Rourke 2015-11-21 17:50:50 +00:00 Commented Nov 21, 2015 at 17:50 Add a comment  |  0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions mg.metric-geometry convex-polytopes euclidean-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Linked 26 Angle of a regular simplex Related 8 Side-Angle-Side Congruence and the Parallel Postulate 15 Pythagorean theorem for right-corner hyperbolic simplices? 26 Angle of a regular simplex 9 Which values can attain the minimum solid angle in a simplex 4 Centroid and center circumscribed spheres in simplex $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 89807, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "mg.metric-geometry,convex-polytopes,euclidean-geometry,mg.metric-geometry,convex-polytopes,euclidean-geometry",
  "scraped_at": "2026-01-14T04:11:36.923182",
  "answer": ""
}