{
  "id": "q_99858",
  "mathoverflow_id": 99858,
  "url": "https://mathoverflow.net/questions/99858/are-finite-projective-planes-isomorphic-to-pg2-q-where-q-pk-with-p-a-prime",
  "title": "reference request - Are finite projective planes isomorphic to PG(2,q), where q=p^k with p a prime?",
  "body": "I can't find any reference to the following question: Are finite projective planes isomorphic to $PG(2,q)$, where $q=p^k$ with $p$ a prime? I think it's meaningless to continue studying without reading and understanding this result. I think Hilbert was the first to demonstrate this, but I can't find a reference. Can anyone help me in this matter? Thanks! reference-request plane-geometry Share Cite Improve this question Follow edited Jul 27, 2019 at 0:33 ssx 2,898 3 3 gold badges 16 16 silver badges 37 37 bronze badges asked Jun 17, 2012 at 20:34 Frederick Silva 1 $\\endgroup$ 7 6 $\\begingroup$ It's not true, you must have wrong information. You can start here: en.wikipedia.org/wiki/Non-Desarguesian_plane $\\endgroup$ Felipe Voloch –  Felipe Voloch 2012-06-17 20:43:06 +00:00 Commented Jun 17, 2012 at 20:43 3 $\\begingroup$ it isn't true... there are non-Desarguesian projective planes with 91 points and 91 lines. $\\endgroup$ zeb –  zeb 2012-06-17 20:43:45 +00:00 Commented Jun 17, 2012 at 20:43 1 $\\begingroup$ See also en.wikipedia.org/wiki/Projective_plane#Finite_projective_planes . $\\endgroup$ Qiaochu Yuan –  Qiaochu Yuan 2012-06-17 23:36:29 +00:00 Commented Jun 17, 2012 at 23:36 2 $\\begingroup$ Well, it is true for certain $q=p^k$, such as $q<=8$. I'd bet my boots it is also true for $k=1$ but this is a huge unsolved problem, not a literature search. $\\endgroup$ Gordon Royle –  Gordon Royle 2012-06-18 02:09:50 +00:00 Commented Jun 18, 2012 at 2:09 2 $\\begingroup$ @Felipe I'm not sure why it needs that assumption; the first part is true because for $q \\leq 8$ we know everything and only Desarguesian planes exist. For $k=1$, I was referring to the fact that it is widely conjectured that projective planes of prime order are desarguesian which is independent of whether planes of non-prime- power order exist. $\\endgroup$ Gordon Royle –  Gordon Royle 2012-06-18 06:10:43 +00:00 Commented Jun 18, 2012 at 6:10  |  Show 2 more comments 0 Sorted by: Reset to default Highest score (default) Date modified (newest first) Date created (oldest first) You must log in to answer this question. Start asking to get answers Find the answer to your question by asking. Ask question Explore related questions reference-request plane-geometry See similar questions with these tags. The Overflow Blog Now everyone can chat on Stack Overflow Featured on Meta A proposal for bringing back Community Promotion & Open Source Ads Community Asks Sprint Announcement – January 2026: Custom site-specific badges! Citation Helper v2 - User Script edition! Related 9 A heart for stable equivariant homotopy theory 17 The cone of positive semidefinite matrices is self-dual? (reference needed) 7 Reference for projective covers of direct products of finite groups? 1 Was \"arithmetical translation\" (coding in the Goedel sense) ever a part of Hilbert's Program? 3 Reference for real and complex projective representation of finite group 6 Finite simple groups with three conjugacy classes of maximal local subgroups 6 Constructing M-curves à la Hilbert 4 Who and when proved Artin's Theorem on alternative rings? $(function() { $(\".js-gps-related-questions .spacer\").on(\"click\", function () { fireRelatedEvent($(this).index() + 1, $(this).data('question-id')); }); function fireRelatedEvent(position, questionId) { StackExchange.using(\"gps\", function() { StackExchange.gps.track('related_questions.click', { position: position, originQuestionId: 99858, relatedQuestionId: +questionId, location: 'sidebar', source: 'Baseline' }); }); } }); Question feed",
  "tags": "reference-request,plane-geometry,reference-request,plane-geometry",
  "scraped_at": "2026-01-14T04:11:41.449419",
  "answer": ""
}